const l={map:'[{"cookie":["0.0"],"介绍":["0.1","2.1","3.1"],"导入":["0.2","2.2","3.2"],"使用":["0.3","2.3","3.3"],"获取":["0.4"],"设置":["0.5"],"删除":["0.6"],"清空":["0.7"],"前言":["1.0"],"string":["2.0"],"判断字符串是否为空":["2.4"],"获取字符串长度":["2.5"],"格式化字节":["2.6"],"url":["3.0"],"获取url的参数":["3.4"],"获取url的hash":["3.5"],"获取url的路径":["3.6"],"更新日志":["4.0"],"贡献指南":["5.0"],"入门":["6.0"],"项目简介":["6.1"],"使用理由":["6.2"],"兼容性":["6.3"],"开发人员":["6.4"],"负责人":["6.5"],"贡献者":["6.6"],"入群交流":["6.7"],"安装":["7.0"],"在npm项目下使用":["7.1"],"在html单页面下使用":["7.2"],"项目计划":["8.0"],"提示":["10.0"]},{"0":["4.1","4.2"],"山奈提供了一些常用的":["0.1"],"js":["0.2","2.2","3.2"],"cookie":["0.4","0.5","0.6","0.7"],"在本站的api信息栏目中":["1.0"],"山奈提供了一些字符串处理的函数":["2.1"],"获取字符串的长度":["2.5"],"将字节格式化为":["2.6"],"b":["2.6"],"kb":["2.6"],"mb":["2.6"],"url":["3.1"],"获取":["3.4","3.5","3.6"],"我们使用":["5.0"],"yarn":["5.0"],"作为包管理工具":["5.0"],"请先安装":["5.0"],"warning":["6.0"],"山奈":["6.1"],"galanga":["6.1"],"以下简称山奈":["6.1"],"相比其他的函数库":["6.2"],"单元测试保证支持如下环境":["6.3"],"ie":["6.3"],"vpteammembers":["6.5"],"请在github上或者gitee上查看贡献者名单":["6.6"],"为了方便各位开发者的交流":["6.7"],"在npm项目下":["7.1"],"您可以通过以下命令安装山奈":["7.1"],"在html单页面下":["7.2"],"您可以在官方仓库内下载山奈的打包产物":["7.2"],"然后引入至您的html文件中":["7.2"],"这里列出会在未来添加的新功能":["8.0"],"这是一个基于":["10.0"]},{"cookie":["0.1"],"import":["0.2","2.2","3.2"],"清空所有":["0.7"],"您可以查看您所需要的api的详细信息":["1.0"],"用于处理字符串":["2.1"],"如果字符串为空":["2.4","2.5"],"gb":["2.6"],"tb":["2.6"],"pb":["2.6"],"eb":["2.6"],"zb":["2.6"],"是一个用于处理":["3.1"],"url":["3.4","3.5","3.6"],"的":["3.5"],"bash":["5.0","7.1"],"npm":["5.0","7.1"],"install":["5.0","7.1"],"g":["5.0"],"安装依赖":["5.0"],"本项目仍处于开发阶段":["6.0"],"是川菜中常用的调味品":["6.1"],"也可以用作腌制成为单独的菜品":["6.1"],"而这一辅料被人们俗称为姜":["6.1"],"山奈希望提供在业务中常用的一些函数":["6.2"],"ch":["6.3"],"ff":["6.3"],"sf":["6.3"],"size":["6.5"],"如果您也想对山奈做出贡献":["6.6"],"我们在各大平台都开设了有关山奈的交流群":["6.7"],"欢迎大家加入":["6.7"],"例如您将山奈的打包产物放在":["7.2"],"js":["7.2"],"galanga":["7.2"],"目录下":["7.2"],"和已经完成的功能":["8.0"],"vitepress":["10.0"]},{"1":["4.2"],"19":["4.1"],"2023":["4.1"],"操作函数":["0.1"],"localcookie":["0.2"],"的值":["0.4","0.5"],"如果":["0.4","0.5"],"请注意的是":["1.0"],"checknull":["2.2"],"则返回":["2.4","2.5"],"true":["2.4"],"yb":["2.6"],"输入参数":["2.6"],"bytes":["2.6"],"字节数":["2.6"],"一个json对象":["2.6"],"url":["3.2"],"参数的值":["3.4"],"如果参数不存在":["3.4"],"hash":["3.5"],"值":["3.5"],"的路径":["3.6"],"如果路径不存在":["3.6"],"一键打包生成生产代码":["5.0"],"api可能会发生变化":["6.0"],"在web的世界里":["6.1"],"它是一个开源的实用的js函数库":["6.1"],"它的目标是提供一些常用的函数":["6.1"],"让你的代码更简洁更易读":["6.1"],"而山奈也是基于typescript开发的":["6.2"],"op":["6.3"],"ios":["6.3"],"android":["6.3"],"small":["6.5"],"请参考贡献指南":["6.6"],"qq":["6.7"],"galanga":["7.1"],"安装完成后":["7.1"],"您可以通过以下方式引入山奈":["7.2"],"html":["7.2"],"当然":["7.2"],"x":["8.0"],"的文档站点":["10.0"]},{"0":["2.5"],"3":["4.1"],"6":["6.3"],"29":["6.3"],"2023":["4.2"],"346363551":["6.7"],"包括获取":["0.1"],"from":["0.2","3.2"],"不存在":["0.4","0.5"],"js":["0.6","0.7","7.1"],"在这里演示的所有api均以es6的语法为基础":["1.0"],"strlength":["2.2"],"否则返回":["2.4"],"可选":["2.6"],"有以下内容":["2.6"],"decimals":["2.6"],"保留的小数位数":["2.6"],"的函数":["3.1"],"则返回":["3.4","3.6"],"如果":["3.5"],"run":["5.0"],"build":["5.0"],"运行单元测试":["5.0"],"test":["5.0"],"请勿用于生产环境":["6.0"],"我们希望利用姜来让您的代码更加美味":["6.1"],"让您更加专注于业务逻辑的实现":["6.1"],"使用es6":["6.1"],"因此在使用时":["6.2"],"node":["6.3"],"members":["6.5"],"以下是山奈的贡献者名单头像缩略图":["6.6"],"钉钉":["6.7"],"您可以在项目中引入山奈并使用对应的功能":["7.1"],"目前暂不支持将全部函数一键引入至项目内":["7.1"],"您也可以引入山奈的cdn链接":["7.2"],"引入完成后":["7.2"],"您可以在项目中使用全部功能":["7.2"],"已完成":["8.0"],"您也可以直接在这里浏览文档源文件":["10.0"]},{"2":["4.2"],"9":["6.3"],"50":["6.3"],"55":["6.3"],"设置":["0.1"],"删除":["0.1"],"galanga":["0.2","3.2"],"则返回":["0.4","3.5"],"null":["0.4","3.4","3.6"],"则创建":["0.5"],"localcookie":["0.6","0.7"],"如果您使用的是其他类型的语言":["1.0"],"formatbytes":["2.2"],"false":["2.4"],"js":["2.5","3.4"],"默认为1":["2.6"],"from":["2.6","7.1"],"输入的字节单位":["2.6"],"默认为b":["2.6"],"to":["2.6"],"它提供了一些方便的方法来处理":["3.1"],"不存在":["3.5"],"注意":["5.0"],"浏览器环境需要手动测试":["5.0"],"位于":["5.0"],"browser":["5.0"],"修改":["5.0"],"和typescript编写源码":["6.1"],"编译生成生产代码":["6.1"],"多环境支持":["6.1"],"您可以获得更好的类型提示":["6.2"],"贡献者名单":["6.6"],"山奈galanga开源js函数库交流群":["6.7"],"telegram":["6.7"],"import":["7.1"],"name":["7.1"],"目前暂不支持将部分函数单独引入至项目内":["7.2"],"console":["7.2"],"log":["7.2"],"未完成":["8.0"]},{"4":["6.3"],"js":["0.4","0.5","2.4","2.6","3.5","3.6"],"localcookie":["0.4","0.5"],"removeitem":["0.6"],"clear":["0.7"],"您需要自行转换":["1.0"],"from":["2.2"],"checknull":["2.4"],"strlength":["2.5"],"输出的字节单位":["2.6"],"const":["2.6"],"json":["2.6","5.0"],"null":["3.5"],"修复了":["4.1"],"formatbytes":["4.1"],"package":["5.0"],"中的版本号":["5.0"],"readme":["5.0"],"支持浏览器原生":["6.1"],"支持amd":["6.1"],"cmd":["6.1"],"支持webpack":["6.1"],"censujiang":["6.7"],"console":["7.1"],"name":["7.2"],"我们更推荐使用npm项目的方式引入山奈":["7.2"]},{"1":["2.6"],"等":["0.1"],"getitem":["0.4"],"name":["0.4","0.5","0.6","2.4","2.5","3.4"],"setitem":["0.5"],"galanga":["2.2"],"getquery":["3.4"],"gethash":["3.5"],"getpath":["3.6"],"函数的两个bug":["4.1"],"项目发布测试版本":["4.2"],"md":["5.0"],"changelog":["5.0"],"然后发布新版":["5.0"],"rollup":["6.1"],"fis等":["6.1"],"支持node":["6.1"],"注意":["6.3"],"编译代码依赖es5环境":["6.3"],"对于ie6":["6.3"],"group":["6.7"],"微信":["6.7"],"log":["7.1"],"我们在后文的使用示例中":["7.1"],"因为这样不仅可以更好地管理依赖":["7.2"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["7.2"],"在查看后文的使用示例时":["7.2"],"请使用":["7.2"]},{"1024":["2.6"],"value":["0.5"],"formatbytes":["2.6"],"release":["5.0"],"无依赖":["6.1"],"体积小巧":["6.1"],"8需要引入es5":["6.3"],"shim才可以兼容":["6.3"],"微信群":["6.7"],"基本上都是使用这种方式引入山奈的":["7.1"],"作为全局变量后再加具体的功能函数名":["7.2"]}]'},n={"0.0":{t:"cookie",p:"\r",l:"api/cookie.html",a:"cookie"},"0.1":{t:"介绍",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#介绍",a:"介绍"},"0.2":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"0.3":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"0.4":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
localCookie.getItem('name ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"0.5":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
localCookie.setItem('na ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"0.6":{t:"删除-cookie",p:`删除 Cookie。
localCookie.removeItem('name')

`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"0.7":{t:"清空-cookie",p:`清空所有 Cookie。
localCookie.clear()

`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"1.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"2.0":{t:"string",p:"\r",l:"api/string.html",a:"string"},"2.1":{t:"介绍",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html#介绍",a:"介绍"},"2.2":{t:"导入",p:`import { checkNull , strLength , formatBytes } from 'galanga'
 ...`,l:"api/string.html#导入",a:"导入"},"2.3":{t:"使用",p:"\r",l:"api/string.html#使用",a:"使用"},"2.4":{t:"判断字符串是否为空",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
checkNull(name)

`,l:"api/string.html#判断字符串是否为空",a:"判断字符串是否为空"},"2.5":{t:"获取字符串长度",p:`获取字符串的长度，如果字符串为空，则返回 0。
strLength(name)

`,l:"api/string.html#获取字符串长度",a:"获取字符串长度"},"2.6":{t:"格式化字节",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
输入参数：


bytes：字节数


一个json对 ...`,l:"api/string.html#格式化字节",a:"格式化字节"},"3.0":{t:"url",p:"\r",l:"api/url.html",a:"url"},"3.1":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"3.2":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"3.3":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"3.4":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
url.getQuery('name')

`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"3.5":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
url.getHash()

`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"3.6":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
url.getPath()

`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"4.0":{t:"更新日志",p:"",l:"guide/changelog.html",a:"更新日志"},"4.1":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"4.2":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"5.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"6.0":{t:"入门",p:`::: warning
本项目仍处于开发阶段，API可能会发生变化，请勿用于生产环境。
:::
`,l:"guide/index.html",a:"入门"},"6.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"6.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"6.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"6.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"6.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"6.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"6.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"7.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"7.1":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
npm install galanga

安装完成后，您可以在项目中引入山奈并 ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"7.2":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"8.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"10.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},e={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},t={INDEX_DATA:l,PREVIEW_LOOKUP:n,Options:e};export{t as default};
