const l={map:'[{"cookie":["0.0"],"localcookie":["0.1"],"简介":["0.2"],"导入":["0.3","2.3","2.7","2.11","2.15","2.19","3.3"],"使用":["0.4","2.4","2.8","2.12","2.16","2.20","3.4"],"获取":["0.5"],"设置":["0.6"],"删除":["0.7"],"清空":["0.8"],"前言":["1.0"],"string":["2.0"],"checknull":["2.1"],"介绍":["2.2","2.6","2.10","2.14","2.18","3.2"],"strlength":["2.5"],"formatbytes":["2.9"],"checkpassword":["2.13"],"checkemail":["2.17"],"url":["3.0","3.1"],"获取url的参数":["3.5"],"获取url的hash":["3.6"],"获取url的路径":["3.7"],"更新日志":["4.0"],"贡献指南":["5.0"],"入门":["6.0"],"项目简介":["6.1"],"使用理由":["6.2"],"兼容性":["6.3"],"开发人员":["6.4"],"负责人":["6.5"],"贡献者":["6.6"],"入群交流":["6.7"],"安装":["7.0"],"在npm项目下使用":["7.1"],"全部引入":["7.2"],"按需引入":["7.3"],"在html单页面下使用":["7.4"],"项目计划":["8.0"],"提示":["10.0"]},{"0":["4.1","4.2","4.3","4.4"],"山奈提供了一些常用的":["0.0"],"localcookie":["0.2"],"js":["0.3","2.3","2.7","2.11","2.15","2.19","3.3","7.2","7.3"],"cookie":["0.5","0.6","0.7","0.8"],"在本站的api信息栏目中":["1.0"],"山奈提供了一些字符串处理的函数":["2.0"],"判断字符串是否为空":["2.2"],"code":["2.4","2.8","2.20"],"获取字符串的长度":["2.6"],"将字节格式化为":["2.10"],"输入参数":["2.12","2.16"],"bytes":["2.12"],"字节数":["2.12"],"一个json对象":["2.12","2.16"],"可选":["2.12","2.16"],"检查密码强度的函数":["2.14"],"password":["2.16"],"密码":["2.16"],"有以下内容":["2.16"],"minlength":["2.16"],"密码最小长度":["2.16"],"默认为8":["2.16"],"检查邮箱格式的函数":["2.18"],"group":["2.20"],"山奈提供了一些方便的方法来处理":["3.0"],"url":["3.2","3.5","3.6","3.7"],"获取":["3.5","3.6","3.7"],"我们使用":["5.0"],"yarn":["5.0"],"作为包管理工具":["5.0"],"请先安装":["5.0"],"warning":["6.0"],"山奈":["6.1"],"galanga":["6.1"],"以下简称山奈":["6.1"],"相比其他的函数库":["6.2"],"单元测试保证支持如下环境":["6.3"],"ie":["6.3"],"vpteammembers":["6.5"],"请在github上或者gitee上查看贡献者名单":["6.6"],"为了方便各位开发者的交流":["6.7"],"在npm项目下":["7.1"],"您可以通过以下命令安装山奈":["7.1"],"在html单页面下":["7.4"],"您可以在官方仓库内下载山奈的打包产物":["7.4"],"然后引入至您的html文件中":["7.4"],"这里列出会在未来添加的新功能":["8.0"],"这是一个基于":["10.0"]},{"是一个对象":["0.2"],"import":["0.3","2.3","2.7","2.11","2.15","2.19","3.3","7.2","7.3"],"的值":["0.5","0.6"],"如果":["0.5","0.6"],"code":["0.7","7.1"],"清空所有":["0.8"],"您可以查看您所需要的api的详细信息":["1.0"],"用于处理字符串":["2.0"],"如果字符串为空":["2.2","2.6"],"group":["2.4","2.8","7.1"],"js":["2.4","2.8","2.20","7.4"],"b":["2.10"],"有以下内容":["2.12"],"decimals":["2.12"],"保留的小数位数":["2.12"],"默认为1":["2.12"],"from":["2.12"],"输入的字节单位":["2.12"],"如果符合要求":["2.14","2.18"],"maxlength":["2.16"],"密码最大长度":["2.16"],"默认为16":["2.16"],"types":["2.16"],"字符类型":["2.16"],"分别为数字":["2.16"],"小写字母":["2.16"],"大写字母":["2.16"],"特殊字符":["2.16"],"按需引入":["2.20"],"是一个用于处理":["3.2"],"参数的值":["3.5"],"如果参数不存在":["3.5"],"则返回":["3.5"],"的":["3.6"],"hash":["3.6"],"值":["3.6"],"的路径":["3.7"],"如果路径不存在":["3.7"],"bash":["5.0"],"npm":["5.0"],"install":["5.0"],"g":["5.0"],"安装依赖":["5.0"],"本项目仍处于开发阶段":["6.0"],"是川菜中常用的调味品":["6.1"],"也可以用作腌制成为单独的菜品":["6.1"],"而这一辅料被人们俗称为姜":["6.1"],"山奈希望提供在业务中常用的一些函数":["6.2"],"ch":["6.3"],"ff":["6.3"],"sf":["6.3"],"size":["6.5"],"如果您也想对山奈做出贡献":["6.6"],"我们在各大平台都开设了有关山奈的交流群":["6.7"],"欢迎大家加入":["6.7"],"例如您将山奈的打包产物放在":["7.4"],"galanga":["7.4"],"目录下":["7.4"],"和已经完成的功能":["8.0"],"vitepress":["10.0"]},{"1":["4.4"],"19":["4.3"],"20":["4.2"],"21":["4.1"],"2023":["4.1","4.2","4.3"],"操作函数":["0.0"],"包含了一些常用的":["0.2"],"cookie":["0.2"],"localcookie":["0.3"],"不存在":["0.5","0.6","3.6"],"则返回":["0.5","2.2","2.6","2.14","2.18","3.7"],"则创建":["0.6"],"group":["0.7","0.8","2.12"],"js":["0.7"],"code":["0.8","2.12","3.5","3.7"],"请注意的是":["1.0"],"checknull":["2.3"],"按需引入":["2.4","2.8"],"strlength":["2.7"],"kb":["2.10"],"mb":["2.10"],"formatbytes":["2.11"],"默认为b":["2.12"],"to":["2.12"],"输出的字节单位":["2.12"],"checkpassword":["2.15"],"默认为":["2.16"],"number":["2.16"],"lowercase":["2.16"],"uppercase":["2.16"],"special":["2.16"],"mintypes":["2.16"],"最少包含的字符类型":["2.16"],"默认为2":["2.16"],"maxtypes":["2.16"],"checkemail":["2.19","2.20"],"info":["2.20"],"url":["3.3"],"null":["3.5","3.7"],"如果":["3.6"],"一键打包生成生产代码":["5.0"],"api可能会发生变化":["6.0"],"在web的世界里":["6.1"],"它是一个开源的实用的js函数库":["6.1"],"它的目标是提供一些常用的函数":["6.1"],"让你的代码更简洁更易读":["6.1"],"而山奈也是基于typescript开发的":["6.2"],"op":["6.3"],"ios":["6.3"],"android":["6.3"],"small":["6.5"],"请参考贡献指南":["6.6"],"qq":["6.7"],"bash":["7.1"],"yarn":["7.1"],"galanga":["7.2"],"from":["7.2","7.3"],"name":["7.3"],"您可以通过以下方式引入山奈":["7.4"],"html":["7.4"],"当然":["7.4"],"x":["8.0"],"的文档站点":["10.0"]},{"0":["2.6"],"1":["2.12"],"3":["4.1","4.2","4.3"],"6":["6.3"],"29":["6.3"],"2023":["4.4"],"346363551":["6.7"],"包括获取":["0.0"],"操作函数":["0.2"],"from":["0.3","2.3","2.7","2.11","2.15","2.19","3.3"],"null":["0.5","3.6"],"code":["0.5","0.6","2.16","3.6"],"group":["0.5","0.6","2.16","3.5","3.7"],"js":["0.6","0.8","2.12","2.16","3.5","3.7"],"按需引入":["0.7","0.8","2.12","2.16","3.5"],"localcookie":["0.7"],"在这里演示的所有api均以es6的语法为基础":["1.0"],"true":["2.2","2.14","2.18"],"checknull":["2.4"],"name":["2.4","2.8"],"strlength":["2.8"],"gb":["2.10"],"const":["2.12","2.16"],"json":["2.12","2.16"],"最多包含的字符类型":["2.16"],"默认为4":["2.16"],"sancerain":["2.20"],"com":["2.20"],"的函数":["3.2"],"则返回":["3.6"],"run":["5.0"],"build":["5.0"],"运行单元测试":["5.0"],"test":["5.0"],"请勿用于生产环境":["6.0"],"我们希望利用姜来让您的代码更加美味":["6.1"],"让您更加专注于业务逻辑的实现":["6.1"],"使用es6":["6.1"],"因此在使用时":["6.2"],"node":["6.3"],"members":["6.5"],"以下是山奈的贡献者名单头像缩略图":["6.6"],"钉钉":["6.7"],"add":["7.1"],"galanga":["7.3"],"您也可以引入山奈的cdn链接":["7.4"],"引入完成后":["7.4"],"您可以在项目中使用全部功能":["7.4"],"已完成":["8.0"],"您也可以直接在这里浏览文档源文件":["10.0"]},{"2":["2.16","4.4"],"8":["2.16"],"9":["6.3"],"16":["2.16"],"19":["4.2"],"22":["4.1"],"50":["6.3"],"55":["6.3"],"1024":["2.12"],"设置":["0.0","0.2"],"删除":["0.0"],"包括获取":["0.2"],"galanga":["0.3","2.3","2.7","2.11","2.15","2.19","3.3","7.1"],"js":["0.5","3.6"],"按需引入":["0.5","0.6","3.6","3.7"],"localcookie":["0.5","0.6","0.8"],"setitem":["0.6"],"name":["0.6","0.7","3.5"],"removeitem":["0.7"],"clear":["0.8"],"如果您使用的是其他类型的语法或者安装方法":["1.0"],"否则返回":["2.2","2.14","2.18"],"全局引入":["2.4","2.8","2.20"],"tb":["2.10"],"pb":["2.10"],"b":["2.12"],"kb":["2.12"],"formatbytes":["2.12"],"它提供了一些方便的方法来处理":["3.2"],"getquery":["3.5"],"group":["3.6"],"新增了":["4.1","4.2"],"注意":["5.0"],"浏览器环境需要手动测试":["5.0"],"位于":["5.0"],"browser":["5.0"],"修改":["5.0"],"和typescript编写源码":["6.1"],"编译生成生产代码":["6.1"],"多环境支持":["6.1"],"您可以获得更好的类型提示":["6.2"],"贡献者名单":["6.6"],"山奈galanga开源js函数库交流群":["6.7"],"telegram":["6.7"],"npm":["7.1"],"console":["7.2","7.3","7.4"],"log":["7.3","7.4"],"目前暂不支持将部分函数单独引入至项目内":["7.4"],"未完成":["8.0"]},{"4":["2.16","6.3"],"12345678":["2.16"],"删除":["0.2"],"getitem":["0.5"],"name":["0.5","7.4"],"value":["0.6"],"全局引入":["0.6","0.7","0.8","2.12","2.16","3.5","3.7"],"galanga":["0.7","2.4","2.8","2.20"],"您需要自行转换":["1.0"],"false":["2.2","2.14","2.18"],"eb":["2.10"],"var":["2.12","2.16"],"checkpassword":["2.16","4.2"],"gethash":["3.6"],"getpath":["3.7"],"checkemail":["4.1"],"修复了":["4.3"],"formatbytes":["4.3"],"package":["5.0"],"json":["5.0"],"中的版本号":["5.0"],"readme":["5.0"],"支持浏览器原生":["6.1"],"支持amd":["6.1"],"cmd":["6.1"],"支持webpack":["6.1"],"censujiang":["6.7"],"install":["7.1"],"log":["7.2"],"我们更推荐使用npm项目的方式引入山奈":["7.4"]},{"等":["0.0","0.2"],"全局引入":["0.5","3.6"],"galanga":["0.5","0.6","0.8","3.5","3.6","3.7"],"zb":["2.10"],"yb":["2.10"],"函数":["4.1","4.2"],"用于检查邮箱格式":["4.1"],"用于检查密码强度":["4.2"],"函数的两个bug":["4.3"],"项目发布测试版本":["4.4"],"md":["5.0"],"changelog":["5.0"],"然后发布新版":["5.0"],"rollup":["6.1"],"fis等":["6.1"],"支持node":["6.1"],"注意":["6.3"],"编译代码依赖es5环境":["6.3"],"对于ie6":["6.3"],"group":["6.7"],"微信":["6.7"],"安装完成后":["7.1"],"name":["7.2"],"我们在后文的使用示例中":["7.3"],"基本上都是使用这种方式引入山奈的":["7.3"],"因为这样不仅可以更好地管理依赖":["7.4"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["7.4"],"在查看后文的使用示例时":["7.4"],"请使用":["7.4"]},{"galanga":["2.12","2.16"],"release":["5.0"],"无依赖":["6.1"],"体积小巧":["6.1"],"8需要引入es5":["6.3"],"shim才可以兼容":["6.3"],"微信群":["6.7"],"您可以在项目中引入山奈并使用对应的功能":["7.1"],"作为全局变量后再加具体的功能函数名":["7.4"]}]'},a={"0.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"0.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"0.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"0.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"0.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"0.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"0.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
::: code-group
localCoo ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"0.7":{t:"删除-cookie",p:`删除 Cookie。
::: code-group
localCookie.removeItem('name')

gala ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"0.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"1.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"2.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"2.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"2.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"2.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"2.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"2.5":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"2.6":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"2.7":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"2.8":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"2.9":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"2.10":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"2.11":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"2.12":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"2.13":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"2.14":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"2.15":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"2.16":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"2.17":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"2.18":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"2.19":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"2.20":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"3.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"3.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"3.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"3.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"3.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"3.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"3.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"3.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
::: code-group
url.getPath()

gal ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"4.0":{t:"更新日志",p:"",l:"guide/changelog.html",a:"更新日志"},"4.1":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"4.2":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"4.3":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"4.4":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"5.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"6.0":{t:"入门",p:`::: warning
本项目仍处于开发阶段，API可能会发生变化，请勿用于生产环境。
:::
`,l:"guide/index.html",a:"入门"},"6.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"6.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"6.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"6.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"6.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"6.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"6.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"7.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"7.1":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"7.2":{t:"全部引入",p:`import galanga from 'galanga'

console.log(galanga.name)

`,l:"guide/install.html#全部引入",a:"全部引入"},"7.3":{t:"按需引入",p:`import { name } from 'galanga'

console.log(name)

我们在后文的使用示例中 ...`,l:"guide/install.html#按需引入",a:"按需引入"},"7.4":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"8.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"10.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},n={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},e={INDEX_DATA:l,PREVIEW_LOOKUP:a,Options:n};export{e as default};
