const e={map:'[{"array":["0.0"],"filteruniquebyproperty":["0.1"],"介绍":["0.2","2.2","3.2","3.7","5.2","6.2","6.6","7.2","8.2","8.6","8.10","9.2","9.6","9.10","9.14","9.18","9.22","9.26","9.30","9.34","9.38","10.2"],"导入":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","8.3","8.7","8.11","9.3","9.7","9.11","9.15","9.19","9.23","9.27","9.31","9.35","9.39","10.3","10.12"],"使用":["0.4","1.4","2.4","3.4","3.9","5.4","6.4","6.8","7.4","8.4","8.8","8.12","9.4","9.8","9.12","9.16","9.20","9.24","9.28","9.32","9.36","9.40","10.4","10.13"],"cookie":["1.0"],"localcookie":["1.1"],"简介":["1.2"],"获取":["1.5"],"设置":["1.6"],"删除":["1.7"],"清空":["1.8"],"date":["2.0"],"aftertime":["2.1"],"device":["3.0"],"checkdevicetype":["3.1"],"v0":["3.5","3.10"],"clipboard":["3.6"],"前言":["4.0"],"number":["5.0"],"formatnumber":["5.1"],"object":["6.0"],"updateobjectfromimport":["6.1"],"shakeobject":["6.5"],"other":["7.0"],"sleep":["7.1"],"permission":["8.0"],"notificationpermission":["8.1"],"clipboardpermission":["8.5"],"locationpermission":["8.9"],"string":["9.0"],"checknull":["9.1"],"checknotnull":["9.5"],"strlength":["9.9"],"formatbytes":["9.13"],"checkpassword":["9.17"],"checkemail":["9.21"],"encode62":["9.25"],"getfilenamefromurl":["9.29"],"getfileextfromstring":["9.33"],"splicesitetitle":["9.37"],"url":["10.0","10.1"],"获取url的参数":["10.5"],"获取url的hash":["10.6"],"获取url的路径":["10.7"],"设置url的参数":["10.8"],"设置url的hash":["10.9"],"设置url的路径":["10.10"],"getpreurl":["10.11"],"更新日志":["11.0"],"贡献指南":["12.0"],"入门":["13.0"],"项目简介":["13.1"],"使用理由":["13.2"],"兼容性":["13.3"],"开发人员":["13.4"],"负责人":["13.5"],"贡献者":["13.6"],"入群交流":["13.7"],"安装":["14.0"],"主版本":["14.1"],"在npm项目下使用":["14.2","14.5"],"在html单页面下使用":["14.3"],"uni":["14.4"],"在":["14.6"],"项目计划":["15.0"],"提示":["17.0"]},{"0":["11.1","11.2","11.3","11.4","11.5","11.6","11.7","11.8","11.9","11.10","11.11","11.12","11.13","11.14","11.15","11.16","11.17","11.18","11.19","11.20","11.21","11.22"],"1":["3.5","3.10","11.1","11.4","11.5","11.6","11.7","11.12"],"2":["11.1"],"6":["3.5"],"7":["3.10"],"8":["11.4"],"2023":["11.4"],"山奈提供了一些数组的操作方法":["0.0"],"根据数组中对象的某个属性去重":["0.2"],"js":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","8.3","8.7","8.11","9.3","9.7","9.11","9.15","9.19","9.23","9.27","9.31","9.32","9.35","9.39","10.3","10.12"],"输入的参数如下":["0.4","3.4","5.4","6.4","6.8"],"array":["0.4"],"山奈提供了一些常用的":["1.0"],"localcookie":["1.2"],"cookie":["1.5","1.6","1.7","1.8"],"的值":["1.6"],"如果":["1.6"],"山奈提供了一些时间处理的工具函数":["2.0"],"badge":["2.1","8.1","8.5","8.9"],"输出当前时间之后的时间":["2.2"],"输入参数如下":["2.4"],"必填":["2.4"],"time":["2.4"],"时间":["2.4"],"山奈提供了一些有关设备操作的api":["3.0"],"检查当前设备的各种类型":["3.2"],"type":["3.4"],"要检查的类型":["3.4"],"此参数为一个数组":["3.4"],"默认为":["3.4"],"browser":["3.4"],"device":["3.4"],"之前":["3.5","3.10"],"从":["3.5","3.10"],"一个用于读取和设置剪切板的函数组合":["3.7"],"一共有两个函数":["3.9"],"分别是":["3.9"],"read":["3.9"],"和":["3.9","9.25"],"write":["3.9"],"分别用于读取和设置剪切板":["3.9"],"async":["3.9","8.8","8.12"],"onlystring":["3.9"],"在本站的api信息栏目中":["4.0"],"山奈提供了一些数学函数":["5.0"],"格式化数字":["5.2"],"number":["5.4"],"山奈提供了一些有关对象的方法":["6.0"],"将新的object中的值动态更新到原有的object中":["6.2"],"importobject":["6.4"],"object":["6.4","6.8"],"新的object":["6.4"],"用于更新原有的object":["6.4"],"通过一个数组":["6.6"],"一些杂项或者小小的语法糖":["7.0"],"sleep":["7.2"],"传入一个数字":["7.4"],"山奈提供了一些api用于您去获取或判断是否获取了一些浏览器权限":["8.0"],"这是一个函数集合":["8.2","8.6","8.10"],"此集合有两个子函数":["8.4","8.8","8.12"],"分别如下":["8.4","8.8","8.12"],"check":["8.4","8.8","8.12"],"用于判断是否获取了通知权限":["8.4"],"用于判断是否获取了剪贴板权限":["8.8"],"用于判断是否获取了地理位置权限":["8.12"],"山奈提供了一些字符串处理的函数":["9.0"],"判断字符串是否为空":["9.2"],"code":["9.4","9.8","9.12","9.24","9.32","9.36","10.13","14.2","14.5"],"判断字符串是否不为空":["9.6"],"获取字符串的长度":["9.10"],"将字节格式化为":["9.14"],"输入参数":["9.16","9.20"],"bytes":["9.16"],"字节数":["9.16"],"一个json对象":["9.16","9.20"],"可选":["9.16","9.20"],"检查密码强度的函数":["9.18"],"password":["9.20"],"密码":["9.20"],"有以下内容":["9.20","9.40"],"minlength":["9.20"],"密码最小长度":["9.20"],"默认为8":["9.20"],"检查邮箱格式的函数":["9.22"],"group":["9.24","9.32","9.36","14.2","14.5"],"将数字转换为62进制的字符串":["9.26","9.28"],"encode62":["9.28"],"输入参数为数字":["9.28"],"输出参数为字符串":["9.28"],"从url中获取文件名":["9.30"],"从字符串中获取文件后缀名":["9.34"],"截取网站标题的函数":["9.38"],"将会传入一个json对象":["9.40"],"不传入则使用默认值":["9.40"],"title":["9.40"],"页面标题":["9.40"],"山奈提供了一些方便的方法来处理":["10.0"],"url":["10.2","10.5","10.6","10.7","10.8","10.9","10.10"],"获取":["10.5","10.6","10.7"],"的路径":["10.7"],"设置":["10.8","10.9","10.10"],"的参数":["10.8"],"的":["10.9"],"获取上一个":["10.11"],"我们使用":["12.0"],"yarn":["12.0","14.2","14.5"],"作为包管理工具":["12.0"],"请先安装":["12.0"],"tip":["13.0"],"山奈":["13.1"],"galanga":["13.1"],"以下简称山奈":["13.1"],"相比其他的函数库":["13.2"],"单元测试保证支持如下环境":["13.3"],"ie":["13.3"],"vpteammembers":["13.5"],"请在github上或者gitee上查看贡献者名单":["13.6"],"为了方便各位开发者的交流":["13.7"],"main":["14.1"],"在npm项目下":["14.2","14.5"],"您可以通过以下命令安装山奈":["14.2","14.5"],"bash":["14.2","14.5"],"在html单页面下":["14.3"],"您可以在官方仓库内下载山奈的打包产物":["14.3","14.6"],"然后引入至您的html文件中":["14.3"],"app版本":["14.4"],"uni":["14.6"],"modules":["14.6"],"下使用":["14.6"],"在uni":["14.6"],"modules下":["14.6"],"这里列出会在未来添加的新功能":["15.0"],"这是一个基于":["17.0"]},{"1":["11.3","11.8","11.9","11.10","11.11"],"2":["11.2"],"3":["11.9"],"5":["11.7","11.12"],"6":["11.4","11.6"],"7":["11.1","11.5"],"11":["11.12"],"13":["11.1"],"22":["11.18"],"24":["11.16"],"26":["11.14"],"27":["11.13"],"2023":["11.1","11.5","11.6","11.7","11.12"],"可以帮助您更好的操作数组":["0.0"],"将length大的数组保留":["0.2"],"import":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","8.3","8.7","8.11","9.3","9.7","9.11","9.15","9.19","9.23","9.27","9.31","9.35","9.39","10.3","10.12"],"数组":["0.4"],"property":["0.4"],"是一个对象":["1.2"],"的值":["1.5"],"如果":["1.5","10.9"],"不存在":["1.6"],"则创建":["1.6"],"输入参数如下":["1.6","1.7"],"必填":["1.6","1.7"],"skey":["1.6","1.7"],"清空所有":["1.8"],"type":["2.1","8.1","8.5","8.9"],"可以是一个时间戳":["2.4"],"也可以是一个时间字符串":["2.4"],"也可以是一个":["2.4"],"date":["2.4"],"可用来获取设备的信息":["3.0"],"包括浏览器类型":["3.2"],"os":["3.4"],"platform":["3.4"],"可选值为":["3.4"],"分别表示浏览器类型":["3.4"],"开始":["3.5","3.10"],"包含了":["3.7"],"读取剪切板的内容":["3.9"],"返回一个":["3.9"],"promise":["3.9"],"如果读取成功":["3.9"],"则返回剪切板的内容":["3.9"],"否则返回":["3.9"],"null":["3.9","10.7"],"这个函数的参数如下":["3.9"],"clipboard":["3.10"],"您可以查看您所需要的api的详细信息":["4.0"],"这些函数可以用于数值计算":["5.0"],"保留两位小数":["5.2"],"数字":["5.4"],"decimal":["5.4"],"这些方法可以帮助您更好地使用对象":["6.0"],"并不影响原有object中的结构":["6.2"],"原有的object":["6.4"],"code":["6.4"],"group":["6.4","9.4","9.8","9.12","10.13"],"js":["6.4","9.4","9.8","9.12","9.24","9.36","14.3","14.6"],"按需引入":["6.4","9.24","9.32","9.36"],"updateobjectfromimport":["6.4"],"将对象中的某些属性保留":["6.6"],"要摇树的对象":["6.8"],"array":["6.8"],"函数":["7.2"],"单位为毫秒":["7.4"],"延迟执行":["7.4"],"用于获取或判断是否获取了浏览器的通知权限":["8.2"],"返回一个布尔值或null":["8.4","8.8","8.12"],"true":["8.4","8.8","8.12"],"表示获取了权限":["8.4","8.8","8.12"],"false":["8.4","8.8","8.12"],"表示没有获取权限或浏览器不支持通知权限":["8.4"],"用于获取或判断是否获取了浏览器的剪贴板权限":["8.6"],"此函数是一个异步函数":["8.8","8.12"],"用于获取或判断是否获取了浏览器的地理位置权限":["8.10"],"用于处理字符串":["9.0"],"如果字符串为空":["9.2","9.10"],"非空":["9.6"],"如果字符串不为空":["9.6"],"b":["9.14"],"有以下内容":["9.16"],"decimals":["9.16"],"保留的小数位数":["9.16"],"默认为1":["9.16"],"from":["9.16"],"输入的字节单位":["9.16"],"如果符合要求":["9.18","9.22"],"maxlength":["9.20"],"密码最大长度":["9.20"],"默认为16":["9.20"],"types":["9.20"],"字符类型":["9.20"],"分别为数字":["9.20"],"小写字母":["9.20"],"大写字母":["9.20"],"特殊字符":["9.20"],"decode62":["9.25","9.28"],"或者将62进制的字符串转换为数字":["9.26"],"将62进制的字符串转换为数字":["9.28"],"输入参数为字符串":["9.28"],"输出参数为数字":["9.28"],"如果url不合法":["9.30"],"const":["9.32"],"name":["9.32"],"如果字符串不合法":["9.34","9.38"],"sitename":["9.40"],"网站名称":["9.40"],"separator":["9.40"],"分隔符":["9.40"],"默认为":["9.40"],"是一个用于处理":["10.2"],"参数的值":["10.5"],"如果参数不存在":["10.5","10.8"],"则返回":["10.5","10.7"],"的":["10.6"],"hash":["10.6","10.9"],"值":["10.6"],"如果路径不存在":["10.7","10.10"],"则添加参数":["10.8"],"操作成功返回":["10.8"],"的路径":["10.10"],"则添加路径":["10.10"],"url":["10.11"],"新增":["11.1","11.4"],"aftertime":["11.4"],"bash":["12.0"],"npm":["12.0","14.2","14.5"],"install":["12.0","14.5"],"g":["12.0"],"安装依赖":["12.0"],"本项目进入公测阶段":["13.0"],"是川菜中常用的调味品":["13.1"],"也可以用作腌制成为单独的菜品":["13.1"],"而这一辅料被人们俗称为姜":["13.1"],"山奈希望提供在业务中常用的一些函数":["13.2"],"ch":["13.3"],"ff":["13.3"],"sf":["13.3"],"size":["13.5"],"如果您也想对山奈做出贡献":["13.6"],"我们在各大平台都开设了有关山奈的交流群":["13.7"],"欢迎大家加入":["13.7"],"山奈的主版本是一个在标准w3c环境下运行的javascript库":["14.1"],"add":["14.2","14.5"],"galanga":["14.2","14.3","14.5"],"例如您将山奈的打包产物放在":["14.3"],"目录下":["14.3"],"uniapp":["14.4"],"uni":["14.5"],"helper":["14.5"],"是":["14.6"],"dist":["14.6"],"index":["14.6"],"这个文件":["14.6"],"然后引入至您的uni":["14.6"],"和已经完成的功能":["15.0"],"vitepress":["17.0"]},{"1":["11.22"],"2":["11.10"],"4":["11.8","11.16","11.18"],"5":["11.5","11.6","11.13"],"9":["11.3"],"19":["11.21"],"20":["11.20"],"21":["11.19"],"23":["11.17"],"25":["11.7","11.15"],"27":["11.5","11.6"],"2023":["11.2","11.3","11.8","11.9","11.10","11.11","11.13","11.14","11.15","11.16","11.17","11.18","11.19","11.20","11.21"],"length小的数组去掉":["0.2"],"filteruniquebyproperty":["0.3"],"string":["0.4","3.5"],"对象的属性":["0.4"],"code":["0.4","1.8","6.8","7.4","9.16","9.28","9.40","10.5"],"操作函数":["1.0"],"包含了一些常用的":["1.2"],"cookie":["1.2"],"localcookie":["1.3"],"不存在":["1.5","10.6","10.9"],"则返回":["1.5","9.2","9.6","9.10","9.18","9.22","9.30","9.34","9.38"],"名称":["1.6","1.7"],"svalue":["1.6"],"值":["1.6"],"spath":["1.6","1.7"],"路径":["1.7"],"group":["1.8","7.4","9.16","9.28","9.40"],"warning":["2.1","8.1","8.5","8.9"],"aftertime":["2.3"],"对象":["2.4"],"backtype":["2.4"],"返回格式":["2.4"],"可以是一个字符串":["2.4"],"或者进行一些操作":["3.0"],"设备类型":["3.2","3.4"],"checkdevicetype":["3.3","3.5"],"系统类型":["3.4"],"平台类型":["3.4"],"如果只想检查其中的某一个类型":["3.4"],"则可以传入一个字符串":["3.4"],"如":["3.4"],"如果想检查多个类型":["3.4"],"函数的参数不再包含":["3.5","3.10"],"return":["3.5"],"read":["3.7"],"clipboard":["3.8"],"是否只读取剪切板中的文本内容":["3.9"],"默认为":["3.9","9.20"],"true":["3.9","9.6","10.8","10.10"],"如果为":["3.9"],"false":["3.9","9.40","10.8"],"则会读取剪切板中的所有内容":["3.9"],"包括图片等":["3.9"],"write":["3.10"],"onlystring":["3.10"],"而是智能判断您传入的类型":["3.10"],"请注意的是":["4.0"],"formatnumber":["5.3"],"保留的小数位数":["5.4"],"默认为2":["5.4","9.20"],"updateobjectfromimport":["6.3"],"全局引入":["6.4"],"galanga":["6.4","14.6"],"其余属性删除":["6.6"],"shakeobject":["6.7"],"要保留的属性名组成的数组":["6.8"],"用于延迟执行":["7.2"],"sleep":["7.3"],"notificationpermission":["8.3"],"null":["8.4","8.8","8.12","10.5"],"表示用户还未做出选择":["8.4","8.8","8.12"],"async":["8.4"],"request":["8.4","8.8","8.12"],"用于请求通知权限":["8.4"],"clipboardpermission":["8.7"],"表示没有获取权限或浏览器不支持剪贴板权限":["8.8"],"用于请求剪贴板权限":["8.8"],"locationpermission":["8.11"],"表示没有获取权限或浏览器不支持地理位置权限":["8.12"],"用于请求地理位置权限":["8.12"],"checknull":["9.3"],"按需引入":["9.4","9.8","9.12","9.28","10.13"],"checknotnull":["9.7"],"strlength":["9.11"],"kb":["9.14"],"mb":["9.14"],"formatbytes":["9.15"],"默认为b":["9.16"],"to":["9.16"],"输出的字节单位":["9.16"],"checkpassword":["9.19"],"number":["9.20"],"lowercase":["9.20"],"uppercase":["9.20"],"special":["9.20"],"mintypes":["9.20"],"最少包含的字符类型":["9.20"],"maxtypes":["9.20"],"checkemail":["9.23","9.24"],"info":["9.24"],"encode62":["9.27","11.1"],"js":["9.28","10.13"],"getfilenamefromurl":["9.31","9.32"],"https":["9.32"],"www":["9.32"],"example":["9.32"],"getfileextfromstring":["9.35","9.36"],"const":["9.36"],"ext":["9.36"],"splicesitetitle":["9.39"],"reverse":["9.40"],"是否反转":["9.40"],"url":["10.3","11.4"],"如果":["10.6"],"可以传入以下参数":["10.7"],"isfullpath":["10.7"],"是否返回完整路径":["10.7"],"否则返回":["10.8","10.10"],"则添加":["10.9"],"操作成功返回":["10.9","10.10"],"getpreurl":["10.12"],"函数":["11.1","11.4"],"用于将数字转换为62进制的字符串":["11.1"],"用于获取当前时间之后的时间":["11.4"],"给":["11.4"],"拓展了":["11.7"],"项目推进至公测阶段":["11.12"],"欢迎大家使用并提出宝贵的意见":["11.12","13.0"],"不稳定的api会在文档内标注":["11.12"],"一键打包生成生产代码":["12.0"],"在web的世界里":["13.1"],"它是一个开源的实用的js函数库":["13.1"],"它的目标是提供一些常用的函数":["13.1"],"让你的代码更简洁更易读":["13.1"],"而山奈也是基于typescript开发的":["13.2"],"op":["13.3"],"ios":["13.3"],"android":["13.3"],"small":["13.5"],"请参考贡献指南":["13.6"],"qq":["13.7"],"您可以在任何支持javascript的环境中使用它":["14.1"],"install":["14.2"],"pnpm":["14.2","14.5"],"您可以通过以下方式引入山奈":["14.3"],"html":["14.3"],"当然":["14.3"],"山奈的uni":["14.4"],"modules文件夹中":["14.6"],"例如您将山奈的打包产物放在":["14.6"],"目录下":["14.6"],"x":["15.0"],"的文档站点":["17.0"]},{"0":["9.10"],"1":["9.16"],"3":["11.19","11.20","11.21"],"4":["11.15","11.17"],"5":["11.8","11.9","11.10","11.11","11.14"],"6":["11.2","11.3","13.3"],"7":["11.18"],"9":["11.13","11.14"],"16":["11.9"],"18":["11.16"],"29":["13.3"],"2023":["11.22"],"123456789":["9.28"],"346363551":["13.7"],"from":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","8.3","8.7","8.11","9.3","9.7","9.11","9.15","9.19","9.23","9.31","9.35","9.39","10.3","10.12"],"group":["0.4","1.5","5.4","6.8","9.20","10.5","10.8","10.10","14.6"],"js":["0.4","1.8","5.4","6.8","7.4","9.16","9.20","9.40","10.5","10.8"],"按需引入":["0.4","1.8","6.8","7.4","9.16","9.20","9.40","10.5","14.6"],"包括获取":["1.0"],"操作函数":["1.2"],"null":["1.5","9.30","9.34","9.38","10.6"],"code":["1.5","5.4","9.20","10.6","10.7","10.8","10.10","14.6"],"路径":["1.6"],"默认为":["1.6","1.7","10.7"],"sdomain":["1.6","1.7"],"域":["1.6","1.7"],"默认为当前域":["1.6"],"text":["2.1","8.1","8.5","8.9"],"也可以是一个函数":["2.4"],"如果是字符串":["2.4"],"则返回一个时间字符串":["2.4"],"如果是函数":["2.4"],"系统类型":["3.2"],"则可以传入一个数组":["3.4"],"默认情况下":["3.4"],"返回的是一个对象":["3.4"],"包含了浏览器类型":["3.4"],"而是直接传入一个字符串或者数组":["3.5"],"如果传入的是一个字符串":["3.5"],"则返回一个字符串":["3.5"],"如果传入的是一个数组":["3.5"],"和":["3.7"],"value":["3.9"],"设置剪切板的内容":["3.9"],"如果设置成功":["3.9"],"则返回":["3.9","10.6"],"例如":["3.10"],"string":["3.10"],"类型的参数会被判断为进行writetxt操作":["3.10"],"其他类型的参数会被判断为进行write操作":["3.10"],"请您检查您的业务中是否使用了":["3.10"],"在这里演示的所有api均以es6的语法为基础":["4.0"],"details":["6.4"],"注意":["6.4"],"如果原有的object是响应式的":["6.4"],"那么在将object作为参数传入函数后":["6.4"],"要么会污染原有的object":["6.4"],"也叫做摇树":["6.6"],"此函数为一个异步函数":["8.4","8.8","8.12"],"返回一个布尔值":["8.4","8.8","8.12"],"true":["9.2","9.18","9.22","10.9"],"checknull":["9.4"],"name":["9.4","9.8","9.12"],"否则返回":["9.6","10.9"],"checknotnull":["9.8"],"strlength":["9.12"],"gb":["9.14"],"const":["9.16","9.20","9.28","9.40"],"json":["9.16","9.20"],"最多包含的字符类型":["9.20"],"默认为4":["9.20"],"sancerain":["9.24"],"com":["9.24","9.32"],"decode62":["9.27","11.1"],"str":["9.28"],"index":["9.32","9.36"],"html":["9.32","9.36"],"splicesitetitle":["9.40"],"的函数":["10.2"],"false":["10.7","10.9","10.10"],"getpreurl":["10.13"],"用于将62进制的字符串转换为数字":["11.1"],"函数集合新增了":["11.4"],"sethash":["11.4"],"用于设置url的hash值":["11.4"],"修复了":["11.5","11.6"],"checkdevicetype":["11.5","11.6"],"formatnumber":["11.7"],"函数":["11.7"],"beta":["11.12"],"同时也感谢我的同事们生产环境出问题的风险使用了山奈":["11.12"],"用的很好":["11.12"],"新增了":["11.16"],"run":["12.0"],"build":["12.0"],"运行单元测试":["12.0"],"test":["12.0"],"不稳定的api会进行特殊标注":["13.0"],"我们希望利用姜来让您的代码更加美味":["13.1"],"让您更加专注于业务逻辑的实现":["13.1"],"使用es6":["13.1"],"因此在使用时":["13.2"],"node":["13.3"],"members":["13.5"],"以下是山奈的贡献者名单头像缩略图":["13.6"],"钉钉":["13.7"],"cnpm":["14.2","14.5"],"您也可以引入山奈的cdn链接":["14.3"],"引入完成后":["14.3"],"您可以在项目中使用全部功能":["14.3"],"app版本是一个在uni":["14.4"],"您可以通过以下方式引入山奈":["14.6"],"import":["14.6"],"已完成":["15.0"],"您也可以直接在这里浏览文档源文件":["17.0"]},{"2":["9.20","11.22"],"3":["11.3"],"5":["11.2"],"8":["9.20"],"9":["13.3"],"12":["11.10","11.11"],"15":["11.17"],"16":["9.20"],"18":["11.8"],"19":["11.20"],"22":["11.15","11.19"],"50":["13.3"],"55":["13.3"],"1000":["7.4"],"1024":["9.16"],"galanga":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","8.3","8.7","8.11","9.3","9.7","9.11","9.15","9.19","9.23","9.31","9.35","9.39","10.3","10.12"],"filteruniquebyproperty":["0.4","11.13"],"设置":["1.0","1.2"],"删除":["1.0"],"包括获取":["1.2"],"js":["1.5","1.7","3.4","3.9","8.4","8.8","8.12","10.6","10.7","10.9","10.10","14.2","14.5"],"按需引入":["1.5","3.9","5.4","8.4","8.8","8.12","10.6","10.7","10.8","10.9","10.10","14.2","14.5"],"localcookie":["1.5","1.8"],"vend":["1.6"],"有效期":["1.6"],"默认为当前会话结束":["1.6"],"bsecure":["1.6"],"是否只在":["1.6"],"https":["1.6"],"默认为当前域":["1.7"],"code":["1.7","2.4","3.9","8.4","8.8","8.12","10.9"],"group":["1.7","2.4","3.9","8.4","8.8","8.12","10.6","10.7","10.9"],"clear":["1.8"],"beta":["2.1","8.1","8.5","8.9"],"则返回一个":["2.4"],"如下":["3.4"],"chrome":["3.4"],"pc":["3.4"],"则返回一个对象":["3.5"],"请您检查您的业务中是否使用了":["3.5"],"参数":["3.5","3.10"],"write":["3.7"],"要设置的内容":["3.9"],"clipboard":["3.9","11.7"],"如果使用了":["3.10"],"请您修改为新的使用方式":["3.10"],"如果您使用的是其他类型的语法或者安装方法":["4.0"],"formatnumber":["5.4","11.9"],"要么会导致函数失去响应式":["6.4"],"具体情况取决于您的使用场景和框架":["6.4"],"如果在这种场景下":["6.4"],"您仍然想要使用这个函数":["6.4"],"并不希望污染原有的object":["6.4"],"那么您可以使用下面的方法":["6.4"],"shakeobject":["6.8"],"sleep":["7.4"],"表示用户已经拒绝了权限或浏览器不支持通知权限":["8.4"],"表示用户已经拒绝了权限或浏览器不支持剪贴板权限":["8.8"],"await":["8.8","8.12"],"表示用户已经拒绝了权限或浏览器不支持地理位置权限":["8.12"],"否则返回":["9.2","9.18","9.22"],"全局引入":["9.4","9.8","9.12","9.24","9.32","9.36"],"false":["9.6"],"此函数会反义":["9.6"],"tb":["9.14"],"pb":["9.14"],"b":["9.16"],"kb":["9.16"],"formatbytes":["9.16"],"from":["9.27","14.6"],"num":["9.28"],"var":["9.32"],"山奈":["9.40"],"它提供了一些方便的方法来处理":["10.2"],"getquery":["10.5"],"name":["10.5","10.8"],"setquery":["10.8"],"getfilenamefromurl":["11.1"],"用于从url中获取文件名":["11.1"],"新增":["11.3","11.8","11.9"],"setpath":["11.4"],"函数的bug":["11.5","11.6"],"现在可以正常使用了":["11.5","11.6"],"现在可以自定义保留小数位数了":["11.7"],"修复":["11.10","11.11"],"下次不准再用了":["11.12"],"jpg":["11.12"],"bushi":["11.12"],"新增了":["11.13","11.14","11.18","11.19","11.20"],"updateobjectfromimport":["11.14"],"checknull":["11.15"],"checknotnull":["11.16"],"函数":["11.16"],"对函数":["11.17"],"checkdevicetype":["11.18"],"注意":["12.0"],"浏览器环境需要手动测试":["12.0"],"位于":["12.0"],"browser":["12.0"],"修改":["12.0"],"和typescript编写源码":["13.1"],"编译生成生产代码":["13.1"],"多环境支持":["13.1"],"您可以获得更好的类型提示":["13.2"],"贡献者名单":["13.6"],"山奈galanga开源js函数库交流群":["13.7"],"telegram":["13.7"],"安装完成后":["14.2","14.5"],"您可以在项目中引入山奈并使用对应的功能":["14.2","14.5"],"目前暂不支持将部分函数单独引入至项目内":["14.3"],"console":["14.3"],"log":["14.3"],"app环境下运行的javascript库":["14.4"],"info":["14.6"],"未完成":["15.0"]},{"4":["9.20","13.3"],"12345678":["9.20"],"id":["0.4"],"全局引入":["0.4","1.8","5.4","6.8","7.4","9.16","9.20","9.28","9.40","10.5","10.8","10.13","14.6"],"删除":["1.2"],"getitem":["1.5"],"name":["1.5","1.7"],"连接中有效":["1.6"],"false":["1.6","9.2","9.18","9.22"],"code":["1.6"],"group":["1.6"],"js":["1.6","2.4","3.5","3.10"],"按需引入":["1.7","2.4"],"localcookie":["1.7"],"removeitem":["1.7"],"aftertime":["2.4"],"windows":["3.4"],"web":["3.4"],"如果只传入一个字符串":["3.4"],"那么返回的是一个字符串":["3.4"],"比如你只想检查浏览器类型":["3.4"],"如果使用了":["3.5"],"请您修改为新的使用方式":["3.5"],"例如":["3.5"],"两个函数":["3.7"],"hello":["3.9"],"world":["3.9"],"then":["3.9"],"text":["3.9"],"console":["3.9","14.2","14.5","14.6"],"log":["3.9","14.2","14.6"],"旧的使用方式":["3.10"],"您需要自行转换":["4.0"],"let":["6.4"],"newobject":["6.4"],"notificationpermission":["8.4","11.12"],"await":["8.4"],"clipboardpermission":["8.8"],"locationpermission":["8.12"],"galanga":["9.4","9.8","9.12","9.24","9.27","9.28","9.32","9.36","10.8","10.9","10.10","10.13"],"checknull":["9.6","11.10"],"函数":["9.6","11.9","11.12","11.13","11.14","11.18"],"eb":["9.14"],"var":["9.16","9.20","9.28","9.36","9.40"],"checkpassword":["9.20","11.20"],"gethash":["10.6"],"getpath":["10.7","11.2"],"sethash":["10.9"],"setpath":["10.10"],"getfileextfromstring":["11.1"],"用于从字符串中获取文件后缀名":["11.1"],"url":["11.2"],"getpreurl":["11.3"],"用于设置url的路径":["11.4"],"变更了":["11.5"],"clipboard":["11.5","11.8"],"新增了":["11.6"],"shakeobject":["11.6"],"现在可以读取和写入任意类型的数据了":["11.7"],"updateobjectfromimport":["11.11"],"新增":["11.12"],"用于根据数组中对象的某个属性去重":["11.13"],"和":["11.15"],"用于检查字符串是否不为空":["11.16"],"此函数会反义":["11.16"],"checkdevicetype":["11.17"],"用于检查设备类型":["11.18"],"checkemail":["11.19"],"修复了":["11.21"],"formatbytes":["11.21"],"package":["12.0"],"json":["12.0"],"中的版本号":["12.0"],"readme":["12.0"],"支持浏览器原生":["13.1"],"支持amd":["13.1"],"cmd":["13.1"],"支持webpack":["13.1"],"censujiang":["13.7"],"import":["14.2","14.5"],"info":["14.2","14.3","14.5"],"from":["14.2","14.5"],"我们更推荐使用npm项目的方式引入山奈":["14.3"],"您可以在uni":["14.4"]},{"galanga":["0.4","1.5","1.7","1.8","2.4","3.9","5.4","6.8","7.4","8.4","8.8","8.12","9.40","10.5","10.6","10.7"],"等":["1.0","1.2"],"全局引入":["1.5","1.6","1.7","2.4","3.9","8.4","8.8","8.12","10.6","10.7","10.9","10.10","14.2","14.5"],"按需引入":["1.6","3.4"],"localcookie":["1.6"],"setitem":["1.6"],"name":["1.6"],"value":["1.6"],"那么返回的就是浏览器类型":["3.4"],"code":["3.4"],"group":["3.4","13.7"],"旧的使用方式":["3.5"],"browser":["3.5"],"true":["3.5","3.10"],"hello":["3.10"],"world":["3.10"],"新的使用方式":["3.10"],"这也是为了业务逻辑的统一":["9.6"],"方便使用":["9.6"],"zb":["9.14"],"yb":["9.14"],"splicesitetitle":["11.1"],"用于拼接网站标题":["11.1"],"函数现在可以获取url的完整路径了":["11.2"],"函数":["11.3","11.6","11.8","11.19","11.20"],"用于获取上一页的url":["11.3"],"setquery":["11.4"],"用于设置url的参数":["11.4"],"修复":["11.4"],"write":["11.5"],"函数的参数":["11.5"],"输入一个数组和要摇树的对象":["11.6"],"新增了":["11.7"],"locationpermission":["11.7"],"用于读取和设置剪贴板":["11.8"],"用于格式化数字":["11.9"],"保留两位小数":["11.9"],"函数的bug":["11.10","11.11"],"现在匹配到false的情况会返回false了":["11.10"],"现在可以正常使用了":["11.11"],"用于处理浏览器通知权限":["11.12"],"clipboardpermission":["11.12"],"将length大的数组保留":["11.13"],"length小的数组去掉":["11.13"],"用于将新的object中的值动态更新到原有的object中":["11.14"],"并不影响原有object中的结构":["11.14"],"checknotnull":["11.15"],"函数现在可以检查数字类型的参数是否为nan了":["11.15"],"checknull":["11.16"],"进行了优化":["11.17"],"现在可以更好的检测设备类型":["11.17"],"此函数不稳定":["11.18"],"可能会在后续版本中修改":["11.18"],"用于检查邮箱格式":["11.19"],"用于检查密码强度":["11.20"],"函数的两个bug":["11.21"],"项目发布测试版本":["11.22"],"md":["12.0"],"changelog":["12.0"],"然后发布新版":["12.0"],"rollup":["13.1"],"fis等":["13.1"],"支持node":["13.1"],"注意":["13.3"],"编译代码依赖es5环境":["13.3"],"对于ie6":["13.3"],"微信":["13.7"],"因为这样不仅可以更好地管理依赖":["14.3"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["14.3"],"在查看后文的使用示例时":["14.3"],"请使用":["14.3"],"app项目中使用它":["14.4"],"log":["14.5"]},{"galanga":["1.6","3.4","9.16","9.20"],"checkdevicetype":["3.4"],"全局引入":["3.4"],"details":["3.4","3.9"],"迁移指南":["3.4","3.9"],"新的使用方式":["3.5"],"sleep":["11.1"],"用于延迟执行":["11.1"],"localcookie":["11.4"],"函数的bug":["11.4"],"现在可以正常使用了":["11.4"],"现在可以写入任意类型的数据了":["11.5"],"返回的是这个数组中出现的元素组成的对象":["11.6"],"用于处理浏览器定位权限":["11.7"],"用于处理浏览器剪贴板权限":["11.12"],"方便使用":["11.16"],"release":["12.0"],"无依赖":["13.1"],"体积小巧":["13.1"],"8需要引入es5":["13.3"],"shim才可以兼容":["13.3"],"微信群":["13.7"],"作为全局变量后再加具体的功能函数名":["14.3"]}]'},t={"0.0":{t:"array",p:`山奈提供了一些数组的操作方法，可以帮助您更好的操作数组。
`,l:"api/array.html",a:"array"},"0.1":{t:"filteruniquebyproperty",p:"\r",l:"api/array.html#filteruniquebyproperty",a:"filteruniquebyproperty"},"0.2":{t:"介绍",p:`根据数组中对象的某个属性去重，将length大的数组保留，length小的数组去掉。
`,l:"api/array.html#介绍",a:"介绍"},"0.3":{t:"导入",p:`import { filterUniqueByProperty } from 'galanga'

`,l:"api/array.html#导入",a:"导入"},"0.4":{t:"使用",p:`输入的参数如下：

array[array]: 数组
property[string]: 对象的属性

::: code-g ...`,l:"api/array.html#使用",a:"使用"},"1.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"1.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"1.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"1.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"1.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"1.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"1.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
输入参数如下：

(必填)sKey：Cooki ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"1.7":{t:"删除-cookie",p:`删除 Cookie。
输入参数如下：

(必填)sKey：Cookie 名称
sPath：Cookie 路径，默认为 /
s ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"1.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"2.0":{t:"date",p:`山奈提供了一些时间处理的工具函数
`,l:"api/date.html",a:"date"},"2.1":{t:"aftertime-badge-type-warning-text-beta",p:"\r",l:"api/date.html#aftertime-badge-type-warning-text-beta",a:"aftertime-badge-type-warning-text-beta"},"2.2":{t:"介绍",p:`输出当前时间之后的时间
`,l:"api/date.html#介绍",a:"介绍"},"2.3":{t:"导入",p:`import { afterTime } from 'galanga'

`,l:"api/date.html#导入",a:"导入"},"2.4":{t:"使用",p:`输入参数如下：

(必填)time：时间，可以是一个时间戳，也可以是一个时间字符串，也可以是一个 Date 对象
backT ...`,l:"api/date.html#使用",a:"使用"},"3.0":{t:"device",p:`山奈提供了一些有关设备操作的API，可用来获取设备的信息，或者进行一些操作。
`,l:"api/device.html",a:"device"},"3.1":{t:"checkdevicetype",p:"\r",l:"api/device.html#checkdevicetype",a:"checkdevicetype"},"3.2":{t:"介绍",p:`检查当前设备的各种类型，包括浏览器类型、设备类型、系统类型
`,l:"api/device.html#介绍",a:"介绍"},"3.3":{t:"导入",p:`import { checkDeviceType } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"3.4":{t:"使用",p:`输入的参数如下：

type：要检查的类型，此参数为一个数组，默认为['browser', 'device', 'os',  ...`,l:"api/device.html#使用",a:"使用"},"3.5":{t:"v0-1-6-之前",p:"从v0.1.6开始，checkDeviceType函数的参数不再包含return_string，而是直接传入一个字符串或者数 ...",l:"api/device.html#v0-1-6-之前",a:"v0-1-6-之前"},"3.6":{t:"clipboard",p:"\r",l:"api/device.html#clipboard",a:"clipboard"},"3.7":{t:"介绍",p:`一个用于读取和设置剪切板的函数组合，包含了read和write两个函数
`,l:"api/device.html#介绍",a:"介绍"},"3.8":{t:"导入",p:`import { clipboard } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"3.9":{t:"使用",p:`一共有两个函数，分别是read和write，分别用于读取和设置剪切板


[async]read(onlyString)：读 ...`,l:"api/device.html#使用",a:"使用"},"3.10":{t:"v0-1-7-之前",p:"从v0.1.7开始，clipboard.write()函数的参数不再包含onlyString，而是智能判断您传入的类型，例如 ...",l:"api/device.html#v0-1-7-之前",a:"v0-1-7-之前"},"4.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"5.0":{t:"number",p:`山奈提供了一些数学函数，这些函数可以用于数值计算。
`,l:"api/number.html",a:"number"},"5.1":{t:"formatnumber",p:"\r",l:"api/number.html#formatnumber",a:"formatnumber"},"5.2":{t:"介绍",p:`格式化数字，保留两位小数。
`,l:"api/number.html#介绍",a:"介绍"},"5.3":{t:"导入",p:`import { formatNumber } from 'galanga'

`,l:"api/number.html#导入",a:"导入"},"5.4":{t:"使用",p:`输入的参数如下：

number[number]: 数字
decimal[number]: 保留的小数位数，默认为2

:: ...`,l:"api/number.html#使用",a:"使用"},"6.0":{t:"object",p:`山奈提供了一些有关对象的方法，这些方法可以帮助您更好地使用对象。
`,l:"api/object.html",a:"object"},"6.1":{t:"updateobjectfromimport",p:"\r",l:"api/object.html#updateobjectfromimport",a:"updateobjectfromimport"},"6.2":{t:"介绍",p:`将新的object中的值动态更新到原有的object中，并不影响原有object中的结构。
`,l:"api/object.html#介绍",a:"介绍"},"6.3":{t:"导入",p:`import { updateObjectFromImport } from 'galanga'

`,l:"api/object.html#导入",a:"导入"},"6.4":{t:"使用",p:`输入的参数如下：

importObject[object]: 新的object，用于更新原有的object
object[ ...`,l:"api/object.html#使用",a:"使用"},"6.5":{t:"shakeobject",p:"\r",l:"api/object.html#shakeobject",a:"shakeobject"},"6.6":{t:"介绍",p:`通过一个数组，将对象中的某些属性保留，其余属性删除。（也叫做摇树）
`,l:"api/object.html#介绍",a:"介绍"},"6.7":{t:"导入",p:`import { shakeObject } from 'galanga'

`,l:"api/object.html#导入",a:"导入"},"6.8":{t:"使用",p:`输入的参数如下：


object[object]: 要摇树的对象


array[array]: 要保留的属性名组成的数组 ...`,l:"api/object.html#使用",a:"使用"},"7.0":{t:"other",p:`一些杂项或者小小的语法糖
`,l:"api/other.html",a:"other"},"7.1":{t:"sleep",p:"\r",l:"api/other.html#sleep",a:"sleep"},"7.2":{t:"介绍",p:`sleep函数，用于延迟执行。
`,l:"api/other.html#介绍",a:"介绍"},"7.3":{t:"导入",p:`import { sleep } from 'galanga'

`,l:"api/other.html#导入",a:"导入"},"7.4":{t:"使用",p:`传入一个数字，单位为毫秒，延迟执行。
::: code-group
sleep(1000)

galanga.sleep(1 ...`,l:"api/other.html#使用",a:"使用"},"8.0":{t:"permission",p:`山奈提供了一些API用于您去获取或判断是否获取了一些浏览器权限。
`,l:"api/permission.html",a:"permission"},"8.1":{t:"notificationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#notificationpermission-badge-type-warning-text-beta",a:"notificationpermission-badge-type-warning-text-beta"},"8.2":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的通知权限。
`,l:"api/permission.html#介绍",a:"介绍"},"8.3":{t:"导入",p:`import { notificationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"8.4":{t:"使用",p:`此集合有两个子函数，分别如下：


check(): 用于判断是否获取了通知权限，返回一个布尔值或Null，true表示获取 ...`,l:"api/permission.html#使用",a:"使用"},"8.5":{t:"clipboardpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#clipboardpermission-badge-type-warning-text-beta",a:"clipboardpermission-badge-type-warning-text-beta"},"8.6":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的剪贴板权限。
`,l:"api/permission.html#介绍",a:"介绍"},"8.7":{t:"导入",p:`import { clipboardPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"8.8":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了剪贴板权限，此函数是一个异步函数，返回 ...`,l:"api/permission.html#使用",a:"使用"},"8.9":{t:"locationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#locationpermission-badge-type-warning-text-beta",a:"locationpermission-badge-type-warning-text-beta"},"8.10":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的地理位置权限。
`,l:"api/permission.html#介绍",a:"介绍"},"8.11":{t:"导入",p:`import { locationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"8.12":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了地理位置权限，此函数是一个异步函数，返 ...`,l:"api/permission.html#使用",a:"使用"},"9.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"9.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"9.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"9.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"9.5":{t:"checknotnull",p:"\r",l:"api/string.html#checknotnull",a:"checknotnull"},"9.6":{t:"介绍",p:"判断字符串是否不为空（非空），如果字符串不为空，则返回 true，否则返回 false。此函数会反义 checkNull 函 ...",l:"api/string.html#介绍",a:"介绍"},"9.7":{t:"导入",p:`import { checkNotNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.8":{t:"使用",p:`::: code-group
checkNotNull(name)

galanga.checkNotNull(name)
 ...`,l:"api/string.html#使用",a:"使用"},"9.9":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"9.10":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"9.11":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.12":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"9.13":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"9.14":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"9.15":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.16":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"9.17":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"9.18":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"9.19":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.20":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"9.21":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"9.22":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"9.23":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.24":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"9.25":{t:"encode62-和-decode62",p:"\r",l:"api/string.html#encode62-和-decode62",a:"encode62-和-decode62"},"9.26":{t:"介绍",p:`将数字转换为62进制的字符串，或者将62进制的字符串转换为数字。
`,l:"api/string.html#介绍",a:"介绍"},"9.27":{t:"导入",p:`import { encode62, decode62 } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.28":{t:"使用",p:`
encode62：将数字转换为62进制的字符串，输入参数为数字，输出参数为字符串。
decode62：将62进制的字符串转 ...`,l:"api/string.html#使用",a:"使用"},"9.29":{t:"getfilenamefromurl",p:"\r",l:"api/string.html#getfilenamefromurl",a:"getfilenamefromurl"},"9.30":{t:"介绍",p:`从URL中获取文件名，如果URL不合法，则返回 null。
`,l:"api/string.html#介绍",a:"介绍"},"9.31":{t:"导入",p:`import { getFileNameFromURL } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.32":{t:"使用",p:`::: code-group
const name = getFileNameFromURL('https://www.ex ...`,l:"api/string.html#使用",a:"使用"},"9.33":{t:"getfileextfromstring",p:"\r",l:"api/string.html#getfileextfromstring",a:"getfileextfromstring"},"9.34":{t:"介绍",p:`从字符串中获取文件后缀名，如果字符串不合法，则返回 null。
`,l:"api/string.html#介绍",a:"介绍"},"9.35":{t:"导入",p:`import { getFileExtFromString } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.36":{t:"使用",p:`::: code-group
const ext = getFileExtFromString('index.html')
 ...`,l:"api/string.html#使用",a:"使用"},"9.37":{t:"splicesitetitle",p:"\r",l:"api/string.html#splicesitetitle",a:"splicesitetitle"},"9.38":{t:"介绍",p:`截取网站标题的函数，如果字符串不合法，则返回 null。
`,l:"api/string.html#介绍",a:"介绍"},"9.39":{t:"导入",p:`import { spliceSiteTitle } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"9.40":{t:"使用",p:`将会传入一个Json对象，有以下内容，不传入则使用默认值：

title：页面标题
siteName：网站名称
separa ...`,l:"api/string.html#使用",a:"使用"},"10.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"10.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"10.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"10.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"10.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"10.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"10.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"10.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
可以传入以下参数

isFullPath 是否返回完整路径，默认为 ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"10.8":{t:"设置url的参数",p:`设置 URL 的参数，如果参数不存在，则添加参数。操作成功返回 true，否则返回 false。
::: code-grou ...`,l:"api/url.html#设置url的参数",a:"设置url的参数"},"10.9":{t:"设置url的hash",p:`设置 URL 的 hash，如果 hash 不存在，则添加 hash。操作成功返回 true，否则返回 false。
::: ...`,l:"api/url.html#设置url的hash",a:"设置url的hash"},"10.10":{t:"设置url的路径",p:`设置 URL 的路径，如果路径不存在，则添加路径。操作成功返回 true，否则返回 false。
::: code-grou ...`,l:"api/url.html#设置url的路径",a:"设置url的路径"},"10.11":{t:"getpreurl",p:`获取上一个 URL。
`,l:"api/url.html#getpreurl",a:"getpreurl"},"10.12":{t:"导入",p:`import { getPreURL } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"10.13":{t:"使用",p:`::: code-group
getPreURL()

galanga.getPreURL()

:::
`,l:"api/url.html#使用",a:"使用"},"11.0":{t:"更新日志",p:"\r",l:"guide/changelog.html",a:"更新日志"},"11.1":{t:"_0-2-1-2023-7-13",p:`
新增encode62函数，用于将数字转换为62进制的字符串。
新增decode62函数，用于将62进制的字符串转换为数字。 ...`,l:"guide/changelog.html#_0-2-1-2023-7-13",a:"_0-2-1-2023-7-13"},"11.2":{t:"_0-2-0-2023-6-5",p:`
url.getPath函数现在可以获取URL的完整路径了。

`,l:"guide/changelog.html#_0-2-0-2023-6-5",a:"_0-2-0-2023-6-5"},"11.3":{t:"_0-1-9-2023-6-3",p:`
新增getPreURL函数，用于获取上一页的URL。

`,l:"guide/changelog.html#_0-1-9-2023-6-3",a:"_0-1-9-2023-6-3"},"11.4":{t:"_0-1-8-2023-6-1",p:`
新增afterTime函数，用于获取当前时间之后的时间。
给url函数集合新增了setHash函数，用于设置URL的has ...`,l:"guide/changelog.html#_0-1-8-2023-6-1",a:"_0-1-8-2023-6-1"},"11.5":{t:"_0-1-7-2023-5-27",p:`
修复了checkDeviceType函数的bug，现在可以正常使用了。
变更了clipboard.write()函数的参数 ...`,l:"guide/changelog.html#_0-1-7-2023-5-27",a:"_0-1-7-2023-5-27"},"11.6":{t:"_0-1-6-2023-5-27",p:`
修复了checkDeviceType函数的bug，现在可以正常使用了。
新增了shakeObject函数，输入一个数组和要 ...`,l:"guide/changelog.html#_0-1-6-2023-5-27",a:"_0-1-6-2023-5-27"},"11.7":{t:"_0-1-5-2023-5-25",p:`
拓展了formatNumber函数，现在可以自定义保留小数位数了。
拓展了clipboard函数，现在可以读取和写入任意类 ...`,l:"guide/changelog.html#_0-1-5-2023-5-25",a:"_0-1-5-2023-5-25"},"11.8":{t:"_0-1-4-2023-5-18",p:`
新增clipboard函数，用于读取和设置剪贴板。

`,l:"guide/changelog.html#_0-1-4-2023-5-18",a:"_0-1-4-2023-5-18"},"11.9":{t:"_0-1-3-2023-5-16",p:`
新增formatNumber函数，用于格式化数字，保留两位小数。

`,l:"guide/changelog.html#_0-1-3-2023-5-16",a:"_0-1-3-2023-5-16"},"11.10":{t:"_0-1-2-2023-5-12",p:`
修复checkNull函数的bug，现在匹配到false的情况会返回false了。

`,l:"guide/changelog.html#_0-1-2-2023-5-12",a:"_0-1-2-2023-5-12"},"11.11":{t:"_0-1-1-2023-5-12",p:`
修复updateObjectFromImport函数的bug，现在可以正常使用了。

`,l:"guide/changelog.html#_0-1-1-2023-5-12",a:"_0-1-1-2023-5-12"},"11.12":{t:"_0-1-0-2023-5-11",p:`

项目推进至公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会在文档内标注beta，同时也感谢我的同事们生产环境出问 ...`,l:"guide/changelog.html#_0-1-0-2023-5-11",a:"_0-1-0-2023-5-11"},"11.13":{t:"_0-0-27-2023-5-9",p:`
新增了filterUniqueByProperty函数，用于根据数组中对象的某个属性去重，将length大的数组保留，le ...`,l:"guide/changelog.html#_0-0-27-2023-5-9",a:"_0-0-27-2023-5-9"},"11.14":{t:"_0-0-26-2023-5-9",p:`
新增了updateObjectFromImport函数，用于将新的object中的值动态更新到原有的object中，并不影 ...`,l:"guide/changelog.html#_0-0-26-2023-5-9",a:"_0-0-26-2023-5-9"},"11.15":{t:"_0-0-25-2023-4-22",p:`
checkNull和checkNotNull函数现在可以检查数字类型的参数是否为NaN了。

`,l:"guide/changelog.html#_0-0-25-2023-4-22",a:"_0-0-25-2023-4-22"},"11.16":{t:"_0-0-24-2023-4-18",p:`
新增了 checkNotNull 函数，用于检查字符串是否不为空，此函数会反义 checkNull 函数，方便使用。

`,l:"guide/changelog.html#_0-0-24-2023-4-18",a:"_0-0-24-2023-4-18"},"11.17":{t:"_0-0-23-2023-4-15",p:`
对函数checkDeviceType进行了优化，现在可以更好的检测设备类型

`,l:"guide/changelog.html#_0-0-23-2023-4-15",a:"_0-0-23-2023-4-15"},"11.18":{t:"_0-0-22-2023-4-7",p:`
新增了 checkDeviceType 函数，用于检查设备类型，此函数不稳定，可能会在后续版本中修改

`,l:"guide/changelog.html#_0-0-22-2023-4-7",a:"_0-0-22-2023-4-7"},"11.19":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"11.20":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"11.21":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"11.22":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"12.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"13.0":{t:"入门",p:`::: tip
本项目进入公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会进行特殊标注。
:::
`,l:"guide/index.html",a:"入门"},"13.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"13.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"13.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"13.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"13.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"13.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"13.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"14.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"14.1":{t:"主版本-main",p:`山奈的主版本是一个在标准W3C环境下运行的JavaScript库，您可以在任何支持JavaScript的环境中使用它。
`,l:"guide/install.html#主版本-main",a:"主版本-main"},"14.2":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"14.3":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"14.4":{t:"uni-app版本-uniapp",p:`山奈的UNi-APP版本是一个在UNI-APP环境下运行的JavaScript库，您可以在UNI-APP项目中使用它。
`,l:"guide/install.html#uni-app版本-uniapp",a:"uni-app版本-uniapp"},"14.5":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add @uni-helper/gal ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"14.6":{t:"在-uni-modules-下使用",p:"在uni_modules下，您可以在官方仓库内下载山奈的打包产物（是 dist/index.js这个文件），然后引入至您的u ...",l:"guide/install.html#在-uni-modules-下使用",a:"在-uni-modules-下使用"},"15.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"17.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},a={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},l={INDEX_DATA:e,PREVIEW_LOOKUP:t,Options:a};export{l as default};
