const e={map:'[{"array":["0.0"],"filteruniquebyproperty":["0.1"],"介绍":["0.2","2.2","2.6","4.2","5.2","6.2","6.6","6.10","7.2","7.6","7.10","7.14","7.18","7.22","8.2"],"导入":["0.3","1.3","2.3","2.7","4.3","5.3","6.3","6.7","6.11","7.3","7.7","7.11","7.15","7.19","7.23","8.3"],"使用":["0.4","1.4","2.4","2.8","4.4","5.4","6.4","6.8","6.12","7.4","7.8","7.12","7.16","7.20","7.24","8.4"],"cookie":["1.0"],"localcookie":["1.1"],"简介":["1.2"],"获取":["1.5"],"设置":["1.6"],"删除":["1.7"],"清空":["1.8"],"device":["2.0"],"checkdevicetype":["2.1"],"clipboard":["2.5"],"前言":["3.0"],"number":["4.0"],"formatnumber":["4.1"],"object":["5.0"],"updateobjectfromimport":["5.1"],"权限permission":["6.0"],"notificationpermission":["6.1"],"clipboardpermission":["6.5"],"locationpermission":["6.9"],"string":["7.0"],"checknull":["7.1"],"checknotnull":["7.5"],"strlength":["7.9"],"formatbytes":["7.13"],"checkpassword":["7.17"],"checkemail":["7.21"],"url":["8.0","8.1"],"获取url的参数":["8.5"],"获取url的hash":["8.6"],"获取url的路径":["8.7"],"更新日志":["9.0"],"贡献指南":["10.0"],"入门":["11.0"],"项目简介":["11.1"],"使用理由":["11.2"],"兼容性":["11.3"],"开发人员":["11.4"],"负责人":["11.5"],"贡献者":["11.6"],"入群交流":["11.7"],"安装":["12.0"],"在npm项目下使用":["12.1"],"全部引入":["12.2"],"按需引入":["12.3"],"在html单页面下使用":["12.4"],"项目计划":["13.0"],"提示":["15.0"]},{"0":["9.1","9.2","9.3","9.4","9.5","9.6","9.7","9.8","9.9","9.10","9.11","9.12","9.13","9.14","9.15","9.16"],"1":["9.1","9.6"],"山奈提供了一些数组的操作方法":["0.0"],"根据数组中对象的某个属性去重":["0.2"],"js":["0.3","1.3","2.3","2.7","4.3","5.3","6.3","6.7","6.11","7.3","7.7","7.11","7.15","7.19","7.23","8.3","12.2","12.3"],"输入的参数如下":["0.4","2.4","4.4","5.4"],"array":["0.4"],"山奈提供了一些常用的":["1.0"],"localcookie":["1.2"],"cookie":["1.5","1.6","1.7","1.8"],"山奈提供了一些有关设备操作的api":["2.0"],"检查当前设备的各种类型":["2.2"],"type":["2.4"],"要检查的类型":["2.4"],"此参数为一个数组":["2.4"],"默认为":["2.4"],"browser":["2.4"],"一个用于读取和设置剪切板的函数组合":["2.6"],"一共有两个函数":["2.8"],"分别是":["2.8"],"read":["2.8"],"和":["2.8"],"write":["2.8"],"分别用于读取和设置剪切板":["2.8"],"async":["2.8","6.8","6.12"],"onlystring":["2.8"],"读取剪切板的内容":["2.8"],"在本站的api信息栏目中":["3.0"],"山奈提供了一些数学函数":["4.0"],"格式化数字":["4.2"],"number":["4.4"],"山奈提供了一些有关对象的方法":["5.0"],"将新的object中的值动态更新到原有的object中":["5.2"],"importobject":["5.4"],"object":["5.4"],"新的object":["5.4"],"用于更新原有的object":["5.4"],"山奈提供了一些api用于您去获取或判断是否获取了一些浏览器权限":["6.0"],"badge":["6.1","6.5","6.9"],"这是一个函数集合":["6.2","6.6","6.10"],"此集合有两个子函数":["6.4","6.8","6.12"],"分别如下":["6.4","6.8","6.12"],"check":["6.4","6.8","6.12"],"用于判断是否获取了通知权限":["6.4"],"用于判断是否获取了剪贴板权限":["6.8"],"用于判断是否获取了地理位置权限":["6.12"],"山奈提供了一些字符串处理的函数":["7.0"],"判断字符串是否为空":["7.2"],"code":["7.4","7.8","7.12","7.24","12.1"],"判断字符串是否不为空":["7.6"],"获取字符串的长度":["7.10"],"将字节格式化为":["7.14"],"输入参数":["7.16","7.20"],"bytes":["7.16"],"字节数":["7.16"],"一个json对象":["7.16","7.20"],"可选":["7.16","7.20"],"检查密码强度的函数":["7.18"],"password":["7.20"],"密码":["7.20"],"有以下内容":["7.20"],"minlength":["7.20"],"密码最小长度":["7.20"],"默认为8":["7.20"],"检查邮箱格式的函数":["7.22"],"group":["7.24"],"山奈提供了一些方便的方法来处理":["8.0"],"url":["8.2","8.5","8.6","8.7"],"获取":["8.5","8.6","8.7"],"我们使用":["10.0"],"yarn":["10.0"],"作为包管理工具":["10.0"],"请先安装":["10.0"],"tip":["11.0"],"山奈":["11.1"],"galanga":["11.1"],"以下简称山奈":["11.1"],"相比其他的函数库":["11.2"],"单元测试保证支持如下环境":["11.3"],"ie":["11.3"],"vpteammembers":["11.5"],"请在github上或者gitee上查看贡献者名单":["11.6"],"为了方便各位开发者的交流":["11.7"],"在npm项目下":["12.1"],"您可以通过以下命令安装山奈":["12.1"],"在html单页面下":["12.4"],"您可以在官方仓库内下载山奈的打包产物":["12.4"],"然后引入至您的html文件中":["12.4"],"这里列出会在未来添加的新功能":["13.0"],"这是一个基于":["15.0"]},{"1":["9.2","9.3","9.4","9.5"],"3":["9.3"],"5":["9.1","9.6"],"11":["9.6"],"22":["9.12"],"24":["9.10"],"26":["9.8"],"27":["9.7"],"2023":["9.1","9.6"],"可以帮助您更好的操作数组":["0.0"],"将length大的数组保留":["0.2"],"import":["0.3","1.3","2.3","2.7","4.3","5.3","6.3","6.7","6.11","7.3","7.7","7.11","7.15","7.19","7.23","8.3","12.2","12.3"],"数组":["0.4"],"property":["0.4"],"是一个对象":["1.2"],"的值":["1.5","1.6"],"如果":["1.5","1.6"],"code":["1.7","5.4"],"清空所有":["1.8"],"可用来获取设备的信息":["2.0"],"包括浏览器类型":["2.2"],"device":["2.4"],"os":["2.4"],"platform":["2.4"],"可选值为":["2.4"],"包含了":["2.6"],"返回一个":["2.8"],"promise":["2.8"],"如果读取成功":["2.8"],"则返回剪切板的内容":["2.8"],"否则返回":["2.8"],"null":["2.8"],"这个函数的参数如下":["2.8"],"是否只读取剪切板中的文本内容":["2.8"],"默认为":["2.8"],"您可以查看您所需要的api的详细信息":["3.0"],"这些函数可以用于数值计算":["4.0"],"保留两位小数":["4.2"],"数字":["4.4"],"decimal":["4.4"],"这些方法可以帮助您更好地使用对象":["5.0"],"并不影响原有object中的结构":["5.2"],"原有的object":["5.4"],"group":["5.4","7.4","7.8","7.12","12.1"],"js":["5.4","7.4","7.8","7.12","7.24","12.4"],"按需引入":["5.4","7.24"],"updateobjectfromimport":["5.4"],"type":["6.1","6.5","6.9"],"用于获取或判断是否获取了浏览器的通知权限":["6.2"],"返回一个布尔值或null":["6.4","6.8","6.12"],"true":["6.4","6.8","6.12"],"表示获取了权限":["6.4","6.8","6.12"],"false":["6.4","6.8","6.12"],"表示没有获取权限或浏览器不支持通知权限":["6.4"],"用于获取或判断是否获取了浏览器的剪贴板权限":["6.6"],"此函数是一个异步函数":["6.8","6.12"],"用于获取或判断是否获取了浏览器的地理位置权限":["6.10"],"用于处理字符串":["7.0"],"如果字符串为空":["7.2","7.10"],"非空":["7.6"],"如果字符串不为空":["7.6"],"b":["7.14"],"有以下内容":["7.16"],"decimals":["7.16"],"保留的小数位数":["7.16"],"默认为1":["7.16"],"from":["7.16"],"输入的字节单位":["7.16"],"如果符合要求":["7.18","7.22"],"maxlength":["7.20"],"密码最大长度":["7.20"],"默认为16":["7.20"],"types":["7.20"],"字符类型":["7.20"],"分别为数字":["7.20"],"小写字母":["7.20"],"大写字母":["7.20"],"特殊字符":["7.20"],"是一个用于处理":["8.2"],"参数的值":["8.5"],"如果参数不存在":["8.5"],"则返回":["8.5"],"的":["8.6"],"hash":["8.6"],"值":["8.6"],"的路径":["8.7"],"如果路径不存在":["8.7"],"bash":["10.0","12.1"],"npm":["10.0"],"install":["10.0"],"g":["10.0"],"安装依赖":["10.0"],"本项目进入公测阶段":["11.0"],"是川菜中常用的调味品":["11.1"],"也可以用作腌制成为单独的菜品":["11.1"],"而这一辅料被人们俗称为姜":["11.1"],"山奈希望提供在业务中常用的一些函数":["11.2"],"ch":["11.3"],"ff":["11.3"],"sf":["11.3"],"size":["11.5"],"如果您也想对山奈做出贡献":["11.6"],"我们在各大平台都开设了有关山奈的交流群":["11.7"],"欢迎大家加入":["11.7"],"yarn":["12.1"],"例如您将山奈的打包产物放在":["12.4"],"galanga":["12.4"],"目录下":["12.4"],"和已经完成的功能":["13.0"],"vitepress":["15.0"]},{"1":["9.16"],"2":["9.4"],"4":["9.2","9.10","9.12"],"5":["9.7"],"19":["9.15"],"20":["9.14"],"21":["9.13"],"23":["9.11"],"25":["9.1","9.9"],"2023":["9.2","9.3","9.4","9.5","9.7","9.8","9.9","9.10","9.11","9.12","9.13","9.14","9.15"],"length小的数组去掉":["0.2"],"filteruniquebyproperty":["0.3"],"string":["0.4","2.4"],"对象的属性":["0.4"],"code":["0.4","1.8","7.16","8.5","8.7"],"操作函数":["1.0"],"包含了一些常用的":["1.2"],"cookie":["1.2"],"localcookie":["1.3"],"不存在":["1.5","1.6","8.6"],"则返回":["1.5","7.2","7.6","7.10","7.18","7.22","8.7"],"则创建":["1.6"],"group":["1.7","1.8","7.16"],"js":["1.7"],"或者进行一些操作":["2.0"],"设备类型":["2.2","2.4"],"checkdevicetype":["2.3"],"分别表示浏览器类型":["2.4"],"系统类型":["2.4"],"平台类型":["2.4"],"return":["2.4"],"read":["2.6"],"clipboard":["2.7"],"true":["2.8","7.6"],"如果为":["2.8"],"false":["2.8"],"则会读取剪切板中的所有内容":["2.8"],"包括图片等":["2.8"],"text":["2.8"],"设置剪切板的内容":["2.8"],"请注意的是":["3.0"],"formatnumber":["4.3"],"保留的小数位数":["4.4"],"默认为2":["4.4","7.20"],"updateobjectfromimport":["5.3"],"全局引入":["5.4"],"galanga":["5.4","12.1","12.2"],"warning":["6.1","6.5","6.9"],"notificationpermission":["6.3"],"null":["6.4","6.8","6.12","8.5","8.7"],"表示用户还未做出选择":["6.4","6.8","6.12"],"async":["6.4"],"request":["6.4","6.8","6.12"],"用于请求通知权限":["6.4"],"clipboardpermission":["6.7"],"表示没有获取权限或浏览器不支持剪贴板权限":["6.8"],"用于请求剪贴板权限":["6.8"],"locationpermission":["6.11"],"表示没有获取权限或浏览器不支持地理位置权限":["6.12"],"用于请求地理位置权限":["6.12"],"checknull":["7.3"],"按需引入":["7.4","7.8","7.12"],"checknotnull":["7.7"],"strlength":["7.11"],"kb":["7.14"],"mb":["7.14"],"formatbytes":["7.15"],"默认为b":["7.16"],"to":["7.16"],"输出的字节单位":["7.16"],"checkpassword":["7.19"],"默认为":["7.20"],"number":["7.20"],"lowercase":["7.20"],"uppercase":["7.20"],"special":["7.20"],"mintypes":["7.20"],"最少包含的字符类型":["7.20"],"maxtypes":["7.20"],"checkemail":["7.23","7.24"],"info":["7.24","12.3"],"url":["8.3"],"如果":["8.6"],"拓展了":["9.1"],"项目推进至公测阶段":["9.6"],"欢迎大家使用并提出宝贵的意见":["9.6","11.0"],"不稳定的api会在文档内标注":["9.6"],"一键打包生成生产代码":["10.0"],"在web的世界里":["11.1"],"它是一个开源的实用的js函数库":["11.1"],"它的目标是提供一些常用的函数":["11.1"],"让你的代码更简洁更易读":["11.1"],"而山奈也是基于typescript开发的":["11.2"],"op":["11.3"],"ios":["11.3"],"android":["11.3"],"small":["11.5"],"请参考贡献指南":["11.6"],"qq":["11.7"],"add":["12.1"],"from":["12.2","12.3"],"您可以通过以下方式引入山奈":["12.4"],"html":["12.4"],"当然":["12.4"],"x":["13.0"],"的文档站点":["15.0"]},{"0":["7.10"],"1":["7.16"],"3":["9.13","9.14","9.15"],"4":["9.9","9.11"],"5":["9.2","9.3","9.4","9.5","9.8"],"6":["11.3"],"7":["9.12"],"9":["9.7","9.8"],"16":["9.3"],"18":["9.10"],"29":["11.3"],"2023":["9.16"],"346363551":["11.7"],"from":["0.3","1.3","2.3","2.7","4.3","5.3","6.3","6.7","6.11","7.3","7.7","7.11","7.15","7.19","7.23","8.3"],"group":["0.4","1.5","1.6","4.4","7.20","8.5","8.7"],"js":["0.4","1.6","1.8","4.4","7.16","7.20","8.5","8.7"],"按需引入":["0.4","1.7","1.8","7.16","7.20","8.5"],"包括获取":["1.0"],"操作函数":["1.2"],"null":["1.5","8.6"],"code":["1.5","1.6","4.4","7.20","8.6"],"localcookie":["1.7"],"系统类型":["2.2"],"是否返回字符串":["2.4"],"false":["2.4"],"如果为":["2.4"],"true":["2.4","7.2","7.18","7.22"],"并且数组的只有一个值":["2.4"],"和":["2.6"],"如果设置成功":["2.8"],"则返回":["2.8","8.6"],"要设置的内容":["2.8"],"在这里演示的所有api均以es6的语法为基础":["3.0"],"details":["5.4"],"注意":["5.4"],"如果原有的object是响应式的":["5.4"],"那么在将object作为参数传入函数后":["5.4"],"要么会污染原有的object":["5.4"],"text":["6.1","6.5","6.9"],"此函数为一个异步函数":["6.4","6.8","6.12"],"返回一个布尔值":["6.4","6.8","6.12"],"checknull":["7.4"],"name":["7.4","7.8","7.12"],"否则返回":["7.6"],"checknotnull":["7.8"],"strlength":["7.12"],"gb":["7.14"],"const":["7.16","7.20"],"json":["7.16","7.20"],"最多包含的字符类型":["7.20"],"默认为4":["7.20"],"sancerain":["7.24"],"com":["7.24"],"的函数":["8.2"],"formatnumber":["9.1"],"函数":["9.1"],"beta":["9.6"],"同时也感谢我的同事们生产环境出问题的风险使用了山奈":["9.6"],"用的很好":["9.6"],"新增了":["9.10"],"run":["10.0"],"build":["10.0"],"运行单元测试":["10.0"],"test":["10.0"],"不稳定的api会进行特殊标注":["11.0"],"我们希望利用姜来让您的代码更加美味":["11.1"],"让您更加专注于业务逻辑的实现":["11.1"],"使用es6":["11.1"],"因此在使用时":["11.2"],"node":["11.3"],"members":["11.5"],"以下是山奈的贡献者名单头像缩略图":["11.6"],"钉钉":["11.7"],"npm":["12.1"],"install":["12.1"],"galanga":["12.3"],"您也可以引入山奈的cdn链接":["12.4"],"引入完成后":["12.4"],"您可以在项目中使用全部功能":["12.4"],"已完成":["13.0"],"您也可以直接在这里浏览文档源文件":["15.0"]},{"2":["7.20","9.16"],"8":["7.20"],"9":["11.3"],"12":["9.4","9.5"],"15":["9.11"],"16":["7.20"],"18":["9.2"],"19":["9.14"],"22":["9.9","9.13"],"50":["11.3"],"55":["11.3"],"1024":["7.16"],"galanga":["0.3","1.3","2.3","2.7","4.3","5.3","6.3","6.7","6.11","7.3","7.7","7.11","7.15","7.19","7.23","8.3"],"filteruniquebyproperty":["0.4","9.7"],"设置":["1.0","1.2"],"删除":["1.0"],"包括获取":["1.2"],"js":["1.5","2.8","6.4","6.8","6.12","8.6"],"按需引入":["1.5","1.6","4.4","6.4","6.8","6.12","8.6","8.7"],"localcookie":["1.5","1.6","1.8"],"setitem":["1.6"],"name":["1.6","1.7","8.5"],"removeitem":["1.7"],"clear":["1.8"],"则返回字符串":["2.4"],"否则返回一个对象":["2.4"],"默认情况下":["2.4"],"返回的是一个对象":["2.4"],"包含了浏览器类型":["2.4"],"write":["2.6"],"是否只设置文本内容":["2.8"],"则可以设置任意内容":["2.8"],"code":["2.8","6.4","6.8","6.12"],"group":["2.8","6.4","6.8","6.12","8.6"],"如果您使用的是其他类型的语法或者安装方法":["3.0"],"formatnumber":["4.4","9.3"],"要么会导致函数失去响应式":["5.4"],"具体情况取决于您的使用场景和框架":["5.4"],"如果在这种场景下":["5.4"],"您仍然想要使用这个函数":["5.4"],"并不希望污染原有的object":["5.4"],"那么您可以使用下面的方法":["5.4"],"beta":["6.1","6.5","6.9"],"表示用户已经拒绝了权限或浏览器不支持通知权限":["6.4"],"表示用户已经拒绝了权限或浏览器不支持剪贴板权限":["6.8"],"await":["6.8","6.12"],"表示用户已经拒绝了权限或浏览器不支持地理位置权限":["6.12"],"否则返回":["7.2","7.18","7.22"],"全局引入":["7.4","7.8","7.12","7.24"],"false":["7.6"],"此函数会反义":["7.6"],"tb":["7.14"],"pb":["7.14"],"b":["7.16"],"kb":["7.16"],"formatbytes":["7.16"],"它提供了一些方便的方法来处理":["8.2"],"getquery":["8.5"],"现在可以自定义保留小数位数了":["9.1"],"clipboard":["9.1"],"新增":["9.2","9.3"],"修复":["9.4","9.5"],"下次不准再用了":["9.6"],"jpg":["9.6"],"bushi":["9.6"],"新增了":["9.7","9.8","9.12","9.13","9.14"],"updateobjectfromimport":["9.8"],"checknull":["9.9"],"checknotnull":["9.10"],"函数":["9.10"],"对函数":["9.11"],"checkdevicetype":["9.12"],"注意":["10.0"],"浏览器环境需要手动测试":["10.0"],"位于":["10.0"],"browser":["10.0"],"修改":["10.0"],"和typescript编写源码":["11.1"],"编译生成生产代码":["11.1"],"多环境支持":["11.1"],"您可以获得更好的类型提示":["11.2"],"贡献者名单":["11.6"],"山奈galanga开源js函数库交流群":["11.7"],"telegram":["11.7"],"pnpm":["12.1"],"console":["12.2","12.3","12.4"],"log":["12.3","12.4"],"目前暂不支持将部分函数单独引入至项目内":["12.4"],"未完成":["13.0"]},{"4":["7.20","11.3"],"12345678":["7.20"],"id":["0.4"],"全局引入":["0.4","1.6","1.7","1.8","4.4","7.16","7.20","8.5","8.7"],"删除":["1.2"],"getitem":["1.5"],"name":["1.5"],"value":["1.6"],"galanga":["1.7","7.4","7.8","7.12","7.24"],"如下":["2.4"],"js":["2.4"],"chrome":["2.4"],"pc":["2.4"],"两个函数":["2.6"],"按需引入":["2.8"],"clipboard":["2.8","9.2"],"hello":["2.8"],"world":["2.8"],"then":["2.8"],"您需要自行转换":["3.0"],"let":["5.4"],"newobject":["5.4"],"notificationpermission":["6.4","9.6"],"await":["6.4"],"clipboardpermission":["6.8"],"locationpermission":["6.12"],"false":["7.2","7.18","7.22"],"checknull":["7.6","9.4"],"函数":["7.6","9.3","9.6","9.7","9.8","9.12"],"eb":["7.14"],"var":["7.16","7.20"],"checkpassword":["7.20","9.14"],"gethash":["8.6"],"getpath":["8.7"],"现在可以读取和写入任意类型的数据了":["9.1"],"updateobjectfromimport":["9.5"],"新增":["9.6"],"用于根据数组中对象的某个属性去重":["9.7"],"和":["9.9"],"用于检查字符串是否不为空":["9.10"],"此函数会反义":["9.10"],"checkdevicetype":["9.11"],"用于检查设备类型":["9.12"],"checkemail":["9.13"],"修复了":["9.15"],"formatbytes":["9.15"],"package":["10.0"],"json":["10.0"],"中的版本号":["10.0"],"readme":["10.0"],"支持浏览器原生":["11.1"],"支持amd":["11.1"],"cmd":["11.1"],"支持webpack":["11.1"],"censujiang":["11.7"],"log":["12.2"],"info":["12.4"],"我们更推荐使用npm项目的方式引入山奈":["12.4"]},{"galanga":["0.4","1.5","1.6","1.8","2.8","4.4","6.4","6.8","6.12","8.5","8.6","8.7"],"等":["1.0","1.2"],"全局引入":["1.5","2.8","6.4","6.8","6.12","8.6"],"windows":["2.4"],"web":["2.4"],"code":["2.4"],"group":["2.4","11.7"],"按需引入":["2.4"],"console":["2.8"],"log":["2.8"],"这也是为了业务逻辑的统一":["7.6"],"方便使用":["7.6"],"zb":["7.14"],"yb":["7.14"],"新增了":["9.1"],"locationpermission":["9.1"],"函数":["9.2","9.13","9.14"],"用于读取和设置剪贴板":["9.2"],"用于格式化数字":["9.3"],"保留两位小数":["9.3"],"函数的bug":["9.4","9.5"],"现在匹配到false的情况会返回false了":["9.4"],"现在可以正常使用了":["9.5"],"用于处理浏览器通知权限":["9.6"],"clipboardpermission":["9.6"],"将length大的数组保留":["9.7"],"length小的数组去掉":["9.7"],"用于将新的object中的值动态更新到原有的object中":["9.8"],"并不影响原有object中的结构":["9.8"],"checknotnull":["9.9"],"函数现在可以检查数字类型的参数是否为nan了":["9.9"],"checknull":["9.10"],"进行了优化":["9.11"],"现在可以更好的检测设备类型":["9.11"],"此函数不稳定":["9.12"],"可能会在后续版本中修改":["9.12"],"用于检查邮箱格式":["9.13"],"用于检查密码强度":["9.14"],"函数的两个bug":["9.15"],"项目发布测试版本":["9.16"],"md":["10.0"],"changelog":["10.0"],"然后发布新版":["10.0"],"rollup":["11.1"],"fis等":["11.1"],"支持node":["11.1"],"注意":["11.3"],"编译代码依赖es5环境":["11.3"],"对于ie6":["11.3"],"微信":["11.7"],"cnpm":["12.1"],"info":["12.2"],"我们在后文的使用示例中":["12.3"],"基本上都是使用这种方式引入山奈的":["12.3"],"因为这样不仅可以更好地管理依赖":["12.4"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["12.4"],"在查看后文的使用示例时":["12.4"],"请使用":["12.4"]},{"checkdevicetype":["2.4"],"全局引入":["2.4"],"galanga":["2.4","7.16","7.20"],"用于处理浏览器定位权限":["9.1"],"用于处理浏览器剪贴板权限":["9.6"],"方便使用":["9.10"],"release":["10.0"],"无依赖":["11.1"],"体积小巧":["11.1"],"8需要引入es5":["11.3"],"shim才可以兼容":["11.3"],"微信群":["11.7"],"安装完成后":["12.1"],"您可以在项目中引入山奈并使用对应的功能":["12.1"],"作为全局变量后再加具体的功能函数名":["12.4"]}]'},t={"0.0":{t:"array",p:`山奈提供了一些数组的操作方法，可以帮助您更好的操作数组。
`,l:"api/array.html",a:"array"},"0.1":{t:"filteruniquebyproperty",p:"\r",l:"api/array.html#filteruniquebyproperty",a:"filteruniquebyproperty"},"0.2":{t:"介绍",p:`根据数组中对象的某个属性去重，将length大的数组保留，length小的数组去掉。
`,l:"api/array.html#介绍",a:"介绍"},"0.3":{t:"导入",p:`import { filterUniqueByProperty } from 'galanga'

`,l:"api/array.html#导入",a:"导入"},"0.4":{t:"使用",p:`输入的参数如下：

array[array]: 数组
property[string]: 对象的属性

::: code-g ...`,l:"api/array.html#使用",a:"使用"},"1.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"1.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"1.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"1.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"1.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"1.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"1.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
::: code-group
localCoo ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"1.7":{t:"删除-cookie",p:`删除 Cookie。
::: code-group
localCookie.removeItem('name')

gala ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"1.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"2.0":{t:"device",p:`山奈提供了一些有关设备操作的API，可用来获取设备的信息，或者进行一些操作。
`,l:"api/device.html",a:"device"},"2.1":{t:"checkdevicetype",p:"\r",l:"api/device.html#checkdevicetype",a:"checkdevicetype"},"2.2":{t:"介绍",p:`检查当前设备的各种类型，包括浏览器类型、设备类型、系统类型
`,l:"api/device.html#介绍",a:"介绍"},"2.3":{t:"导入",p:`import { checkDeviceType } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"2.4":{t:"使用",p:`输入的参数如下：


type：要检查的类型，此参数为一个数组，默认为['browser', 'device', 'os', ...`,l:"api/device.html#使用",a:"使用"},"2.5":{t:"clipboard",p:"\r",l:"api/device.html#clipboard",a:"clipboard"},"2.6":{t:"介绍",p:`一个用于读取和设置剪切板的函数组合，包含了read和write两个函数
`,l:"api/device.html#介绍",a:"介绍"},"2.7":{t:"导入",p:`import { clipboard } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"2.8":{t:"使用",p:`一共有两个函数，分别是read和write，分别用于读取和设置剪切板


[async]read(onlyString)：读 ...`,l:"api/device.html#使用",a:"使用"},"3.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"4.0":{t:"number",p:`山奈提供了一些数学函数，这些函数可以用于数值计算。
`,l:"api/number.html",a:"number"},"4.1":{t:"formatnumber",p:"\r",l:"api/number.html#formatnumber",a:"formatnumber"},"4.2":{t:"介绍",p:`格式化数字，保留两位小数。
`,l:"api/number.html#介绍",a:"介绍"},"4.3":{t:"导入",p:`import { formatNumber } from 'galanga'

`,l:"api/number.html#导入",a:"导入"},"4.4":{t:"使用",p:`输入的参数如下：

number[number]: 数字
decimal[number]: 保留的小数位数，默认为2

:: ...`,l:"api/number.html#使用",a:"使用"},"5.0":{t:"object",p:`山奈提供了一些有关对象的方法，这些方法可以帮助您更好地使用对象。
`,l:"api/object.html",a:"object"},"5.1":{t:"updateobjectfromimport",p:"\r",l:"api/object.html#updateobjectfromimport",a:"updateobjectfromimport"},"5.2":{t:"介绍",p:`将新的object中的值动态更新到原有的object中，并不影响原有object中的结构。
`,l:"api/object.html#介绍",a:"介绍"},"5.3":{t:"导入",p:`import { updateObjectFromImport } from 'galanga'

`,l:"api/object.html#导入",a:"导入"},"5.4":{t:"使用",p:`输入的参数如下：

importObject[object]: 新的object，用于更新原有的object
object[ ...`,l:"api/object.html#使用",a:"使用"},"6.0":{t:"权限permission",p:`山奈提供了一些API用于您去获取或判断是否获取了一些浏览器权限。
`,l:"api/permission.html",a:"权限permission"},"6.1":{t:"notificationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#notificationpermission-badge-type-warning-text-beta",a:"notificationpermission-badge-type-warning-text-beta"},"6.2":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的通知权限。
`,l:"api/permission.html#介绍",a:"介绍"},"6.3":{t:"导入",p:`import { notificationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"6.4":{t:"使用",p:`此集合有两个子函数，分别如下：


check(): 用于判断是否获取了通知权限，返回一个布尔值或Null，true表示获取 ...`,l:"api/permission.html#使用",a:"使用"},"6.5":{t:"clipboardpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#clipboardpermission-badge-type-warning-text-beta",a:"clipboardpermission-badge-type-warning-text-beta"},"6.6":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的剪贴板权限。
`,l:"api/permission.html#介绍",a:"介绍"},"6.7":{t:"导入",p:`import { clipboardPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"6.8":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了剪贴板权限，此函数是一个异步函数，返回 ...`,l:"api/permission.html#使用",a:"使用"},"6.9":{t:"locationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#locationpermission-badge-type-warning-text-beta",a:"locationpermission-badge-type-warning-text-beta"},"6.10":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的地理位置权限。
`,l:"api/permission.html#介绍",a:"介绍"},"6.11":{t:"导入",p:`import { locationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"6.12":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了地理位置权限，此函数是一个异步函数，返 ...`,l:"api/permission.html#使用",a:"使用"},"7.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"7.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"7.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"7.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"7.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"7.5":{t:"checknotnull",p:"\r",l:"api/string.html#checknotnull",a:"checknotnull"},"7.6":{t:"介绍",p:"判断字符串是否不为空（非空），如果字符串不为空，则返回 true，否则返回 false。此函数会反义 checkNull 函 ...",l:"api/string.html#介绍",a:"介绍"},"7.7":{t:"导入",p:`import { checkNotNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"7.8":{t:"使用",p:`::: code-group
checkNotNull(name)

galanga.checkNotNull(name)
 ...`,l:"api/string.html#使用",a:"使用"},"7.9":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"7.10":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"7.11":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"7.12":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"7.13":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"7.14":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"7.15":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"7.16":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"7.17":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"7.18":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"7.19":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"7.20":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"7.21":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"7.22":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"7.23":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"7.24":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"8.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"8.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"8.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"8.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"8.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"8.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"8.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"8.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
::: code-group
url.getPath()

gal ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"9.0":{t:"更新日志",p:"\r",l:"guide/changelog.html",a:"更新日志"},"9.1":{t:"_0-1-5-2023-5-25",p:`
拓展了formatNumber函数，现在可以自定义保留小数位数了。
拓展了clipboard函数，现在可以读取和写入任意类 ...`,l:"guide/changelog.html#_0-1-5-2023-5-25",a:"_0-1-5-2023-5-25"},"9.2":{t:"_0-1-4-2023-5-18",p:`
新增clipboard函数，用于读取和设置剪贴板。

`,l:"guide/changelog.html#_0-1-4-2023-5-18",a:"_0-1-4-2023-5-18"},"9.3":{t:"_0-1-3-2023-5-16",p:`
新增formatNumber函数，用于格式化数字，保留两位小数。

`,l:"guide/changelog.html#_0-1-3-2023-5-16",a:"_0-1-3-2023-5-16"},"9.4":{t:"_0-1-2-2023-5-12",p:`
修复checkNull函数的bug，现在匹配到false的情况会返回false了。

`,l:"guide/changelog.html#_0-1-2-2023-5-12",a:"_0-1-2-2023-5-12"},"9.5":{t:"_0-1-1-2023-5-12",p:`
修复updateObjectFromImport函数的bug，现在可以正常使用了。

`,l:"guide/changelog.html#_0-1-1-2023-5-12",a:"_0-1-1-2023-5-12"},"9.6":{t:"_0-1-0-2023-5-11",p:`

项目推进至公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会在文档内标注beta，同时也感谢我的同事们生产环境出问 ...`,l:"guide/changelog.html#_0-1-0-2023-5-11",a:"_0-1-0-2023-5-11"},"9.7":{t:"_0-0-27-2023-5-9",p:`
新增了filterUniqueByProperty函数，用于根据数组中对象的某个属性去重，将length大的数组保留，le ...`,l:"guide/changelog.html#_0-0-27-2023-5-9",a:"_0-0-27-2023-5-9"},"9.8":{t:"_0-0-26-2023-5-9",p:`
新增了updateObjectFromImport函数，用于将新的object中的值动态更新到原有的object中，并不影 ...`,l:"guide/changelog.html#_0-0-26-2023-5-9",a:"_0-0-26-2023-5-9"},"9.9":{t:"_0-0-25-2023-4-22",p:`
checkNull和checkNotNull函数现在可以检查数字类型的参数是否为NaN了。

`,l:"guide/changelog.html#_0-0-25-2023-4-22",a:"_0-0-25-2023-4-22"},"9.10":{t:"_0-0-24-2023-4-18",p:`
新增了 checkNotNull 函数，用于检查字符串是否不为空，此函数会反义 checkNull 函数，方便使用。

`,l:"guide/changelog.html#_0-0-24-2023-4-18",a:"_0-0-24-2023-4-18"},"9.11":{t:"_0-0-23-2023-4-15",p:`
对函数checkDeviceType进行了优化，现在可以更好的检测设备类型

`,l:"guide/changelog.html#_0-0-23-2023-4-15",a:"_0-0-23-2023-4-15"},"9.12":{t:"_0-0-22-2023-4-7",p:`
新增了 checkDeviceType 函数，用于检查设备类型，此函数不稳定，可能会在后续版本中修改

`,l:"guide/changelog.html#_0-0-22-2023-4-7",a:"_0-0-22-2023-4-7"},"9.13":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"9.14":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"9.15":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"9.16":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"10.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"11.0":{t:"入门",p:`::: tip
本项目进入公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会进行特殊标注。
:::
`,l:"guide/index.html",a:"入门"},"11.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"11.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"11.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"11.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"11.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"11.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"11.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"12.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"12.1":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"12.2":{t:"全部引入",p:`import galanga from 'galanga'

console.log(galanga.info)

`,l:"guide/install.html#全部引入",a:"全部引入"},"12.3":{t:"按需引入",p:`import { info } from 'galanga'

console.log(info)

我们在后文的使用示例中 ...`,l:"guide/install.html#按需引入",a:"按需引入"},"12.4":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"13.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"15.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},a={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},n={INDEX_DATA:e,PREVIEW_LOOKUP:t,Options:a};export{n as default};
