const e={map:'[{"array":["0.0"],"filteruniquebyproperty":["0.1"],"介绍":["0.2","2.2","4.2","5.2","5.6","6.2","6.6","6.10","6.14","6.18","6.22","7.2"],"导入":["0.3","1.3","2.3","4.3","5.3","5.7","6.3","6.7","6.11","6.15","6.19","6.23","7.3"],"使用":["0.4","1.4","2.4","4.4","5.4","5.8","6.4","6.8","6.12","6.16","6.20","6.24","7.4"],"cookie":["1.0"],"localcookie":["1.1"],"简介":["1.2"],"获取":["1.5"],"设置":["1.6"],"删除":["1.7"],"清空":["1.8"],"device":["2.0"],"checkdevicetype":["2.1"],"前言":["3.0"],"object":["4.0"],"updateobjectfromimport":["4.1"],"权限permission":["5.0"],"notificationpermission":["5.1"],"clipboardpermission":["5.5"],"string":["6.0"],"checknull":["6.1"],"checknotnull":["6.5"],"strlength":["6.9"],"formatbytes":["6.13"],"checkpassword":["6.17"],"checkemail":["6.21"],"url":["7.0","7.1"],"获取url的参数":["7.5"],"获取url的hash":["7.6"],"获取url的路径":["7.7"],"更新日志":["8.0"],"贡献指南":["9.0"],"入门":["10.0"],"项目简介":["10.1"],"使用理由":["10.2"],"兼容性":["10.3"],"开发人员":["10.4"],"负责人":["10.5"],"贡献者":["10.6"],"入群交流":["10.7"],"安装":["11.0"],"在npm项目下使用":["11.1"],"全部引入":["11.2"],"按需引入":["11.3"],"在html单页面下使用":["11.4"],"项目计划":["12.0"],"提示":["14.0"]},{"0":["8.1","8.2","8.3","8.4","8.5","8.6","8.7","8.8","8.9","8.10","8.11"],"1":["8.1"],"山奈提供了一些数组的操作方法":["0.0"],"根据数组中对象的某个属性去重":["0.2"],"js":["0.3","1.3","2.3","4.3","5.3","5.7","6.3","6.7","6.11","6.15","6.19","6.23","7.3","11.2","11.3"],"输入的参数如下":["0.4","2.4","4.4"],"array":["0.4"],"山奈提供了一些常用的":["1.0"],"localcookie":["1.2"],"cookie":["1.5","1.6","1.7","1.8"],"山奈提供了一些有关设备操作的api":["2.0"],"检查当前设备的各种类型":["2.2"],"type":["2.4"],"要检查的类型":["2.4"],"此参数为一个数组":["2.4"],"默认为":["2.4"],"browser":["2.4"],"在本站的api信息栏目中":["3.0"],"山奈提供了一些有关对象的方法":["4.0"],"将新的object中的值动态更新到原有的object中":["4.2"],"importobject":["4.4"],"object":["4.4"],"山奈提供了一些api用于您去获取或判断是否获取了一些浏览器权限":["5.0"],"badge":["5.1","5.5"],"这是一个函数集合":["5.2","5.6"],"此集合有两个子函数":["5.4","5.8"],"分别如下":["5.4","5.8"],"check":["5.4","5.8"],"用于判断是否获取了通知权限":["5.4"],"async":["5.8"],"用于判断是否获取了剪贴板权限":["5.8"],"山奈提供了一些字符串处理的函数":["6.0"],"判断字符串是否为空":["6.2"],"code":["6.4","6.8","6.12","6.24","11.1"],"判断字符串是否不为空":["6.6"],"获取字符串的长度":["6.10"],"将字节格式化为":["6.14"],"输入参数":["6.16","6.20"],"bytes":["6.16"],"字节数":["6.16"],"一个json对象":["6.16","6.20"],"可选":["6.16","6.20"],"检查密码强度的函数":["6.18"],"password":["6.20"],"密码":["6.20"],"有以下内容":["6.20"],"minlength":["6.20"],"密码最小长度":["6.20"],"默认为8":["6.20"],"检查邮箱格式的函数":["6.22"],"group":["6.24"],"山奈提供了一些方便的方法来处理":["7.0"],"url":["7.2","7.5","7.6","7.7"],"获取":["7.5","7.6","7.7"],"我们使用":["9.0"],"yarn":["9.0"],"作为包管理工具":["9.0"],"请先安装":["9.0"],"tip":["10.0"],"山奈":["10.1"],"galanga":["10.1"],"以下简称山奈":["10.1"],"相比其他的函数库":["10.2"],"单元测试保证支持如下环境":["10.3"],"ie":["10.3"],"vpteammembers":["10.5"],"请在github上或者gitee上查看贡献者名单":["10.6"],"为了方便各位开发者的交流":["10.7"],"在npm项目下":["11.1"],"您可以通过以下命令安装山奈":["11.1"],"在html单页面下":["11.4"],"您可以在官方仓库内下载山奈的打包产物":["11.4"],"然后引入至您的html文件中":["11.4"],"这里列出会在未来添加的新功能":["12.0"],"这是一个基于":["14.0"]},{"5":["8.1"],"11":["8.1"],"22":["8.7"],"24":["8.5"],"26":["8.3"],"27":["8.2"],"2023":["8.1"],"可以帮助您更好的操作数组":["0.0"],"将length大的数组保留":["0.2"],"import":["0.3","1.3","2.3","4.3","5.3","5.7","6.3","6.7","6.11","6.15","6.19","6.23","7.3","11.2","11.3"],"数组":["0.4"],"property":["0.4"],"是一个对象":["1.2"],"的值":["1.5","1.6"],"如果":["1.5","1.6"],"code":["1.7"],"清空所有":["1.8"],"可用来获取设备的信息":["2.0"],"包括浏览器类型":["2.2"],"device":["2.4"],"os":["2.4"],"可选值为":["2.4"],"您可以查看您所需要的api的详细信息":["3.0"],"这些方法可以帮助您更好地使用对象":["4.0"],"并不影响原有object中的结构":["4.2"],"新的object":["4.4"],"用于更新原有的object":["4.4"],"type":["5.1","5.5"],"用于获取或判断是否获取了浏览器的通知权限":["5.2"],"返回一个布尔值或null":["5.4","5.8"],"true":["5.4","5.8"],"表示获取了权限":["5.4","5.8"],"false":["5.4","5.8"],"表示没有获取权限或浏览器不支持通知权限":["5.4"],"用于获取或判断是否获取了浏览器的剪贴板权限":["5.6"],"此函数是一个异步函数":["5.8"],"用于处理字符串":["6.0"],"如果字符串为空":["6.2","6.10"],"group":["6.4","6.8","6.12","11.1"],"js":["6.4","6.8","6.12","6.24","11.4"],"非空":["6.6"],"如果字符串不为空":["6.6"],"b":["6.14"],"有以下内容":["6.16"],"decimals":["6.16"],"保留的小数位数":["6.16"],"默认为1":["6.16"],"from":["6.16"],"输入的字节单位":["6.16"],"如果符合要求":["6.18","6.22"],"maxlength":["6.20"],"密码最大长度":["6.20"],"默认为16":["6.20"],"types":["6.20"],"字符类型":["6.20"],"分别为数字":["6.20"],"小写字母":["6.20"],"大写字母":["6.20"],"特殊字符":["6.20"],"按需引入":["6.24"],"是一个用于处理":["7.2"],"参数的值":["7.5"],"如果参数不存在":["7.5"],"则返回":["7.5"],"的":["7.6"],"hash":["7.6"],"值":["7.6"],"的路径":["7.7"],"如果路径不存在":["7.7"],"bash":["9.0","11.1"],"npm":["9.0"],"install":["9.0"],"g":["9.0"],"安装依赖":["9.0"],"本项目进入公测阶段":["10.0"],"是川菜中常用的调味品":["10.1"],"也可以用作腌制成为单独的菜品":["10.1"],"而这一辅料被人们俗称为姜":["10.1"],"山奈希望提供在业务中常用的一些函数":["10.2"],"ch":["10.3"],"ff":["10.3"],"sf":["10.3"],"size":["10.5"],"如果您也想对山奈做出贡献":["10.6"],"我们在各大平台都开设了有关山奈的交流群":["10.7"],"欢迎大家加入":["10.7"],"yarn":["11.1"],"例如您将山奈的打包产物放在":["11.4"],"galanga":["11.4"],"目录下":["11.4"],"和已经完成的功能":["12.0"],"vitepress":["14.0"]},{"1":["8.11"],"4":["8.5","8.7"],"5":["8.2"],"19":["8.10"],"20":["8.9"],"21":["8.8"],"23":["8.6"],"25":["8.4"],"2023":["8.2","8.3","8.4","8.5","8.6","8.7","8.8","8.9","8.10"],"length小的数组去掉":["0.2"],"filteruniquebyproperty":["0.3"],"string":["0.4","2.4"],"对象的属性":["0.4"],"code":["0.4","1.8","4.4","6.16","7.5","7.7"],"操作函数":["1.0"],"包含了一些常用的":["1.2"],"cookie":["1.2"],"localcookie":["1.3"],"不存在":["1.5","1.6","7.6"],"则返回":["1.5","6.2","6.6","6.10","6.18","6.22","7.7"],"则创建":["1.6"],"group":["1.7","1.8","6.16"],"js":["1.7"],"或者进行一些操作":["2.0"],"设备类型":["2.2","2.4"],"checkdevicetype":["2.3"],"分别表示浏览器类型":["2.4"],"系统类型":["2.4"],"return":["2.4"],"是否返回字符串":["2.4"],"请注意的是":["3.0"],"updateobjectfromimport":["4.3"],"原有的object":["4.4"],"warning":["5.1","5.5"],"notificationpermission":["5.3"],"null":["5.4","5.8","7.5","7.7"],"表示用户还未做出选择":["5.4","5.8"],"async":["5.4"],"request":["5.4","5.8"],"用于请求通知权限":["5.4"],"clipboardpermission":["5.7"],"表示没有获取权限或浏览器不支持剪贴板权限":["5.8"],"用于请求剪贴板权限":["5.8"],"checknull":["6.3"],"按需引入":["6.4","6.8","6.12"],"true":["6.6"],"checknotnull":["6.7"],"strlength":["6.11"],"kb":["6.14"],"mb":["6.14"],"formatbytes":["6.15"],"默认为b":["6.16"],"to":["6.16"],"输出的字节单位":["6.16"],"checkpassword":["6.19"],"默认为":["6.20"],"number":["6.20"],"lowercase":["6.20"],"uppercase":["6.20"],"special":["6.20"],"mintypes":["6.20"],"最少包含的字符类型":["6.20"],"默认为2":["6.20"],"maxtypes":["6.20"],"checkemail":["6.23","6.24"],"info":["6.24"],"url":["7.3"],"如果":["7.6"],"项目推进至公测阶段":["8.1"],"欢迎大家使用并提出宝贵的意见":["8.1","10.0"],"不稳定的api会在文档内标注":["8.1"],"一键打包生成生产代码":["9.0"],"在web的世界里":["10.1"],"它是一个开源的实用的js函数库":["10.1"],"它的目标是提供一些常用的函数":["10.1"],"让你的代码更简洁更易读":["10.1"],"而山奈也是基于typescript开发的":["10.2"],"op":["10.3"],"ios":["10.3"],"android":["10.3"],"small":["10.5"],"请参考贡献指南":["10.6"],"qq":["10.7"],"add":["11.1"],"galanga":["11.1","11.2"],"from":["11.2","11.3"],"name":["11.3"],"您可以通过以下方式引入山奈":["11.4"],"html":["11.4"],"当然":["11.4"],"x":["12.0"],"的文档站点":["14.0"]},{"0":["6.10"],"1":["6.16"],"3":["8.8","8.9","8.10"],"4":["8.4","8.6"],"5":["8.3"],"6":["10.3"],"7":["8.7"],"9":["8.2","8.3"],"18":["8.5"],"29":["10.3"],"2023":["8.11"],"346363551":["10.7"],"from":["0.3","1.3","2.3","4.3","5.3","5.7","6.3","6.7","6.11","6.15","6.19","6.23","7.3"],"group":["0.4","1.5","1.6","4.4","6.20","7.5","7.7"],"js":["0.4","1.6","1.8","4.4","6.16","6.20","7.5","7.7"],"按需引入":["0.4","1.7","1.8","4.4","6.16","6.20","7.5"],"包括获取":["1.0"],"操作函数":["1.2"],"null":["1.5","7.6"],"code":["1.5","1.6","6.20","7.6"],"localcookie":["1.7"],"系统类型":["2.2"],"false":["2.4"],"如果为":["2.4"],"true":["2.4","6.2","6.18","6.22"],"并且数组的只有一个值":["2.4"],"则返回字符串":["2.4"],"在这里演示的所有api均以es6的语法为基础":["3.0"],"text":["5.1","5.5"],"此函数为一个异步函数":["5.4","5.8"],"返回一个布尔值":["5.4","5.8"],"checknull":["6.4"],"name":["6.4","6.8","6.12"],"否则返回":["6.6"],"checknotnull":["6.8"],"strlength":["6.12"],"gb":["6.14"],"const":["6.16","6.20"],"json":["6.16","6.20"],"最多包含的字符类型":["6.20"],"默认为4":["6.20"],"sancerain":["6.24"],"com":["6.24"],"的函数":["7.2"],"则返回":["7.6"],"beta":["8.1"],"同时也感谢我的同事们生产环境出问题的风险使用了山奈":["8.1"],"用的很好":["8.1"],"新增了":["8.5"],"run":["9.0"],"build":["9.0"],"运行单元测试":["9.0"],"test":["9.0"],"不稳定的api会进行特殊标注":["10.0"],"我们希望利用姜来让您的代码更加美味":["10.1"],"让您更加专注于业务逻辑的实现":["10.1"],"使用es6":["10.1"],"因此在使用时":["10.2"],"node":["10.3"],"members":["10.5"],"以下是山奈的贡献者名单头像缩略图":["10.6"],"钉钉":["10.7"],"npm":["11.1"],"install":["11.1"],"galanga":["11.3"],"您也可以引入山奈的cdn链接":["11.4"],"引入完成后":["11.4"],"您可以在项目中使用全部功能":["11.4"],"已完成":["12.0"],"您也可以直接在这里浏览文档源文件":["14.0"]},{"2":["6.20","8.11"],"8":["6.20"],"9":["10.3"],"15":["8.6"],"16":["6.20"],"19":["8.9"],"22":["8.4","8.8"],"50":["10.3"],"55":["10.3"],"1024":["6.16"],"galanga":["0.3","1.3","2.3","4.3","5.3","5.7","6.3","6.7","6.11","6.15","6.19","6.23","7.3"],"filteruniquebyproperty":["0.4","8.2"],"设置":["1.0","1.2"],"删除":["1.0"],"包括获取":["1.2"],"js":["1.5","5.4","5.8","7.6"],"按需引入":["1.5","1.6","5.4","5.8","7.6","7.7"],"localcookie":["1.5","1.6","1.8"],"setitem":["1.6"],"name":["1.6","1.7","7.5"],"removeitem":["1.7"],"clear":["1.8"],"否则返回一个对象":["2.4"],"默认情况下":["2.4"],"返回的是一个对象":["2.4"],"包含了浏览器类型":["2.4"],"如果您使用的是其他类型的语法或者安装方法":["3.0"],"updateobjectfromimport":["4.4","8.3"],"beta":["5.1","5.5"],"表示用户已经拒绝了权限或浏览器不支持通知权限":["5.4"],"code":["5.4","5.8"],"group":["5.4","5.8","7.6"],"表示用户已经拒绝了权限或浏览器不支持剪贴板权限":["5.8"],"await":["5.8"],"否则返回":["6.2","6.18","6.22"],"全局引入":["6.4","6.8","6.12","6.24"],"false":["6.6"],"此函数会反义":["6.6"],"tb":["6.14"],"pb":["6.14"],"b":["6.16"],"kb":["6.16"],"formatbytes":["6.16"],"它提供了一些方便的方法来处理":["7.2"],"getquery":["7.5"],"下次不准再用了":["8.1"],"jpg":["8.1"],"bushi":["8.1"],"新增了":["8.2","8.3","8.7","8.8","8.9"],"checknull":["8.4"],"checknotnull":["8.5"],"函数":["8.5"],"对函数":["8.6"],"checkdevicetype":["8.7"],"注意":["9.0"],"浏览器环境需要手动测试":["9.0"],"位于":["9.0"],"browser":["9.0"],"修改":["9.0"],"和typescript编写源码":["10.1"],"编译生成生产代码":["10.1"],"多环境支持":["10.1"],"您可以获得更好的类型提示":["10.2"],"贡献者名单":["10.6"],"山奈galanga开源js函数库交流群":["10.7"],"telegram":["10.7"],"pnpm":["11.1"],"console":["11.2","11.3","11.4"],"log":["11.3","11.4"],"目前暂不支持将部分函数单独引入至项目内":["11.4"],"未完成":["12.0"]},{"4":["6.20","10.3"],"12345678":["6.20"],"id":["0.4"],"全局引入":["0.4","1.6","1.7","1.8","4.4","6.16","6.20","7.5","7.7"],"删除":["1.2"],"getitem":["1.5"],"name":["1.5","11.4"],"value":["1.6"],"galanga":["1.7","6.4","6.8","6.12","6.24"],"如下":["2.4"],"js":["2.4"],"chrome":["2.4"],"pc":["2.4"],"您需要自行转换":["3.0"],"notificationpermission":["5.4","8.1"],"await":["5.4"],"clipboardpermission":["5.8"],"false":["6.2","6.18","6.22"],"checknull":["6.6"],"函数":["6.6","8.1","8.2","8.3","8.7"],"eb":["6.14"],"var":["6.16","6.20"],"checkpassword":["6.20","8.9"],"gethash":["7.6"],"getpath":["7.7"],"新增":["8.1"],"用于根据数组中对象的某个属性去重":["8.2"],"和":["8.4"],"用于检查字符串是否不为空":["8.5"],"此函数会反义":["8.5"],"checkdevicetype":["8.6"],"用于检查设备类型":["8.7"],"checkemail":["8.8"],"修复了":["8.10"],"formatbytes":["8.10"],"package":["9.0"],"json":["9.0"],"中的版本号":["9.0"],"readme":["9.0"],"支持浏览器原生":["10.1"],"支持amd":["10.1"],"cmd":["10.1"],"支持webpack":["10.1"],"censujiang":["10.7"],"log":["11.2"],"我们更推荐使用npm项目的方式引入山奈":["11.4"]},{"galanga":["0.4","1.5","1.6","1.8","4.4","5.4","5.8","7.5","7.6","7.7"],"等":["1.0","1.2"],"全局引入":["1.5","5.4","5.8","7.6"],"windows":["2.4"],"code":["2.4"],"group":["2.4","10.7"],"按需引入":["2.4"],"这也是为了业务逻辑的统一":["6.6"],"方便使用":["6.6"],"zb":["6.14"],"yb":["6.14"],"用于处理浏览器通知权限":["8.1"],"clipboardpermission":["8.1"],"将length大的数组保留":["8.2"],"length小的数组去掉":["8.2"],"用于将新的object中的值动态更新到原有的object中":["8.3"],"并不影响原有object中的结构":["8.3"],"checknotnull":["8.4"],"函数现在可以检查数字类型的参数是否为nan了":["8.4"],"checknull":["8.5"],"进行了优化":["8.6"],"现在可以更好的检测设备类型":["8.6"],"此函数不稳定":["8.7"],"可能会在后续版本中修改":["8.7"],"函数":["8.8","8.9"],"用于检查邮箱格式":["8.8"],"用于检查密码强度":["8.9"],"函数的两个bug":["8.10"],"项目发布测试版本":["8.11"],"md":["9.0"],"changelog":["9.0"],"然后发布新版":["9.0"],"rollup":["10.1"],"fis等":["10.1"],"支持node":["10.1"],"注意":["10.3"],"编译代码依赖es5环境":["10.3"],"对于ie6":["10.3"],"微信":["10.7"],"cnpm":["11.1"],"name":["11.2"],"我们在后文的使用示例中":["11.3"],"基本上都是使用这种方式引入山奈的":["11.3"],"因为这样不仅可以更好地管理依赖":["11.4"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["11.4"],"在查看后文的使用示例时":["11.4"],"请使用":["11.4"]},{"checkdevicetype":["2.4"],"全局引入":["2.4"],"galanga":["2.4","6.16","6.20"],"用于处理浏览器剪贴板权限":["8.1"],"方便使用":["8.5"],"release":["9.0"],"无依赖":["10.1"],"体积小巧":["10.1"],"8需要引入es5":["10.3"],"shim才可以兼容":["10.3"],"微信群":["10.7"],"安装完成后":["11.1"],"您可以在项目中引入山奈并使用对应的功能":["11.1"],"作为全局变量后再加具体的功能函数名":["11.4"]}]'},t={"0.0":{t:"array",p:`山奈提供了一些数组的操作方法，可以帮助您更好的操作数组。
`,l:"api/array.html",a:"array"},"0.1":{t:"filteruniquebyproperty",p:"\r",l:"api/array.html#filteruniquebyproperty",a:"filteruniquebyproperty"},"0.2":{t:"介绍",p:`根据数组中对象的某个属性去重，将length大的数组保留，length小的数组去掉。
`,l:"api/array.html#介绍",a:"介绍"},"0.3":{t:"导入",p:`import { filterUniqueByProperty } from 'galanga'

`,l:"api/array.html#导入",a:"导入"},"0.4":{t:"使用",p:`输入的参数如下：

array[array]: 数组
property[string]: 对象的属性

::: code-g ...`,l:"api/array.html#使用",a:"使用"},"1.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"1.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"1.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"1.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"1.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"1.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"1.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
::: code-group
localCoo ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"1.7":{t:"删除-cookie",p:`删除 Cookie。
::: code-group
localCookie.removeItem('name')

gala ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"1.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"2.0":{t:"device",p:`山奈提供了一些有关设备操作的API，可用来获取设备的信息，或者进行一些操作。
`,l:"api/device.html",a:"device"},"2.1":{t:"checkdevicetype",p:"\r",l:"api/device.html#checkdevicetype",a:"checkdevicetype"},"2.2":{t:"介绍",p:`检查当前设备的各种类型，包括浏览器类型、设备类型、系统类型
`,l:"api/device.html#介绍",a:"介绍"},"2.3":{t:"导入",p:`import { checkDeviceType } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"2.4":{t:"使用",p:`输入的参数如下：


type：要检查的类型，此参数为一个数组，默认为['browser', 'device', 'os'] ...`,l:"api/device.html#使用",a:"使用"},"3.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"4.0":{t:"object",p:`山奈提供了一些有关对象的方法，这些方法可以帮助您更好地使用对象。
`,l:"api/object.html",a:"object"},"4.1":{t:"updateobjectfromimport",p:"\r",l:"api/object.html#updateobjectfromimport",a:"updateobjectfromimport"},"4.2":{t:"介绍",p:`将新的object中的值动态更新到原有的object中，并不影响原有object中的结构。
`,l:"api/object.html#介绍",a:"介绍"},"4.3":{t:"导入",p:`import { updateObjectFromImport } from 'galanga'

`,l:"api/object.html#导入",a:"导入"},"4.4":{t:"使用",p:`输入的参数如下：

importObject[object]: 新的object，用于更新原有的object
object[ ...`,l:"api/object.html#使用",a:"使用"},"5.0":{t:"权限permission",p:`山奈提供了一些API用于您去获取或判断是否获取了一些浏览器权限。
`,l:"api/permission.html",a:"权限permission"},"5.1":{t:"notificationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#notificationpermission-badge-type-warning-text-beta",a:"notificationpermission-badge-type-warning-text-beta"},"5.2":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的通知权限。
`,l:"api/permission.html#介绍",a:"介绍"},"5.3":{t:"导入",p:`import { notificationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"5.4":{t:"使用",p:`此集合有两个子函数，分别如下：


check(): 用于判断是否获取了通知权限，返回一个布尔值或Null，true表示获取 ...`,l:"api/permission.html#使用",a:"使用"},"5.5":{t:"clipboardpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#clipboardpermission-badge-type-warning-text-beta",a:"clipboardpermission-badge-type-warning-text-beta"},"5.6":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的剪贴板权限。
`,l:"api/permission.html#介绍",a:"介绍"},"5.7":{t:"导入",p:`import { clipboardPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"5.8":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了剪贴板权限，此函数是一个异步函数，返回 ...`,l:"api/permission.html#使用",a:"使用"},"6.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"6.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"6.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"6.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"6.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"6.5":{t:"checknotnull",p:"\r",l:"api/string.html#checknotnull",a:"checknotnull"},"6.6":{t:"介绍",p:"判断字符串是否不为空（非空），如果字符串不为空，则返回 true，否则返回 false。此函数会反义 checkNull 函 ...",l:"api/string.html#介绍",a:"介绍"},"6.7":{t:"导入",p:`import { checkNotNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"6.8":{t:"使用",p:`::: code-group
checkNotNull(name)

galanga.checkNotNull(name)
 ...`,l:"api/string.html#使用",a:"使用"},"6.9":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"6.10":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"6.11":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"6.12":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"6.13":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"6.14":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"6.15":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"6.16":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"6.17":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"6.18":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"6.19":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"6.20":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"6.21":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"6.22":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"6.23":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"6.24":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"7.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"7.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"7.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"7.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"7.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"7.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"7.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"7.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
::: code-group
url.getPath()

gal ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"8.0":{t:"更新日志",p:"\r",l:"guide/changelog.html",a:"更新日志"},"8.1":{t:"_0-1-0-2023-5-11",p:`

项目推进至公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会在文档内标注beta，同时也感谢我的同事们生产环境出问 ...`,l:"guide/changelog.html#_0-1-0-2023-5-11",a:"_0-1-0-2023-5-11"},"8.2":{t:"_0-0-27-2023-5-9",p:`
新增了filterUniqueByProperty函数，用于根据数组中对象的某个属性去重，将length大的数组保留，le ...`,l:"guide/changelog.html#_0-0-27-2023-5-9",a:"_0-0-27-2023-5-9"},"8.3":{t:"_0-0-26-2023-5-9",p:`
新增了updateObjectFromImport函数，用于将新的object中的值动态更新到原有的object中，并不影 ...`,l:"guide/changelog.html#_0-0-26-2023-5-9",a:"_0-0-26-2023-5-9"},"8.4":{t:"_0-0-25-2023-4-22",p:`
checkNull和checkNotNull函数现在可以检查数字类型的参数是否为NaN了。

`,l:"guide/changelog.html#_0-0-25-2023-4-22",a:"_0-0-25-2023-4-22"},"8.5":{t:"_0-0-24-2023-4-18",p:`
新增了 checkNotNull 函数，用于检查字符串是否不为空，此函数会反义 checkNull 函数，方便使用。

`,l:"guide/changelog.html#_0-0-24-2023-4-18",a:"_0-0-24-2023-4-18"},"8.6":{t:"_0-0-23-2023-4-15",p:`
对函数checkDeviceType进行了优化，现在可以更好的检测设备类型

`,l:"guide/changelog.html#_0-0-23-2023-4-15",a:"_0-0-23-2023-4-15"},"8.7":{t:"_0-0-22-2023-4-7",p:`
新增了 checkDeviceType 函数，用于检查设备类型，此函数不稳定，可能会在后续版本中修改

`,l:"guide/changelog.html#_0-0-22-2023-4-7",a:"_0-0-22-2023-4-7"},"8.8":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"8.9":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"8.10":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"8.11":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"9.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"10.0":{t:"入门",p:`::: tip
本项目进入公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会进行特殊标注。
:::
`,l:"guide/index.html",a:"入门"},"10.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"10.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"10.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"10.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"10.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"10.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"10.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"11.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"11.1":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"11.2":{t:"全部引入",p:`import galanga from 'galanga'

console.log(galanga.name)

`,l:"guide/install.html#全部引入",a:"全部引入"},"11.3":{t:"按需引入",p:`import { name } from 'galanga'

console.log(name)

我们在后文的使用示例中 ...`,l:"guide/install.html#按需引入",a:"按需引入"},"11.4":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"12.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"14.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},a={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},n={INDEX_DATA:e,PREVIEW_LOOKUP:t,Options:a};export{n as default};
