const l={map:'[{"cookie":["0.0"],"localcookie":["0.1"],"简介":["0.2"],"导入":["0.3","1.3","3.3","3.7","3.11","3.15","3.19","3.23","4.3"],"使用":["0.4","1.4","3.4","3.8","3.12","3.16","3.20","3.24","4.4"],"获取":["0.5"],"设置":["0.6"],"删除":["0.7"],"清空":["0.8"],"device":["1.0"],"checkdevicetype":["1.1"],"介绍":["1.2","3.2","3.6","3.10","3.14","3.18","3.22","4.2"],"前言":["2.0"],"string":["3.0"],"checknull":["3.1"],"checknotnull":["3.5"],"strlength":["3.9"],"formatbytes":["3.13"],"checkpassword":["3.17"],"checkemail":["3.21"],"url":["4.0","4.1"],"获取url的参数":["4.5"],"获取url的hash":["4.6"],"获取url的路径":["4.7"],"更新日志":["5.0"],"贡献指南":["6.0"],"入门":["7.0"],"项目简介":["7.1"],"使用理由":["7.2"],"兼容性":["7.3"],"开发人员":["7.4"],"负责人":["7.5"],"贡献者":["7.6"],"入群交流":["7.7"],"安装":["8.0"],"在npm项目下使用":["8.1"],"全部引入":["8.2"],"按需引入":["8.3"],"在html单页面下使用":["8.4"],"项目计划":["9.0"],"提示":["11.0"]},{"0":["5.1","5.2","5.3","5.4","5.5","5.6","5.7","5.8"],"山奈提供了一些常用的":["0.0"],"localcookie":["0.2"],"js":["0.3","1.3","3.3","3.7","3.11","3.15","3.19","3.23","4.3","8.2","8.3"],"cookie":["0.5","0.6","0.7","0.8"],"山奈提供了一些有关设备操作的api":["1.0"],"检查当前设备的各种类型":["1.2"],"输入的参数如下":["1.4"],"type":["1.4"],"要检查的类型":["1.4"],"此参数为一个数组":["1.4"],"默认为":["1.4"],"browser":["1.4"],"在本站的api信息栏目中":["2.0"],"山奈提供了一些字符串处理的函数":["3.0"],"判断字符串是否为空":["3.2"],"code":["3.4","3.8","3.12","3.24","8.1"],"判断字符串是否不为空":["3.6"],"获取字符串的长度":["3.10"],"将字节格式化为":["3.14"],"输入参数":["3.16","3.20"],"bytes":["3.16"],"字节数":["3.16"],"一个json对象":["3.16","3.20"],"可选":["3.16","3.20"],"检查密码强度的函数":["3.18"],"password":["3.20"],"密码":["3.20"],"有以下内容":["3.20"],"minlength":["3.20"],"密码最小长度":["3.20"],"默认为8":["3.20"],"检查邮箱格式的函数":["3.22"],"group":["3.24"],"山奈提供了一些方便的方法来处理":["4.0"],"url":["4.2","4.5","4.6","4.7"],"获取":["4.5","4.6","4.7"],"我们使用":["6.0"],"yarn":["6.0"],"作为包管理工具":["6.0"],"请先安装":["6.0"],"warning":["7.0"],"山奈":["7.1"],"galanga":["7.1"],"以下简称山奈":["7.1"],"相比其他的函数库":["7.2"],"单元测试保证支持如下环境":["7.3"],"ie":["7.3"],"vpteammembers":["7.5"],"请在github上或者gitee上查看贡献者名单":["7.6"],"为了方便各位开发者的交流":["7.7"],"在npm项目下":["8.1"],"您可以通过以下命令安装山奈":["8.1"],"在html单页面下":["8.4"],"您可以在官方仓库内下载山奈的打包产物":["8.4"],"然后引入至您的html文件中":["8.4"],"这里列出会在未来添加的新功能":["9.0"],"这是一个基于":["11.0"]},{"22":["5.4"],"24":["5.2"],"是一个对象":["0.2"],"import":["0.3","1.3","3.3","3.7","3.11","3.15","3.19","3.23","4.3","8.2","8.3"],"的值":["0.5","0.6"],"如果":["0.5","0.6"],"code":["0.7"],"清空所有":["0.8"],"可用来获取设备的信息":["1.0"],"包括浏览器类型":["1.2"],"device":["1.4"],"os":["1.4"],"可选值为":["1.4"],"您可以查看您所需要的api的详细信息":["2.0"],"用于处理字符串":["3.0"],"如果字符串为空":["3.2","3.10"],"group":["3.4","3.8","3.12","8.1"],"js":["3.4","3.8","3.12","3.24","8.4"],"非空":["3.6"],"如果字符串不为空":["3.6"],"b":["3.14"],"有以下内容":["3.16"],"decimals":["3.16"],"保留的小数位数":["3.16"],"默认为1":["3.16"],"from":["3.16"],"输入的字节单位":["3.16"],"如果符合要求":["3.18","3.22"],"maxlength":["3.20"],"密码最大长度":["3.20"],"默认为16":["3.20"],"types":["3.20"],"字符类型":["3.20"],"分别为数字":["3.20"],"小写字母":["3.20"],"大写字母":["3.20"],"特殊字符":["3.20"],"按需引入":["3.24"],"是一个用于处理":["4.2"],"参数的值":["4.5"],"如果参数不存在":["4.5"],"则返回":["4.5"],"的":["4.6"],"hash":["4.6"],"值":["4.6"],"的路径":["4.7"],"如果路径不存在":["4.7"],"bash":["6.0","8.1"],"npm":["6.0"],"install":["6.0"],"g":["6.0"],"安装依赖":["6.0"],"本项目仍处于开发阶段":["7.0"],"是川菜中常用的调味品":["7.1"],"也可以用作腌制成为单独的菜品":["7.1"],"而这一辅料被人们俗称为姜":["7.1"],"山奈希望提供在业务中常用的一些函数":["7.2"],"ch":["7.3"],"ff":["7.3"],"sf":["7.3"],"size":["7.5"],"如果您也想对山奈做出贡献":["7.6"],"我们在各大平台都开设了有关山奈的交流群":["7.7"],"欢迎大家加入":["7.7"],"yarn":["8.1"],"例如您将山奈的打包产物放在":["8.4"],"galanga":["8.4"],"目录下":["8.4"],"和已经完成的功能":["9.0"],"vitepress":["11.0"]},{"1":["5.8"],"4":["5.2","5.4"],"19":["5.7"],"20":["5.6"],"21":["5.5"],"23":["5.3"],"25":["5.1"],"2023":["5.1","5.2","5.3","5.4","5.5","5.6","5.7"],"操作函数":["0.0"],"包含了一些常用的":["0.2"],"cookie":["0.2"],"localcookie":["0.3"],"不存在":["0.5","0.6","4.6"],"则返回":["0.5","3.2","3.6","3.10","3.18","3.22","4.7"],"则创建":["0.6"],"group":["0.7","0.8","3.16"],"js":["0.7"],"code":["0.8","3.16","4.5","4.7"],"或者进行一些操作":["1.0"],"设备类型":["1.2","1.4"],"checkdevicetype":["1.3"],"分别表示浏览器类型":["1.4"],"系统类型":["1.4"],"return":["1.4"],"string":["1.4"],"是否返回字符串":["1.4"],"请注意的是":["2.0"],"checknull":["3.3"],"按需引入":["3.4","3.8","3.12"],"true":["3.6"],"checknotnull":["3.7"],"strlength":["3.11"],"kb":["3.14"],"mb":["3.14"],"formatbytes":["3.15"],"默认为b":["3.16"],"to":["3.16"],"输出的字节单位":["3.16"],"checkpassword":["3.19"],"默认为":["3.20"],"number":["3.20"],"lowercase":["3.20"],"uppercase":["3.20"],"special":["3.20"],"mintypes":["3.20"],"最少包含的字符类型":["3.20"],"默认为2":["3.20"],"maxtypes":["3.20"],"checkemail":["3.23","3.24"],"info":["3.24"],"url":["4.3"],"null":["4.5","4.7"],"如果":["4.6"],"一键打包生成生产代码":["6.0"],"api可能会发生变化":["7.0"],"在web的世界里":["7.1"],"它是一个开源的实用的js函数库":["7.1"],"它的目标是提供一些常用的函数":["7.1"],"让你的代码更简洁更易读":["7.1"],"而山奈也是基于typescript开发的":["7.2"],"op":["7.3"],"ios":["7.3"],"android":["7.3"],"small":["7.5"],"请参考贡献指南":["7.6"],"qq":["7.7"],"add":["8.1"],"galanga":["8.1","8.2"],"from":["8.2","8.3"],"name":["8.3"],"您可以通过以下方式引入山奈":["8.4"],"html":["8.4"],"当然":["8.4"],"x":["9.0"],"的文档站点":["11.0"]},{"0":["3.10"],"1":["3.16"],"3":["5.5","5.6","5.7"],"4":["5.1","5.3"],"6":["7.3"],"7":["5.4"],"18":["5.2"],"29":["7.3"],"2023":["5.8"],"346363551":["7.7"],"包括获取":["0.0"],"操作函数":["0.2"],"from":["0.3","1.3","3.3","3.7","3.11","3.15","3.19","3.23","4.3"],"null":["0.5","4.6"],"code":["0.5","0.6","3.20","4.6"],"group":["0.5","0.6","3.20","4.5","4.7"],"js":["0.6","0.8","3.16","3.20","4.5","4.7"],"按需引入":["0.7","0.8","3.16","3.20","4.5"],"localcookie":["0.7"],"系统类型":["1.2"],"false":["1.4"],"如果为":["1.4"],"true":["1.4","3.2","3.18","3.22"],"并且数组的只有一个值":["1.4"],"则返回字符串":["1.4"],"在这里演示的所有api均以es6的语法为基础":["2.0"],"checknull":["3.4"],"name":["3.4","3.8","3.12"],"否则返回":["3.6"],"checknotnull":["3.8"],"strlength":["3.12"],"gb":["3.14"],"const":["3.16","3.20"],"json":["3.16","3.20"],"最多包含的字符类型":["3.20"],"默认为4":["3.20"],"sancerain":["3.24"],"com":["3.24"],"的函数":["4.2"],"则返回":["4.6"],"新增了":["5.2"],"run":["6.0"],"build":["6.0"],"运行单元测试":["6.0"],"test":["6.0"],"请勿用于生产环境":["7.0"],"我们希望利用姜来让您的代码更加美味":["7.1"],"让您更加专注于业务逻辑的实现":["7.1"],"使用es6":["7.1"],"因此在使用时":["7.2"],"node":["7.3"],"members":["7.5"],"以下是山奈的贡献者名单头像缩略图":["7.6"],"钉钉":["7.7"],"npm":["8.1"],"install":["8.1"],"galanga":["8.3"],"您也可以引入山奈的cdn链接":["8.4"],"引入完成后":["8.4"],"您可以在项目中使用全部功能":["8.4"],"已完成":["9.0"],"您也可以直接在这里浏览文档源文件":["11.0"]},{"2":["3.20","5.8"],"8":["3.20"],"9":["7.3"],"15":["5.3"],"16":["3.20"],"19":["5.6"],"22":["5.1","5.5"],"50":["7.3"],"55":["7.3"],"1024":["3.16"],"设置":["0.0","0.2"],"删除":["0.0"],"包括获取":["0.2"],"galanga":["0.3","1.3","3.3","3.7","3.11","3.15","3.19","3.23","4.3"],"js":["0.5","4.6"],"按需引入":["0.5","0.6","4.6","4.7"],"localcookie":["0.5","0.6","0.8"],"setitem":["0.6"],"name":["0.6","0.7","4.5"],"removeitem":["0.7"],"clear":["0.8"],"否则返回一个对象":["1.4"],"默认情况下":["1.4"],"返回的是一个对象":["1.4"],"包含了浏览器类型":["1.4"],"如果您使用的是其他类型的语法或者安装方法":["2.0"],"否则返回":["3.2","3.18","3.22"],"全局引入":["3.4","3.8","3.12","3.24"],"false":["3.6"],"此函数会反义":["3.6"],"tb":["3.14"],"pb":["3.14"],"b":["3.16"],"kb":["3.16"],"formatbytes":["3.16"],"它提供了一些方便的方法来处理":["4.2"],"getquery":["4.5"],"group":["4.6"],"checknull":["5.1"],"checknotnull":["5.2"],"函数":["5.2"],"对函数":["5.3"],"新增了":["5.4","5.5","5.6"],"checkdevicetype":["5.4"],"注意":["6.0"],"浏览器环境需要手动测试":["6.0"],"位于":["6.0"],"browser":["6.0"],"修改":["6.0"],"和typescript编写源码":["7.1"],"编译生成生产代码":["7.1"],"多环境支持":["7.1"],"您可以获得更好的类型提示":["7.2"],"贡献者名单":["7.6"],"山奈galanga开源js函数库交流群":["7.7"],"telegram":["7.7"],"pnpm":["8.1"],"console":["8.2","8.3","8.4"],"log":["8.3","8.4"],"目前暂不支持将部分函数单独引入至项目内":["8.4"],"未完成":["9.0"]},{"4":["3.20","7.3"],"12345678":["3.20"],"删除":["0.2"],"getitem":["0.5"],"name":["0.5","8.4"],"value":["0.6"],"全局引入":["0.6","0.7","0.8","3.16","3.20","4.5","4.7"],"galanga":["0.7","3.4","3.8","3.12","3.24"],"如下":["1.4"],"js":["1.4"],"chrome":["1.4"],"pc":["1.4"],"您需要自行转换":["2.0"],"false":["3.2","3.18","3.22"],"checknull":["3.6"],"函数":["3.6","5.4"],"eb":["3.14"],"var":["3.16","3.20"],"checkpassword":["3.20","5.6"],"gethash":["4.6"],"getpath":["4.7"],"和":["5.1"],"用于检查字符串是否不为空":["5.2"],"此函数会反义":["5.2"],"checkdevicetype":["5.3"],"用于检查设备类型":["5.4"],"checkemail":["5.5"],"修复了":["5.7"],"formatbytes":["5.7"],"package":["6.0"],"json":["6.0"],"中的版本号":["6.0"],"readme":["6.0"],"支持浏览器原生":["7.1"],"支持amd":["7.1"],"cmd":["7.1"],"支持webpack":["7.1"],"censujiang":["7.7"],"log":["8.2"],"我们更推荐使用npm项目的方式引入山奈":["8.4"]},{"等":["0.0","0.2"],"全局引入":["0.5","4.6"],"galanga":["0.5","0.6","0.8","4.5","4.6","4.7"],"windows":["1.4"],"code":["1.4"],"group":["1.4","7.7"],"按需引入":["1.4"],"这也是为了业务逻辑的统一":["3.6"],"方便使用":["3.6"],"zb":["3.14"],"yb":["3.14"],"checknotnull":["5.1"],"函数现在可以检查数字类型的参数是否为nan了":["5.1"],"checknull":["5.2"],"进行了优化":["5.3"],"现在可以更好的检测设备类型":["5.3"],"此函数不稳定":["5.4"],"可能会在后续版本中修改":["5.4"],"函数":["5.5","5.6"],"用于检查邮箱格式":["5.5"],"用于检查密码强度":["5.6"],"函数的两个bug":["5.7"],"项目发布测试版本":["5.8"],"md":["6.0"],"changelog":["6.0"],"然后发布新版":["6.0"],"rollup":["7.1"],"fis等":["7.1"],"支持node":["7.1"],"注意":["7.3"],"编译代码依赖es5环境":["7.3"],"对于ie6":["7.3"],"微信":["7.7"],"cnpm":["8.1"],"name":["8.2"],"我们在后文的使用示例中":["8.3"],"基本上都是使用这种方式引入山奈的":["8.3"],"因为这样不仅可以更好地管理依赖":["8.4"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["8.4"],"在查看后文的使用示例时":["8.4"],"请使用":["8.4"]},{"checkdevicetype":["1.4"],"全局引入":["1.4"],"galanga":["1.4","3.16","3.20"],"方便使用":["5.2"],"release":["6.0"],"无依赖":["7.1"],"体积小巧":["7.1"],"8需要引入es5":["7.3"],"shim才可以兼容":["7.3"],"微信群":["7.7"],"安装完成后":["8.1"],"您可以在项目中引入山奈并使用对应的功能":["8.1"],"作为全局变量后再加具体的功能函数名":["8.4"]}]'},e={"0.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"0.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"0.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"0.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"0.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"0.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"0.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
::: code-group
localCoo ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"0.7":{t:"删除-cookie",p:`删除 Cookie。
::: code-group
localCookie.removeItem('name')

gala ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"0.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"1.0":{t:"device",p:`山奈提供了一些有关设备操作的API，可用来获取设备的信息，或者进行一些操作。
`,l:"api/device.html",a:"device"},"1.1":{t:"checkdevicetype",p:"\r",l:"api/device.html#checkdevicetype",a:"checkdevicetype"},"1.2":{t:"介绍",p:`检查当前设备的各种类型，包括浏览器类型、设备类型、系统类型
`,l:"api/device.html#介绍",a:"介绍"},"1.3":{t:"导入",p:`import { checkDeviceType } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"1.4":{t:"使用",p:`输入的参数如下：


type：要检查的类型，此参数为一个数组，默认为['browser', 'device', 'os'] ...`,l:"api/device.html#使用",a:"使用"},"2.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"3.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"3.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"3.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"3.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"3.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"3.5":{t:"checknotnull",p:"\r",l:"api/string.html#checknotnull",a:"checknotnull"},"3.6":{t:"介绍",p:"判断字符串是否不为空（非空），如果字符串不为空，则返回 true，否则返回 false。此函数会反义 checkNull 函 ...",l:"api/string.html#介绍",a:"介绍"},"3.7":{t:"导入",p:`import { checkNotNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"3.8":{t:"使用",p:`::: code-group
checkNotNull(name)

galanga.checkNotNull(name)
 ...`,l:"api/string.html#使用",a:"使用"},"3.9":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"3.10":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"3.11":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"3.12":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"3.13":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"3.14":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"3.15":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"3.16":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"3.17":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"3.18":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"3.19":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"3.20":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"3.21":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"3.22":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"3.23":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"3.24":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"4.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"4.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"4.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"4.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"4.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"4.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"4.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"4.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
::: code-group
url.getPath()

gal ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"5.0":{t:"更新日志",p:"\r",l:"guide/changelog.html",a:"更新日志"},"5.1":{t:"_0-0-25-2023-4-22",p:`
checkNull和checkNotNull函数现在可以检查数字类型的参数是否为NaN了。

`,l:"guide/changelog.html#_0-0-25-2023-4-22",a:"_0-0-25-2023-4-22"},"5.2":{t:"_0-0-24-2023-4-18",p:`
新增了 checkNotNull 函数，用于检查字符串是否不为空，此函数会反义 checkNull 函数，方便使用。

`,l:"guide/changelog.html#_0-0-24-2023-4-18",a:"_0-0-24-2023-4-18"},"5.3":{t:"_0-0-23-2023-4-15",p:`
对函数checkDeviceType进行了优化，现在可以更好的检测设备类型

`,l:"guide/changelog.html#_0-0-23-2023-4-15",a:"_0-0-23-2023-4-15"},"5.4":{t:"_0-0-22-2023-4-7",p:`
新增了 checkDeviceType 函数，用于检查设备类型，此函数不稳定，可能会在后续版本中修改

`,l:"guide/changelog.html#_0-0-22-2023-4-7",a:"_0-0-22-2023-4-7"},"5.5":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"5.6":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"5.7":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"5.8":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"6.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"7.0":{t:"入门",p:`::: warning
本项目仍处于开发阶段，API可能会发生变化，请勿用于生产环境。
:::
`,l:"guide/index.html",a:"入门"},"7.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"7.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"7.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"7.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"7.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"7.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"7.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"8.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"8.1":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"8.2":{t:"全部引入",p:`import galanga from 'galanga'

console.log(galanga.name)

`,l:"guide/install.html#全部引入",a:"全部引入"},"8.3":{t:"按需引入",p:`import { name } from 'galanga'

console.log(name)

我们在后文的使用示例中 ...`,l:"guide/install.html#按需引入",a:"按需引入"},"8.4":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"9.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"11.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},n={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},a={INDEX_DATA:l,PREVIEW_LOOKUP:e,Options:n};export{a as default};
