const e={map:'[{"array":["0.0"],"filteruniquebyproperty":["0.1"],"介绍":["0.2","2.2","4.2","4.6","4.10","4.14","4.18","4.22","5.2","10.2"],"导入":["0.3","1.3","2.3","4.3","4.7","4.11","4.15","4.19","4.23","5.3","10.3"],"使用":["0.4","1.4","2.4","4.4","4.8","4.12","4.16","4.20","4.24","5.4","10.4"],"cookie":["1.0"],"localcookie":["1.1"],"简介":["1.2"],"获取":["1.5"],"设置":["1.6"],"删除":["1.7"],"清空":["1.8"],"device":["2.0"],"checkdevicetype":["2.1"],"前言":["3.0"],"string":["4.0"],"checknull":["4.1"],"checknotnull":["4.5"],"strlength":["4.9"],"formatbytes":["4.13"],"checkpassword":["4.17"],"checkemail":["4.21"],"url":["5.0","5.1"],"获取url的参数":["5.5"],"获取url的hash":["5.6"],"获取url的路径":["5.7"],"更新日志":["6.0"],"贡献指南":["7.0"],"入门":["8.0"],"项目简介":["8.1"],"使用理由":["8.2"],"兼容性":["8.3"],"开发人员":["8.4"],"负责人":["8.5"],"贡献者":["8.6"],"入群交流":["8.7"],"安装":["9.0"],"在npm项目下使用":["9.1"],"全部引入":["9.2"],"按需引入":["9.3"],"在html单页面下使用":["9.4"],"object":["10.0"],"updateobjectfromimport":["10.1"],"项目计划":["11.0"],"提示":["13.0"]},{"0":["6.1","6.2","6.3","6.4","6.5","6.6","6.7","6.8","6.9","6.10"],"山奈提供了一些数组的操作方法":["0.0"],"根据数组中对象的某个属性去重":["0.2"],"js":["0.3","1.3","2.3","4.3","4.7","4.11","4.15","4.19","4.23","5.3","9.2","9.3","10.3"],"输入的参数如下":["0.4","2.4","10.4"],"array":["0.4"],"山奈提供了一些常用的":["1.0"],"localcookie":["1.2"],"cookie":["1.5","1.6","1.7","1.8"],"山奈提供了一些有关设备操作的api":["2.0"],"检查当前设备的各种类型":["2.2"],"type":["2.4"],"要检查的类型":["2.4"],"此参数为一个数组":["2.4"],"默认为":["2.4"],"browser":["2.4"],"在本站的api信息栏目中":["3.0"],"山奈提供了一些字符串处理的函数":["4.0"],"判断字符串是否为空":["4.2"],"code":["4.4","4.8","4.12","4.24","9.1"],"判断字符串是否不为空":["4.6"],"获取字符串的长度":["4.10"],"将字节格式化为":["4.14"],"输入参数":["4.16","4.20"],"bytes":["4.16"],"字节数":["4.16"],"一个json对象":["4.16","4.20"],"可选":["4.16","4.20"],"检查密码强度的函数":["4.18"],"password":["4.20"],"密码":["4.20"],"有以下内容":["4.20"],"minlength":["4.20"],"密码最小长度":["4.20"],"默认为8":["4.20"],"检查邮箱格式的函数":["4.22"],"group":["4.24"],"山奈提供了一些方便的方法来处理":["5.0"],"url":["5.2","5.5","5.6","5.7"],"获取":["5.5","5.6","5.7"],"我们使用":["7.0"],"yarn":["7.0"],"作为包管理工具":["7.0"],"请先安装":["7.0"],"warning":["8.0"],"山奈":["8.1"],"galanga":["8.1"],"以下简称山奈":["8.1"],"相比其他的函数库":["8.2"],"单元测试保证支持如下环境":["8.3"],"ie":["8.3"],"vpteammembers":["8.5"],"请在github上或者gitee上查看贡献者名单":["8.6"],"为了方便各位开发者的交流":["8.7"],"在npm项目下":["9.1"],"您可以通过以下命令安装山奈":["9.1"],"在html单页面下":["9.4"],"您可以在官方仓库内下载山奈的打包产物":["9.4"],"然后引入至您的html文件中":["9.4"],"山奈提供了一些有关对象的方法":["10.0"],"将新的object中的值动态更新到原有的object中":["10.2"],"importobject":["10.4"],"object":["10.4"],"这里列出会在未来添加的新功能":["11.0"],"这是一个基于":["13.0"]},{"22":["6.6"],"24":["6.4"],"26":["6.2"],"27":["6.1"],"可以帮助您更好的操作数组":["0.0"],"将length大的数组保留":["0.2"],"import":["0.3","1.3","2.3","4.3","4.7","4.11","4.15","4.19","4.23","5.3","9.2","9.3","10.3"],"数组":["0.4"],"property":["0.4"],"是一个对象":["1.2"],"的值":["1.5","1.6"],"如果":["1.5","1.6"],"code":["1.7"],"清空所有":["1.8"],"可用来获取设备的信息":["2.0"],"包括浏览器类型":["2.2"],"device":["2.4"],"os":["2.4"],"可选值为":["2.4"],"您可以查看您所需要的api的详细信息":["3.0"],"用于处理字符串":["4.0"],"如果字符串为空":["4.2","4.10"],"group":["4.4","4.8","4.12","9.1"],"js":["4.4","4.8","4.12","4.24","9.4"],"非空":["4.6"],"如果字符串不为空":["4.6"],"b":["4.14"],"有以下内容":["4.16"],"decimals":["4.16"],"保留的小数位数":["4.16"],"默认为1":["4.16"],"from":["4.16"],"输入的字节单位":["4.16"],"如果符合要求":["4.18","4.22"],"maxlength":["4.20"],"密码最大长度":["4.20"],"默认为16":["4.20"],"types":["4.20"],"字符类型":["4.20"],"分别为数字":["4.20"],"小写字母":["4.20"],"大写字母":["4.20"],"特殊字符":["4.20"],"按需引入":["4.24"],"是一个用于处理":["5.2"],"参数的值":["5.5"],"如果参数不存在":["5.5"],"则返回":["5.5"],"的":["5.6"],"hash":["5.6"],"值":["5.6"],"的路径":["5.7"],"如果路径不存在":["5.7"],"bash":["7.0","9.1"],"npm":["7.0"],"install":["7.0"],"g":["7.0"],"安装依赖":["7.0"],"本项目仍处于开发阶段":["8.0"],"是川菜中常用的调味品":["8.1"],"也可以用作腌制成为单独的菜品":["8.1"],"而这一辅料被人们俗称为姜":["8.1"],"山奈希望提供在业务中常用的一些函数":["8.2"],"ch":["8.3"],"ff":["8.3"],"sf":["8.3"],"size":["8.5"],"如果您也想对山奈做出贡献":["8.6"],"我们在各大平台都开设了有关山奈的交流群":["8.7"],"欢迎大家加入":["8.7"],"yarn":["9.1"],"例如您将山奈的打包产物放在":["9.4"],"galanga":["9.4"],"目录下":["9.4"],"这些方法可以帮助您更好地使用对象":["10.0"],"并不影响原有object中的结构":["10.2"],"新的object":["10.4"],"用于更新原有的object":["10.4"],"和已经完成的功能":["11.0"],"vitepress":["13.0"]},{"1":["6.10"],"4":["6.4","6.6"],"5":["6.1"],"19":["6.9"],"20":["6.8"],"21":["6.7"],"23":["6.5"],"25":["6.3"],"2023":["6.1","6.2","6.3","6.4","6.5","6.6","6.7","6.8","6.9"],"length小的数组去掉":["0.2"],"filteruniquebyproperty":["0.3"],"string":["0.4","2.4"],"对象的属性":["0.4"],"code":["0.4","1.8","4.16","5.5","5.7","10.4"],"操作函数":["1.0"],"包含了一些常用的":["1.2"],"cookie":["1.2"],"localcookie":["1.3"],"不存在":["1.5","1.6","5.6"],"则返回":["1.5","4.2","4.6","4.10","4.18","4.22","5.7"],"则创建":["1.6"],"group":["1.7","1.8","4.16"],"js":["1.7"],"或者进行一些操作":["2.0"],"设备类型":["2.2","2.4"],"checkdevicetype":["2.3"],"分别表示浏览器类型":["2.4"],"系统类型":["2.4"],"return":["2.4"],"是否返回字符串":["2.4"],"请注意的是":["3.0"],"checknull":["4.3"],"按需引入":["4.4","4.8","4.12"],"true":["4.6"],"checknotnull":["4.7"],"strlength":["4.11"],"kb":["4.14"],"mb":["4.14"],"formatbytes":["4.15"],"默认为b":["4.16"],"to":["4.16"],"输出的字节单位":["4.16"],"checkpassword":["4.19"],"默认为":["4.20"],"number":["4.20"],"lowercase":["4.20"],"uppercase":["4.20"],"special":["4.20"],"mintypes":["4.20"],"最少包含的字符类型":["4.20"],"默认为2":["4.20"],"maxtypes":["4.20"],"checkemail":["4.23","4.24"],"info":["4.24"],"url":["5.3"],"null":["5.5","5.7"],"如果":["5.6"],"一键打包生成生产代码":["7.0"],"api可能会发生变化":["8.0"],"在web的世界里":["8.1"],"它是一个开源的实用的js函数库":["8.1"],"它的目标是提供一些常用的函数":["8.1"],"让你的代码更简洁更易读":["8.1"],"而山奈也是基于typescript开发的":["8.2"],"op":["8.3"],"ios":["8.3"],"android":["8.3"],"small":["8.5"],"请参考贡献指南":["8.6"],"qq":["8.7"],"add":["9.1"],"galanga":["9.1","9.2"],"from":["9.2","9.3"],"name":["9.3"],"您可以通过以下方式引入山奈":["9.4"],"html":["9.4"],"当然":["9.4"],"updateobjectfromimport":["10.3"],"原有的object":["10.4"],"x":["11.0"],"的文档站点":["13.0"]},{"0":["4.10"],"1":["4.16"],"3":["6.7","6.8","6.9"],"4":["6.3","6.5"],"5":["6.2"],"6":["8.3"],"7":["6.6"],"9":["6.1","6.2"],"18":["6.4"],"29":["8.3"],"2023":["6.10"],"346363551":["8.7"],"from":["0.3","1.3","2.3","4.3","4.7","4.11","4.15","4.19","4.23","5.3","10.3"],"group":["0.4","1.5","1.6","4.20","5.5","5.7","10.4"],"js":["0.4","1.6","1.8","4.16","4.20","5.5","5.7","10.4"],"按需引入":["0.4","1.7","1.8","4.16","4.20","5.5","10.4"],"包括获取":["1.0"],"操作函数":["1.2"],"null":["1.5","5.6"],"code":["1.5","1.6","4.20","5.6"],"localcookie":["1.7"],"系统类型":["2.2"],"false":["2.4"],"如果为":["2.4"],"true":["2.4","4.2","4.18","4.22"],"并且数组的只有一个值":["2.4"],"则返回字符串":["2.4"],"在这里演示的所有api均以es6的语法为基础":["3.0"],"checknull":["4.4"],"name":["4.4","4.8","4.12"],"否则返回":["4.6"],"checknotnull":["4.8"],"strlength":["4.12"],"gb":["4.14"],"const":["4.16","4.20"],"json":["4.16","4.20"],"最多包含的字符类型":["4.20"],"默认为4":["4.20"],"sancerain":["4.24"],"com":["4.24"],"的函数":["5.2"],"则返回":["5.6"],"新增了":["6.4"],"run":["7.0"],"build":["7.0"],"运行单元测试":["7.0"],"test":["7.0"],"请勿用于生产环境":["8.0"],"我们希望利用姜来让您的代码更加美味":["8.1"],"让您更加专注于业务逻辑的实现":["8.1"],"使用es6":["8.1"],"因此在使用时":["8.2"],"node":["8.3"],"members":["8.5"],"以下是山奈的贡献者名单头像缩略图":["8.6"],"钉钉":["8.7"],"npm":["9.1"],"install":["9.1"],"galanga":["9.3"],"您也可以引入山奈的cdn链接":["9.4"],"引入完成后":["9.4"],"您可以在项目中使用全部功能":["9.4"],"已完成":["11.0"],"您也可以直接在这里浏览文档源文件":["13.0"]},{"2":["4.20","6.10"],"8":["4.20"],"9":["8.3"],"15":["6.5"],"16":["4.20"],"19":["6.8"],"22":["6.3","6.7"],"50":["8.3"],"55":["8.3"],"1024":["4.16"],"galanga":["0.3","1.3","2.3","4.3","4.7","4.11","4.15","4.19","4.23","5.3","10.3"],"filteruniquebyproperty":["0.4","6.1"],"设置":["1.0","1.2"],"删除":["1.0"],"包括获取":["1.2"],"js":["1.5","5.6"],"按需引入":["1.5","1.6","5.6","5.7"],"localcookie":["1.5","1.6","1.8"],"setitem":["1.6"],"name":["1.6","1.7","5.5"],"removeitem":["1.7"],"clear":["1.8"],"否则返回一个对象":["2.4"],"默认情况下":["2.4"],"返回的是一个对象":["2.4"],"包含了浏览器类型":["2.4"],"如果您使用的是其他类型的语法或者安装方法":["3.0"],"否则返回":["4.2","4.18","4.22"],"全局引入":["4.4","4.8","4.12","4.24"],"false":["4.6"],"此函数会反义":["4.6"],"tb":["4.14"],"pb":["4.14"],"b":["4.16"],"kb":["4.16"],"formatbytes":["4.16"],"它提供了一些方便的方法来处理":["5.2"],"getquery":["5.5"],"group":["5.6"],"新增了":["6.1","6.2","6.6","6.7","6.8"],"updateobjectfromimport":["6.2","10.4"],"checknull":["6.3"],"checknotnull":["6.4"],"函数":["6.4"],"对函数":["6.5"],"checkdevicetype":["6.6"],"注意":["7.0"],"浏览器环境需要手动测试":["7.0"],"位于":["7.0"],"browser":["7.0"],"修改":["7.0"],"和typescript编写源码":["8.1"],"编译生成生产代码":["8.1"],"多环境支持":["8.1"],"您可以获得更好的类型提示":["8.2"],"贡献者名单":["8.6"],"山奈galanga开源js函数库交流群":["8.7"],"telegram":["8.7"],"pnpm":["9.1"],"console":["9.2","9.3","9.4"],"log":["9.3","9.4"],"目前暂不支持将部分函数单独引入至项目内":["9.4"],"未完成":["11.0"]},{"4":["4.20","8.3"],"12345678":["4.20"],"id":["0.4"],"全局引入":["0.4","1.6","1.7","1.8","4.16","4.20","5.5","5.7","10.4"],"删除":["1.2"],"getitem":["1.5"],"name":["1.5","9.4"],"value":["1.6"],"galanga":["1.7","4.4","4.8","4.12","4.24"],"如下":["2.4"],"js":["2.4"],"chrome":["2.4"],"pc":["2.4"],"您需要自行转换":["3.0"],"false":["4.2","4.18","4.22"],"checknull":["4.6"],"函数":["4.6","6.1","6.2","6.6"],"eb":["4.14"],"var":["4.16","4.20"],"checkpassword":["4.20","6.8"],"gethash":["5.6"],"getpath":["5.7"],"用于根据数组中对象的某个属性去重":["6.1"],"和":["6.3"],"用于检查字符串是否不为空":["6.4"],"此函数会反义":["6.4"],"checkdevicetype":["6.5"],"用于检查设备类型":["6.6"],"checkemail":["6.7"],"修复了":["6.9"],"formatbytes":["6.9"],"package":["7.0"],"json":["7.0"],"中的版本号":["7.0"],"readme":["7.0"],"支持浏览器原生":["8.1"],"支持amd":["8.1"],"cmd":["8.1"],"支持webpack":["8.1"],"censujiang":["8.7"],"log":["9.2"],"我们更推荐使用npm项目的方式引入山奈":["9.4"]},{"galanga":["0.4","1.5","1.6","1.8","5.5","5.6","5.7","10.4"],"等":["1.0","1.2"],"全局引入":["1.5","5.6"],"windows":["2.4"],"code":["2.4"],"group":["2.4","8.7"],"按需引入":["2.4"],"这也是为了业务逻辑的统一":["4.6"],"方便使用":["4.6"],"zb":["4.14"],"yb":["4.14"],"将length大的数组保留":["6.1"],"length小的数组去掉":["6.1"],"用于将新的object中的值动态更新到原有的object中":["6.2"],"并不影响原有object中的结构":["6.2"],"checknotnull":["6.3"],"函数现在可以检查数字类型的参数是否为nan了":["6.3"],"checknull":["6.4"],"进行了优化":["6.5"],"现在可以更好的检测设备类型":["6.5"],"此函数不稳定":["6.6"],"可能会在后续版本中修改":["6.6"],"函数":["6.7","6.8"],"用于检查邮箱格式":["6.7"],"用于检查密码强度":["6.8"],"函数的两个bug":["6.9"],"项目发布测试版本":["6.10"],"md":["7.0"],"changelog":["7.0"],"然后发布新版":["7.0"],"rollup":["8.1"],"fis等":["8.1"],"支持node":["8.1"],"注意":["8.3"],"编译代码依赖es5环境":["8.3"],"对于ie6":["8.3"],"微信":["8.7"],"cnpm":["9.1"],"name":["9.2"],"我们在后文的使用示例中":["9.3"],"基本上都是使用这种方式引入山奈的":["9.3"],"因为这样不仅可以更好地管理依赖":["9.4"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["9.4"],"在查看后文的使用示例时":["9.4"],"请使用":["9.4"]},{"checkdevicetype":["2.4"],"全局引入":["2.4"],"galanga":["2.4","4.16","4.20"],"方便使用":["6.4"],"release":["7.0"],"无依赖":["8.1"],"体积小巧":["8.1"],"8需要引入es5":["8.3"],"shim才可以兼容":["8.3"],"微信群":["8.7"],"安装完成后":["9.1"],"您可以在项目中引入山奈并使用对应的功能":["9.1"],"作为全局变量后再加具体的功能函数名":["9.4"]}]'},l={"0.0":{t:"array",p:`山奈提供了一些数组的操作方法，可以帮助您更好的操作数组。
`,l:"api/array.html",a:"array"},"0.1":{t:"filteruniquebyproperty",p:"\r",l:"api/array.html#filteruniquebyproperty",a:"filteruniquebyproperty"},"0.2":{t:"介绍",p:`根据数组中对象的某个属性去重，将length大的数组保留，length小的数组去掉。
`,l:"api/array.html#介绍",a:"介绍"},"0.3":{t:"导入",p:`import { filterUniqueByProperty } from 'galanga'

`,l:"api/array.html#导入",a:"导入"},"0.4":{t:"使用",p:`输入的参数如下：

array[array]: 数组
property[string]: 对象的属性

::: code-g ...`,l:"api/array.html#使用",a:"使用"},"1.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"1.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"1.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"1.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"1.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"1.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"1.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
::: code-group
localCoo ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"1.7":{t:"删除-cookie",p:`删除 Cookie。
::: code-group
localCookie.removeItem('name')

gala ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"1.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"2.0":{t:"device",p:`山奈提供了一些有关设备操作的API，可用来获取设备的信息，或者进行一些操作。
`,l:"api/device.html",a:"device"},"2.1":{t:"checkdevicetype",p:"\r",l:"api/device.html#checkdevicetype",a:"checkdevicetype"},"2.2":{t:"介绍",p:`检查当前设备的各种类型，包括浏览器类型、设备类型、系统类型
`,l:"api/device.html#介绍",a:"介绍"},"2.3":{t:"导入",p:`import { checkDeviceType } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"2.4":{t:"使用",p:`输入的参数如下：


type：要检查的类型，此参数为一个数组，默认为['browser', 'device', 'os'] ...`,l:"api/device.html#使用",a:"使用"},"3.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"4.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"4.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"4.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"4.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"4.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"4.5":{t:"checknotnull",p:"\r",l:"api/string.html#checknotnull",a:"checknotnull"},"4.6":{t:"介绍",p:"判断字符串是否不为空（非空），如果字符串不为空，则返回 true，否则返回 false。此函数会反义 checkNull 函 ...",l:"api/string.html#介绍",a:"介绍"},"4.7":{t:"导入",p:`import { checkNotNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"4.8":{t:"使用",p:`::: code-group
checkNotNull(name)

galanga.checkNotNull(name)
 ...`,l:"api/string.html#使用",a:"使用"},"4.9":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"4.10":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"4.11":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"4.12":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"4.13":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"4.14":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"4.15":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"4.16":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"4.17":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"4.18":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"4.19":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"4.20":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"4.21":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"4.22":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"4.23":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"4.24":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"5.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"5.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"5.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"5.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"5.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"5.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"5.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"5.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
::: code-group
url.getPath()

gal ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"6.0":{t:"更新日志",p:"\r",l:"guide/changelog.html",a:"更新日志"},"6.1":{t:"_0-0-27-2023-5-9",p:`
新增了filterUniqueByProperty函数，用于根据数组中对象的某个属性去重，将length大的数组保留，le ...`,l:"guide/changelog.html#_0-0-27-2023-5-9",a:"_0-0-27-2023-5-9"},"6.2":{t:"_0-0-26-2023-5-9",p:`
新增了updateObjectFromImport函数，用于将新的object中的值动态更新到原有的object中，并不影 ...`,l:"guide/changelog.html#_0-0-26-2023-5-9",a:"_0-0-26-2023-5-9"},"6.3":{t:"_0-0-25-2023-4-22",p:`
checkNull和checkNotNull函数现在可以检查数字类型的参数是否为NaN了。

`,l:"guide/changelog.html#_0-0-25-2023-4-22",a:"_0-0-25-2023-4-22"},"6.4":{t:"_0-0-24-2023-4-18",p:`
新增了 checkNotNull 函数，用于检查字符串是否不为空，此函数会反义 checkNull 函数，方便使用。

`,l:"guide/changelog.html#_0-0-24-2023-4-18",a:"_0-0-24-2023-4-18"},"6.5":{t:"_0-0-23-2023-4-15",p:`
对函数checkDeviceType进行了优化，现在可以更好的检测设备类型

`,l:"guide/changelog.html#_0-0-23-2023-4-15",a:"_0-0-23-2023-4-15"},"6.6":{t:"_0-0-22-2023-4-7",p:`
新增了 checkDeviceType 函数，用于检查设备类型，此函数不稳定，可能会在后续版本中修改

`,l:"guide/changelog.html#_0-0-22-2023-4-7",a:"_0-0-22-2023-4-7"},"6.7":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"6.8":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"6.9":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"6.10":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"7.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"8.0":{t:"入门",p:`::: warning
本项目仍处于开发阶段，API可能会发生变化，请勿用于生产环境。
:::
`,l:"guide/index.html",a:"入门"},"8.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"8.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"8.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"8.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"8.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"8.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"8.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"9.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"9.1":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"9.2":{t:"全部引入",p:`import galanga from 'galanga'

console.log(galanga.name)

`,l:"guide/install.html#全部引入",a:"全部引入"},"9.3":{t:"按需引入",p:`import { name } from 'galanga'

console.log(name)

我们在后文的使用示例中 ...`,l:"guide/install.html#按需引入",a:"按需引入"},"9.4":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"10.0":{t:"object",p:`山奈提供了一些有关对象的方法，这些方法可以帮助您更好地使用对象。
`,l:"guide/object.html",a:"object"},"10.1":{t:"updateobjectfromimport",p:"\r",l:"guide/object.html#updateobjectfromimport",a:"updateobjectfromimport"},"10.2":{t:"介绍",p:`将新的object中的值动态更新到原有的object中，并不影响原有object中的结构。
`,l:"guide/object.html#介绍",a:"介绍"},"10.3":{t:"导入",p:`import { updateObjectFromImport } from 'galanga'

`,l:"guide/object.html#导入",a:"导入"},"10.4":{t:"使用",p:`输入的参数如下：

importObject[object]: 新的object，用于更新原有的object
object[ ...`,l:"guide/object.html#使用",a:"使用"},"11.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"13.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},t={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},a={INDEX_DATA:e,PREVIEW_LOOKUP:l,Options:t};export{a as default};
