const e={map:'[{"array":["0.0"],"filteruniquebyproperty":["0.1"],"介绍":["0.2","2.2","3.2","3.7","5.2","6.2","6.6","7.2","7.6","7.10","8.2","8.6","8.10","8.14","8.18","8.22","9.2"],"导入":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","7.7","7.11","8.3","8.7","8.11","8.15","8.19","8.23","9.3","9.12"],"使用":["0.4","1.4","2.4","3.4","3.9","5.4","6.4","6.8","7.4","7.8","7.12","8.4","8.8","8.12","8.16","8.20","8.24","9.4","9.13"],"cookie":["1.0"],"localcookie":["1.1"],"简介":["1.2"],"获取":["1.5"],"设置":["1.6"],"删除":["1.7"],"清空":["1.8"],"date":["2.0"],"aftertime":["2.1"],"device":["3.0"],"checkdevicetype":["3.1"],"v0":["3.5","3.10"],"clipboard":["3.6"],"前言":["4.0"],"number":["5.0"],"formatnumber":["5.1"],"object":["6.0"],"updateobjectfromimport":["6.1"],"shakeobject":["6.5"],"permission":["7.0"],"notificationpermission":["7.1"],"clipboardpermission":["7.5"],"locationpermission":["7.9"],"string":["8.0"],"checknull":["8.1"],"checknotnull":["8.5"],"strlength":["8.9"],"formatbytes":["8.13"],"checkpassword":["8.17"],"checkemail":["8.21"],"url":["9.0","9.1"],"获取url的参数":["9.5"],"获取url的hash":["9.6"],"获取url的路径":["9.7"],"设置url的参数":["9.8"],"设置url的hash":["9.9"],"设置url的路径":["9.10"],"getpreurl":["9.11"],"更新日志":["10.0"],"贡献指南":["11.0"],"入门":["12.0"],"项目简介":["12.1"],"使用理由":["12.2"],"兼容性":["12.3"],"开发人员":["12.4"],"负责人":["12.5"],"贡献者":["12.6"],"入群交流":["12.7"],"安装":["13.0"],"主版本":["13.1"],"在npm项目下使用":["13.2","13.5"],"在html单页面下使用":["13.3"],"uni":["13.4"],"在":["13.6"],"项目计划":["14.0"],"提示":["16.0"]},{"0":["10.1","10.2","10.3","10.4","10.5","10.6","10.7","10.8","10.9","10.10","10.11","10.12","10.13","10.14","10.15","10.16","10.17","10.18","10.19","10.20"],"1":["3.5","3.10","10.2","10.3","10.4","10.5","10.10"],"6":["3.5"],"7":["3.10"],"8":["10.2"],"2023":["10.2"],"山奈提供了一些数组的操作方法":["0.0"],"根据数组中对象的某个属性去重":["0.2"],"js":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","7.7","7.11","8.3","8.7","8.11","8.15","8.19","8.23","9.3","9.12"],"输入的参数如下":["0.4","3.4","5.4","6.4","6.8"],"array":["0.4"],"山奈提供了一些常用的":["1.0"],"localcookie":["1.2"],"cookie":["1.5","1.6","1.7","1.8"],"的值":["1.6"],"如果":["1.6"],"山奈提供了一些时间处理的工具函数":["2.0"],"badge":["2.1","7.1","7.5","7.9"],"输出当前时间之后的时间":["2.2"],"输入参数如下":["2.4"],"必填":["2.4"],"time":["2.4"],"时间":["2.4"],"山奈提供了一些有关设备操作的api":["3.0"],"检查当前设备的各种类型":["3.2"],"type":["3.4"],"要检查的类型":["3.4"],"此参数为一个数组":["3.4"],"默认为":["3.4"],"browser":["3.4"],"device":["3.4"],"之前":["3.5","3.10"],"从":["3.5","3.10"],"一个用于读取和设置剪切板的函数组合":["3.7"],"一共有两个函数":["3.9"],"分别是":["3.9"],"read":["3.9"],"和":["3.9"],"write":["3.9"],"分别用于读取和设置剪切板":["3.9"],"async":["3.9","7.8","7.12"],"onlystring":["3.9"],"在本站的api信息栏目中":["4.0"],"山奈提供了一些数学函数":["5.0"],"格式化数字":["5.2"],"number":["5.4"],"山奈提供了一些有关对象的方法":["6.0"],"将新的object中的值动态更新到原有的object中":["6.2"],"importobject":["6.4"],"object":["6.4","6.8"],"新的object":["6.4"],"用于更新原有的object":["6.4"],"通过一个数组":["6.6"],"山奈提供了一些api用于您去获取或判断是否获取了一些浏览器权限":["7.0"],"这是一个函数集合":["7.2","7.6","7.10"],"此集合有两个子函数":["7.4","7.8","7.12"],"分别如下":["7.4","7.8","7.12"],"check":["7.4","7.8","7.12"],"用于判断是否获取了通知权限":["7.4"],"用于判断是否获取了剪贴板权限":["7.8"],"用于判断是否获取了地理位置权限":["7.12"],"山奈提供了一些字符串处理的函数":["8.0"],"判断字符串是否为空":["8.2"],"code":["8.4","8.8","8.12","8.24","9.13","13.2","13.5"],"判断字符串是否不为空":["8.6"],"获取字符串的长度":["8.10"],"将字节格式化为":["8.14"],"输入参数":["8.16","8.20"],"bytes":["8.16"],"字节数":["8.16"],"一个json对象":["8.16","8.20"],"可选":["8.16","8.20"],"检查密码强度的函数":["8.18"],"password":["8.20"],"密码":["8.20"],"有以下内容":["8.20"],"minlength":["8.20"],"密码最小长度":["8.20"],"默认为8":["8.20"],"检查邮箱格式的函数":["8.22"],"group":["8.24","13.2","13.5"],"山奈提供了一些方便的方法来处理":["9.0"],"url":["9.2","9.5","9.6","9.7","9.8","9.9","9.10"],"获取":["9.5","9.6","9.7"],"设置":["9.8","9.9","9.10"],"的参数":["9.8"],"的":["9.9"],"获取上一个":["9.11"],"我们使用":["11.0"],"yarn":["11.0","13.2","13.5"],"作为包管理工具":["11.0"],"请先安装":["11.0"],"tip":["12.0"],"山奈":["12.1"],"galanga":["12.1"],"以下简称山奈":["12.1"],"相比其他的函数库":["12.2"],"单元测试保证支持如下环境":["12.3"],"ie":["12.3"],"vpteammembers":["12.5"],"请在github上或者gitee上查看贡献者名单":["12.6"],"为了方便各位开发者的交流":["12.7"],"main":["13.1"],"在npm项目下":["13.2","13.5"],"您可以通过以下命令安装山奈":["13.2","13.5"],"bash":["13.2","13.5"],"在html单页面下":["13.3"],"您可以在官方仓库内下载山奈的打包产物":["13.3","13.6"],"然后引入至您的html文件中":["13.3"],"app版本":["13.4"],"uni":["13.6"],"modules":["13.6"],"下使用":["13.6"],"在uni":["13.6"],"modules下":["13.6"],"这里列出会在未来添加的新功能":["14.0"],"这是一个基于":["16.0"]},{"1":["10.1","10.6","10.7","10.8","10.9"],"3":["10.7"],"5":["10.5","10.10"],"6":["10.2","10.4"],"7":["10.3"],"11":["10.10"],"22":["10.16"],"24":["10.14"],"26":["10.12"],"27":["10.11"],"2023":["10.3","10.4","10.5","10.10"],"可以帮助您更好的操作数组":["0.0"],"将length大的数组保留":["0.2"],"import":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","7.7","7.11","8.3","8.7","8.11","8.15","8.19","8.23","9.3","9.12"],"数组":["0.4"],"property":["0.4"],"是一个对象":["1.2"],"的值":["1.5"],"如果":["1.5","9.9"],"不存在":["1.6"],"则创建":["1.6"],"输入参数如下":["1.6","1.7"],"必填":["1.6","1.7"],"skey":["1.6","1.7"],"清空所有":["1.8"],"type":["2.1","7.1","7.5","7.9"],"可以是一个时间戳":["2.4"],"也可以是一个时间字符串":["2.4"],"也可以是一个":["2.4"],"date":["2.4"],"可用来获取设备的信息":["3.0"],"包括浏览器类型":["3.2"],"os":["3.4"],"platform":["3.4"],"可选值为":["3.4"],"分别表示浏览器类型":["3.4"],"开始":["3.5","3.10"],"包含了":["3.7"],"读取剪切板的内容":["3.9"],"返回一个":["3.9"],"promise":["3.9"],"如果读取成功":["3.9"],"则返回剪切板的内容":["3.9"],"否则返回":["3.9"],"null":["3.9"],"这个函数的参数如下":["3.9"],"clipboard":["3.10"],"您可以查看您所需要的api的详细信息":["4.0"],"这些函数可以用于数值计算":["5.0"],"保留两位小数":["5.2"],"数字":["5.4"],"decimal":["5.4"],"这些方法可以帮助您更好地使用对象":["6.0"],"并不影响原有object中的结构":["6.2"],"原有的object":["6.4"],"code":["6.4"],"group":["6.4","8.4","8.8","8.12","9.13"],"js":["6.4","8.4","8.8","8.12","8.24","13.3","13.6"],"按需引入":["6.4","8.24"],"updateobjectfromimport":["6.4"],"将对象中的某些属性保留":["6.6"],"要摇树的对象":["6.8"],"array":["6.8"],"用于获取或判断是否获取了浏览器的通知权限":["7.2"],"返回一个布尔值或null":["7.4","7.8","7.12"],"true":["7.4","7.8","7.12"],"表示获取了权限":["7.4","7.8","7.12"],"false":["7.4","7.8","7.12"],"表示没有获取权限或浏览器不支持通知权限":["7.4"],"用于获取或判断是否获取了浏览器的剪贴板权限":["7.6"],"此函数是一个异步函数":["7.8","7.12"],"用于获取或判断是否获取了浏览器的地理位置权限":["7.10"],"用于处理字符串":["8.0"],"如果字符串为空":["8.2","8.10"],"非空":["8.6"],"如果字符串不为空":["8.6"],"b":["8.14"],"有以下内容":["8.16"],"decimals":["8.16"],"保留的小数位数":["8.16"],"默认为1":["8.16"],"from":["8.16"],"输入的字节单位":["8.16"],"如果符合要求":["8.18","8.22"],"maxlength":["8.20"],"密码最大长度":["8.20"],"默认为16":["8.20"],"types":["8.20"],"字符类型":["8.20"],"分别为数字":["8.20"],"小写字母":["8.20"],"大写字母":["8.20"],"特殊字符":["8.20"],"是一个用于处理":["9.2"],"参数的值":["9.5"],"如果参数不存在":["9.5","9.8"],"则返回":["9.5"],"的":["9.6"],"hash":["9.6","9.9"],"值":["9.6"],"的路径":["9.7","9.10"],"如果路径不存在":["9.7","9.10"],"则添加参数":["9.8"],"操作成功返回":["9.8"],"则添加路径":["9.10"],"url":["9.11"],"新增":["10.2"],"aftertime":["10.2"],"bash":["11.0"],"npm":["11.0","13.2","13.5"],"install":["11.0","13.5"],"g":["11.0"],"安装依赖":["11.0"],"本项目进入公测阶段":["12.0"],"是川菜中常用的调味品":["12.1"],"也可以用作腌制成为单独的菜品":["12.1"],"而这一辅料被人们俗称为姜":["12.1"],"山奈希望提供在业务中常用的一些函数":["12.2"],"ch":["12.3"],"ff":["12.3"],"sf":["12.3"],"size":["12.5"],"如果您也想对山奈做出贡献":["12.6"],"我们在各大平台都开设了有关山奈的交流群":["12.7"],"欢迎大家加入":["12.7"],"山奈的主版本是一个在标准w3c环境下运行的javascript库":["13.1"],"add":["13.2","13.5"],"galanga":["13.2","13.3","13.5"],"例如您将山奈的打包产物放在":["13.3"],"目录下":["13.3"],"uniapp":["13.4"],"uni":["13.5"],"helper":["13.5"],"是":["13.6"],"dist":["13.6"],"index":["13.6"],"这个文件":["13.6"],"然后引入至您的uni":["13.6"],"和已经完成的功能":["14.0"],"vitepress":["16.0"]},{"1":["10.20"],"2":["10.8"],"4":["10.6","10.14","10.16"],"5":["10.3","10.4","10.11"],"9":["10.1"],"19":["10.19"],"20":["10.18"],"21":["10.17"],"23":["10.15"],"25":["10.5","10.13"],"27":["10.3","10.4"],"2023":["10.1","10.6","10.7","10.8","10.9","10.11","10.12","10.13","10.14","10.15","10.16","10.17","10.18","10.19"],"length小的数组去掉":["0.2"],"filteruniquebyproperty":["0.3"],"string":["0.4","3.5"],"对象的属性":["0.4"],"code":["0.4","1.8","6.8","8.16","9.5","9.7"],"操作函数":["1.0"],"包含了一些常用的":["1.2"],"cookie":["1.2"],"localcookie":["1.3"],"不存在":["1.5","9.6","9.9"],"则返回":["1.5","8.2","8.6","8.10","8.18","8.22","9.7"],"名称":["1.6","1.7"],"svalue":["1.6"],"值":["1.6"],"spath":["1.6","1.7"],"路径":["1.7"],"group":["1.8","8.16"],"warning":["2.1","7.1","7.5","7.9"],"aftertime":["2.3"],"对象":["2.4"],"backtype":["2.4"],"返回格式":["2.4"],"可以是一个字符串":["2.4"],"或者进行一些操作":["3.0"],"设备类型":["3.2","3.4"],"checkdevicetype":["3.3","3.5"],"系统类型":["3.4"],"平台类型":["3.4"],"如果只想检查其中的某一个类型":["3.4"],"则可以传入一个字符串":["3.4"],"如":["3.4"],"如果想检查多个类型":["3.4"],"函数的参数不再包含":["3.5","3.10"],"return":["3.5"],"read":["3.7"],"clipboard":["3.8"],"是否只读取剪切板中的文本内容":["3.9"],"默认为":["3.9","8.20"],"true":["3.9","8.6","9.8","9.10"],"如果为":["3.9"],"false":["3.9","9.8"],"则会读取剪切板中的所有内容":["3.9"],"包括图片等":["3.9"],"write":["3.10"],"onlystring":["3.10"],"而是智能判断您传入的类型":["3.10"],"请注意的是":["4.0"],"formatnumber":["5.3"],"保留的小数位数":["5.4"],"默认为2":["5.4","8.20"],"updateobjectfromimport":["6.3"],"全局引入":["6.4"],"galanga":["6.4","13.6"],"其余属性删除":["6.6"],"shakeobject":["6.7"],"要保留的属性名组成的数组":["6.8"],"notificationpermission":["7.3"],"null":["7.4","7.8","7.12","9.5","9.7"],"表示用户还未做出选择":["7.4","7.8","7.12"],"async":["7.4"],"request":["7.4","7.8","7.12"],"用于请求通知权限":["7.4"],"clipboardpermission":["7.7"],"表示没有获取权限或浏览器不支持剪贴板权限":["7.8"],"用于请求剪贴板权限":["7.8"],"locationpermission":["7.11"],"表示没有获取权限或浏览器不支持地理位置权限":["7.12"],"用于请求地理位置权限":["7.12"],"checknull":["8.3"],"按需引入":["8.4","8.8","8.12","9.13"],"checknotnull":["8.7"],"strlength":["8.11"],"kb":["8.14"],"mb":["8.14"],"formatbytes":["8.15"],"默认为b":["8.16"],"to":["8.16"],"输出的字节单位":["8.16"],"checkpassword":["8.19"],"number":["8.20"],"lowercase":["8.20"],"uppercase":["8.20"],"special":["8.20"],"mintypes":["8.20"],"最少包含的字符类型":["8.20"],"maxtypes":["8.20"],"checkemail":["8.23","8.24"],"info":["8.24"],"url":["9.3","10.2"],"如果":["9.6"],"否则返回":["9.8","9.10"],"则添加":["9.9"],"操作成功返回":["9.9","9.10"],"getpreurl":["9.12"],"js":["9.13"],"函数":["10.2"],"用于获取当前时间之后的时间":["10.2"],"给":["10.2"],"拓展了":["10.5"],"项目推进至公测阶段":["10.10"],"欢迎大家使用并提出宝贵的意见":["10.10","12.0"],"不稳定的api会在文档内标注":["10.10"],"一键打包生成生产代码":["11.0"],"在web的世界里":["12.1"],"它是一个开源的实用的js函数库":["12.1"],"它的目标是提供一些常用的函数":["12.1"],"让你的代码更简洁更易读":["12.1"],"而山奈也是基于typescript开发的":["12.2"],"op":["12.3"],"ios":["12.3"],"android":["12.3"],"small":["12.5"],"请参考贡献指南":["12.6"],"qq":["12.7"],"您可以在任何支持javascript的环境中使用它":["13.1"],"install":["13.2"],"pnpm":["13.2","13.5"],"您可以通过以下方式引入山奈":["13.3"],"html":["13.3"],"当然":["13.3"],"山奈的uni":["13.4"],"modules文件夹中":["13.6"],"例如您将山奈的打包产物放在":["13.6"],"目录下":["13.6"],"x":["14.0"],"的文档站点":["16.0"]},{"0":["8.10"],"1":["8.16"],"3":["10.17","10.18","10.19"],"4":["10.13","10.15"],"5":["10.6","10.7","10.8","10.9","10.12"],"6":["10.1","12.3"],"7":["10.16"],"9":["10.11","10.12"],"16":["10.7"],"18":["10.14"],"29":["12.3"],"2023":["10.20"],"346363551":["12.7"],"from":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","7.7","7.11","8.3","8.7","8.11","8.15","8.19","8.23","9.3","9.12"],"group":["0.4","1.5","5.4","6.8","8.20","9.5","9.7","9.8","9.10","13.6"],"js":["0.4","1.8","5.4","6.8","8.16","8.20","9.5","9.7","9.8"],"按需引入":["0.4","1.8","6.8","8.16","8.20","9.5","13.6"],"包括获取":["1.0"],"操作函数":["1.2"],"null":["1.5","9.6"],"code":["1.5","5.4","8.20","9.6","9.8","9.10","13.6"],"路径":["1.6"],"默认为":["1.6","1.7"],"sdomain":["1.6","1.7"],"域":["1.6","1.7"],"默认为当前域":["1.6"],"text":["2.1","7.1","7.5","7.9"],"也可以是一个函数":["2.4"],"如果是字符串":["2.4"],"则返回一个时间字符串":["2.4"],"如果是函数":["2.4"],"系统类型":["3.2"],"则可以传入一个数组":["3.4"],"默认情况下":["3.4"],"返回的是一个对象":["3.4"],"包含了浏览器类型":["3.4"],"而是直接传入一个字符串或者数组":["3.5"],"如果传入的是一个字符串":["3.5"],"则返回一个字符串":["3.5"],"如果传入的是一个数组":["3.5"],"和":["3.7"],"value":["3.9"],"设置剪切板的内容":["3.9"],"如果设置成功":["3.9"],"则返回":["3.9","9.6"],"例如":["3.10"],"string":["3.10"],"类型的参数会被判断为进行writetxt操作":["3.10"],"其他类型的参数会被判断为进行write操作":["3.10"],"请您检查您的业务中是否使用了":["3.10"],"在这里演示的所有api均以es6的语法为基础":["4.0"],"details":["6.4"],"注意":["6.4"],"如果原有的object是响应式的":["6.4"],"那么在将object作为参数传入函数后":["6.4"],"要么会污染原有的object":["6.4"],"也叫做摇树":["6.6"],"此函数为一个异步函数":["7.4","7.8","7.12"],"返回一个布尔值":["7.4","7.8","7.12"],"true":["8.2","8.18","8.22","9.9"],"checknull":["8.4"],"name":["8.4","8.8","8.12"],"否则返回":["8.6","9.9"],"checknotnull":["8.8"],"strlength":["8.12"],"gb":["8.14"],"const":["8.16","8.20"],"json":["8.16","8.20"],"最多包含的字符类型":["8.20"],"默认为4":["8.20"],"sancerain":["8.24"],"com":["8.24"],"的函数":["9.2"],"false":["9.9","9.10"],"getpreurl":["9.13"],"函数集合新增了":["10.2"],"sethash":["10.2"],"用于设置url的hash值":["10.2"],"修复了":["10.3","10.4"],"checkdevicetype":["10.3","10.4"],"formatnumber":["10.5"],"函数":["10.5"],"beta":["10.10"],"同时也感谢我的同事们生产环境出问题的风险使用了山奈":["10.10"],"用的很好":["10.10"],"新增了":["10.14"],"run":["11.0"],"build":["11.0"],"运行单元测试":["11.0"],"test":["11.0"],"不稳定的api会进行特殊标注":["12.0"],"我们希望利用姜来让您的代码更加美味":["12.1"],"让您更加专注于业务逻辑的实现":["12.1"],"使用es6":["12.1"],"因此在使用时":["12.2"],"node":["12.3"],"members":["12.5"],"以下是山奈的贡献者名单头像缩略图":["12.6"],"钉钉":["12.7"],"cnpm":["13.2","13.5"],"您也可以引入山奈的cdn链接":["13.3"],"引入完成后":["13.3"],"您可以在项目中使用全部功能":["13.3"],"app版本是一个在uni":["13.4"],"您可以通过以下方式引入山奈":["13.6"],"import":["13.6"],"已完成":["14.0"],"您也可以直接在这里浏览文档源文件":["16.0"]},{"2":["8.20","10.20"],"3":["10.1"],"8":["8.20"],"9":["12.3"],"12":["10.8","10.9"],"15":["10.15"],"16":["8.20"],"18":["10.6"],"19":["10.18"],"22":["10.13","10.17"],"50":["12.3"],"55":["12.3"],"1024":["8.16"],"galanga":["0.3","1.3","2.3","3.3","3.8","5.3","6.3","6.7","7.3","7.7","7.11","8.3","8.7","8.11","8.15","8.19","8.23","9.3","9.12"],"filteruniquebyproperty":["0.4","10.11"],"设置":["1.0","1.2"],"删除":["1.0"],"包括获取":["1.2"],"js":["1.5","1.7","3.4","3.9","7.4","7.8","7.12","9.6","9.9","9.10","13.2","13.5"],"按需引入":["1.5","3.9","5.4","7.4","7.8","7.12","9.6","9.7","9.8","9.9","9.10","13.2","13.5"],"localcookie":["1.5","1.8"],"vend":["1.6"],"有效期":["1.6"],"默认为当前会话结束":["1.6"],"bsecure":["1.6"],"是否只在":["1.6"],"https":["1.6"],"默认为当前域":["1.7"],"code":["1.7","2.4","3.9","7.4","7.8","7.12","9.9"],"group":["1.7","2.4","3.9","7.4","7.8","7.12","9.6","9.9"],"clear":["1.8"],"beta":["2.1","7.1","7.5","7.9"],"则返回一个":["2.4"],"如下":["3.4"],"chrome":["3.4"],"pc":["3.4"],"则返回一个对象":["3.5"],"请您检查您的业务中是否使用了":["3.5"],"参数":["3.5","3.10"],"write":["3.7"],"要设置的内容":["3.9"],"clipboard":["3.9","10.5"],"如果使用了":["3.10"],"请您修改为新的使用方式":["3.10"],"如果您使用的是其他类型的语法或者安装方法":["4.0"],"formatnumber":["5.4","10.7"],"要么会导致函数失去响应式":["6.4"],"具体情况取决于您的使用场景和框架":["6.4"],"如果在这种场景下":["6.4"],"您仍然想要使用这个函数":["6.4"],"并不希望污染原有的object":["6.4"],"那么您可以使用下面的方法":["6.4"],"shakeobject":["6.8"],"表示用户已经拒绝了权限或浏览器不支持通知权限":["7.4"],"表示用户已经拒绝了权限或浏览器不支持剪贴板权限":["7.8"],"await":["7.8","7.12"],"表示用户已经拒绝了权限或浏览器不支持地理位置权限":["7.12"],"否则返回":["8.2","8.18","8.22"],"全局引入":["8.4","8.8","8.12","8.24"],"false":["8.6"],"此函数会反义":["8.6"],"tb":["8.14"],"pb":["8.14"],"b":["8.16"],"kb":["8.16"],"formatbytes":["8.16"],"它提供了一些方便的方法来处理":["9.2"],"getquery":["9.5"],"name":["9.5","9.8"],"setquery":["9.8"],"新增":["10.1","10.6","10.7"],"setpath":["10.2"],"函数的bug":["10.3","10.4"],"现在可以正常使用了":["10.3","10.4"],"现在可以自定义保留小数位数了":["10.5"],"修复":["10.8","10.9"],"下次不准再用了":["10.10"],"jpg":["10.10"],"bushi":["10.10"],"新增了":["10.11","10.12","10.16","10.17","10.18"],"updateobjectfromimport":["10.12"],"checknull":["10.13"],"checknotnull":["10.14"],"函数":["10.14"],"对函数":["10.15"],"checkdevicetype":["10.16"],"注意":["11.0"],"浏览器环境需要手动测试":["11.0"],"位于":["11.0"],"browser":["11.0"],"修改":["11.0"],"和typescript编写源码":["12.1"],"编译生成生产代码":["12.1"],"多环境支持":["12.1"],"您可以获得更好的类型提示":["12.2"],"贡献者名单":["12.6"],"山奈galanga开源js函数库交流群":["12.7"],"telegram":["12.7"],"安装完成后":["13.2","13.5"],"您可以在项目中引入山奈并使用对应的功能":["13.2","13.5"],"目前暂不支持将部分函数单独引入至项目内":["13.3"],"console":["13.3"],"log":["13.3"],"app环境下运行的javascript库":["13.4"],"info":["13.6"],"from":["13.6"],"未完成":["14.0"]},{"4":["8.20","12.3"],"12345678":["8.20"],"id":["0.4"],"全局引入":["0.4","1.8","5.4","6.8","8.16","8.20","9.5","9.7","9.8","9.13","13.6"],"删除":["1.2"],"getitem":["1.5"],"name":["1.5","1.7"],"连接中有效":["1.6"],"false":["1.6","8.2","8.18","8.22"],"code":["1.6"],"group":["1.6"],"js":["1.6","2.4","3.5","3.10"],"按需引入":["1.7","2.4"],"localcookie":["1.7"],"removeitem":["1.7"],"aftertime":["2.4"],"windows":["3.4"],"web":["3.4"],"如果只传入一个字符串":["3.4"],"那么返回的是一个字符串":["3.4"],"比如你只想检查浏览器类型":["3.4"],"如果使用了":["3.5"],"请您修改为新的使用方式":["3.5"],"例如":["3.5"],"两个函数":["3.7"],"hello":["3.9"],"world":["3.9"],"then":["3.9"],"text":["3.9"],"console":["3.9","13.2","13.5","13.6"],"log":["3.9","13.2","13.6"],"旧的使用方式":["3.10"],"您需要自行转换":["4.0"],"let":["6.4"],"newobject":["6.4"],"notificationpermission":["7.4","10.10"],"await":["7.4"],"clipboardpermission":["7.8"],"locationpermission":["7.12"],"galanga":["8.4","8.8","8.12","8.24","9.8","9.9","9.10","9.13"],"checknull":["8.6","10.8"],"函数":["8.6","10.7","10.10","10.11","10.12","10.16"],"eb":["8.14"],"var":["8.16","8.20"],"checkpassword":["8.20","10.18"],"gethash":["9.6"],"getpath":["9.7"],"sethash":["9.9"],"setpath":["9.10"],"getpreurl":["10.1"],"用于设置url的路径":["10.2"],"变更了":["10.3"],"clipboard":["10.3","10.6"],"新增了":["10.4"],"shakeobject":["10.4"],"现在可以读取和写入任意类型的数据了":["10.5"],"updateobjectfromimport":["10.9"],"新增":["10.10"],"用于根据数组中对象的某个属性去重":["10.11"],"和":["10.13"],"用于检查字符串是否不为空":["10.14"],"此函数会反义":["10.14"],"checkdevicetype":["10.15"],"用于检查设备类型":["10.16"],"checkemail":["10.17"],"修复了":["10.19"],"formatbytes":["10.19"],"package":["11.0"],"json":["11.0"],"中的版本号":["11.0"],"readme":["11.0"],"支持浏览器原生":["12.1"],"支持amd":["12.1"],"cmd":["12.1"],"支持webpack":["12.1"],"censujiang":["12.7"],"import":["13.2","13.5"],"info":["13.2","13.3","13.5"],"from":["13.2","13.5"],"我们更推荐使用npm项目的方式引入山奈":["13.3"],"您可以在uni":["13.4"]},{"galanga":["0.4","1.5","1.7","1.8","2.4","3.9","5.4","6.8","7.4","7.8","7.12","9.5","9.6","9.7"],"等":["1.0","1.2"],"全局引入":["1.5","1.6","1.7","2.4","3.9","7.4","7.8","7.12","9.6","9.9","9.10","13.2","13.5"],"按需引入":["1.6","3.4"],"localcookie":["1.6"],"setitem":["1.6"],"name":["1.6"],"value":["1.6"],"那么返回的就是浏览器类型":["3.4"],"code":["3.4"],"group":["3.4","12.7"],"旧的使用方式":["3.5"],"browser":["3.5"],"true":["3.5","3.10"],"hello":["3.10"],"world":["3.10"],"新的使用方式":["3.10"],"这也是为了业务逻辑的统一":["8.6"],"方便使用":["8.6"],"zb":["8.14"],"yb":["8.14"],"函数":["10.1","10.4","10.6","10.17","10.18"],"用于获取上一页的url":["10.1"],"setquery":["10.2"],"用于设置url的参数":["10.2"],"修复":["10.2"],"write":["10.3"],"函数的参数":["10.3"],"输入一个数组和要摇树的对象":["10.4"],"新增了":["10.5"],"locationpermission":["10.5"],"用于读取和设置剪贴板":["10.6"],"用于格式化数字":["10.7"],"保留两位小数":["10.7"],"函数的bug":["10.8","10.9"],"现在匹配到false的情况会返回false了":["10.8"],"现在可以正常使用了":["10.9"],"用于处理浏览器通知权限":["10.10"],"clipboardpermission":["10.10"],"将length大的数组保留":["10.11"],"length小的数组去掉":["10.11"],"用于将新的object中的值动态更新到原有的object中":["10.12"],"并不影响原有object中的结构":["10.12"],"checknotnull":["10.13"],"函数现在可以检查数字类型的参数是否为nan了":["10.13"],"checknull":["10.14"],"进行了优化":["10.15"],"现在可以更好的检测设备类型":["10.15"],"此函数不稳定":["10.16"],"可能会在后续版本中修改":["10.16"],"用于检查邮箱格式":["10.17"],"用于检查密码强度":["10.18"],"函数的两个bug":["10.19"],"项目发布测试版本":["10.20"],"md":["11.0"],"changelog":["11.0"],"然后发布新版":["11.0"],"rollup":["12.1"],"fis等":["12.1"],"支持node":["12.1"],"注意":["12.3"],"编译代码依赖es5环境":["12.3"],"对于ie6":["12.3"],"微信":["12.7"],"因为这样不仅可以更好地管理依赖":["13.3"],"还可以使用您的打包工具的摇树功能动态修剪您的代码":["13.3"],"在查看后文的使用示例时":["13.3"],"请使用":["13.3"],"app项目中使用它":["13.4"],"log":["13.5"]},{"galanga":["1.6","3.4","8.16","8.20"],"checkdevicetype":["3.4"],"全局引入":["3.4"],"details":["3.4","3.9"],"迁移指南":["3.4","3.9"],"新的使用方式":["3.5"],"localcookie":["10.2"],"函数的bug":["10.2"],"现在可以正常使用了":["10.2"],"现在可以写入任意类型的数据了":["10.3"],"返回的是这个数组中出现的元素组成的对象":["10.4"],"用于处理浏览器定位权限":["10.5"],"用于处理浏览器剪贴板权限":["10.10"],"方便使用":["10.14"],"release":["11.0"],"无依赖":["12.1"],"体积小巧":["12.1"],"8需要引入es5":["12.3"],"shim才可以兼容":["12.3"],"微信群":["12.7"],"作为全局变量后再加具体的功能函数名":["13.3"]}]'},t={"0.0":{t:"array",p:`山奈提供了一些数组的操作方法，可以帮助您更好的操作数组。
`,l:"api/array.html",a:"array"},"0.1":{t:"filteruniquebyproperty",p:"\r",l:"api/array.html#filteruniquebyproperty",a:"filteruniquebyproperty"},"0.2":{t:"介绍",p:`根据数组中对象的某个属性去重，将length大的数组保留，length小的数组去掉。
`,l:"api/array.html#介绍",a:"介绍"},"0.3":{t:"导入",p:`import { filterUniqueByProperty } from 'galanga'

`,l:"api/array.html#导入",a:"导入"},"0.4":{t:"使用",p:`输入的参数如下：

array[array]: 数组
property[string]: 对象的属性

::: code-g ...`,l:"api/array.html#使用",a:"使用"},"1.0":{t:"cookie",p:`山奈提供了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html",a:"cookie"},"1.1":{t:"localcookie",p:"\r",l:"api/cookie.html#localcookie",a:"localcookie"},"1.2":{t:"简介",p:`localCookie 是一个对象，包含了一些常用的 Cookie 操作函数，包括获取、设置、删除 Cookie 等。
`,l:"api/cookie.html#简介",a:"简介"},"1.3":{t:"导入",p:`import { localCookie } from 'galanga'

`,l:"api/cookie.html#导入",a:"导入"},"1.4":{t:"使用",p:"\r",l:"api/cookie.html#使用",a:"使用"},"1.5":{t:"获取-cookie",p:`获取 Cookie 的值，如果 Cookie 不存在，则返回 null。
::: code-group
localCooki ...`,l:"api/cookie.html#获取-cookie",a:"获取-cookie"},"1.6":{t:"设置-cookie",p:`设置 Cookie 的值，如果 Cookie 不存在，则创建 Cookie。
输入参数如下：

(必填)sKey：Cooki ...`,l:"api/cookie.html#设置-cookie",a:"设置-cookie"},"1.7":{t:"删除-cookie",p:`删除 Cookie。
输入参数如下：

(必填)sKey：Cookie 名称
sPath：Cookie 路径，默认为 /
s ...`,l:"api/cookie.html#删除-cookie",a:"删除-cookie"},"1.8":{t:"清空-cookie",p:`清空所有 Cookie。
::: code-group
localCookie.clear()

galanga.local ...`,l:"api/cookie.html#清空-cookie",a:"清空-cookie"},"2.0":{t:"date",p:`山奈提供了一些时间处理的工具函数
`,l:"api/date.html",a:"date"},"2.1":{t:"aftertime-badge-type-warning-text-beta",p:"\r",l:"api/date.html#aftertime-badge-type-warning-text-beta",a:"aftertime-badge-type-warning-text-beta"},"2.2":{t:"介绍",p:`输出当前时间之后的时间
`,l:"api/date.html#介绍",a:"介绍"},"2.3":{t:"导入",p:`import { afterTime } from 'galanga'

`,l:"api/date.html#导入",a:"导入"},"2.4":{t:"使用",p:`输入参数如下：

(必填)time：时间，可以是一个时间戳，也可以是一个时间字符串，也可以是一个 Date 对象
backT ...`,l:"api/date.html#使用",a:"使用"},"3.0":{t:"device",p:`山奈提供了一些有关设备操作的API，可用来获取设备的信息，或者进行一些操作。
`,l:"api/device.html",a:"device"},"3.1":{t:"checkdevicetype",p:"\r",l:"api/device.html#checkdevicetype",a:"checkdevicetype"},"3.2":{t:"介绍",p:`检查当前设备的各种类型，包括浏览器类型、设备类型、系统类型
`,l:"api/device.html#介绍",a:"介绍"},"3.3":{t:"导入",p:`import { checkDeviceType } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"3.4":{t:"使用",p:`输入的参数如下：

type：要检查的类型，此参数为一个数组，默认为['browser', 'device', 'os',  ...`,l:"api/device.html#使用",a:"使用"},"3.5":{t:"v0-1-6-之前",p:"从v0.1.6开始，checkDeviceType函数的参数不再包含return_string，而是直接传入一个字符串或者数 ...",l:"api/device.html#v0-1-6-之前",a:"v0-1-6-之前"},"3.6":{t:"clipboard",p:"\r",l:"api/device.html#clipboard",a:"clipboard"},"3.7":{t:"介绍",p:`一个用于读取和设置剪切板的函数组合，包含了read和write两个函数
`,l:"api/device.html#介绍",a:"介绍"},"3.8":{t:"导入",p:`import { clipboard } from 'galanga'

`,l:"api/device.html#导入",a:"导入"},"3.9":{t:"使用",p:`一共有两个函数，分别是read和write，分别用于读取和设置剪切板


[async]read(onlyString)：读 ...`,l:"api/device.html#使用",a:"使用"},"3.10":{t:"v0-1-7-之前",p:"从v0.1.7开始，clipboard.write()函数的参数不再包含onlyString，而是智能判断您传入的类型，例如 ...",l:"api/device.html#v0-1-7-之前",a:"v0-1-7-之前"},"4.0":{t:"前言",p:`在本站的API信息栏目中，您可以查看您所需要的API的详细信息。
请注意的是，在这里演示的所有API均以ES6的语法为基础， ...`,l:"api/index.html",a:"前言"},"5.0":{t:"number",p:`山奈提供了一些数学函数，这些函数可以用于数值计算。
`,l:"api/number.html",a:"number"},"5.1":{t:"formatnumber",p:"\r",l:"api/number.html#formatnumber",a:"formatnumber"},"5.2":{t:"介绍",p:`格式化数字，保留两位小数。
`,l:"api/number.html#介绍",a:"介绍"},"5.3":{t:"导入",p:`import { formatNumber } from 'galanga'

`,l:"api/number.html#导入",a:"导入"},"5.4":{t:"使用",p:`输入的参数如下：

number[number]: 数字
decimal[number]: 保留的小数位数，默认为2

:: ...`,l:"api/number.html#使用",a:"使用"},"6.0":{t:"object",p:`山奈提供了一些有关对象的方法，这些方法可以帮助您更好地使用对象。
`,l:"api/object.html",a:"object"},"6.1":{t:"updateobjectfromimport",p:"\r",l:"api/object.html#updateobjectfromimport",a:"updateobjectfromimport"},"6.2":{t:"介绍",p:`将新的object中的值动态更新到原有的object中，并不影响原有object中的结构。
`,l:"api/object.html#介绍",a:"介绍"},"6.3":{t:"导入",p:`import { updateObjectFromImport } from 'galanga'

`,l:"api/object.html#导入",a:"导入"},"6.4":{t:"使用",p:`输入的参数如下：

importObject[object]: 新的object，用于更新原有的object
object[ ...`,l:"api/object.html#使用",a:"使用"},"6.5":{t:"shakeobject",p:"\r",l:"api/object.html#shakeobject",a:"shakeobject"},"6.6":{t:"介绍",p:`通过一个数组，将对象中的某些属性保留，其余属性删除。（也叫做摇树）
`,l:"api/object.html#介绍",a:"介绍"},"6.7":{t:"导入",p:`import { shakeObject } from 'galanga'

`,l:"api/object.html#导入",a:"导入"},"6.8":{t:"使用",p:`输入的参数如下：


object[object]: 要摇树的对象


array[array]: 要保留的属性名组成的数组 ...`,l:"api/object.html#使用",a:"使用"},"7.0":{t:"permission",p:`山奈提供了一些API用于您去获取或判断是否获取了一些浏览器权限。
`,l:"api/permission.html",a:"permission"},"7.1":{t:"notificationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#notificationpermission-badge-type-warning-text-beta",a:"notificationpermission-badge-type-warning-text-beta"},"7.2":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的通知权限。
`,l:"api/permission.html#介绍",a:"介绍"},"7.3":{t:"导入",p:`import { notificationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"7.4":{t:"使用",p:`此集合有两个子函数，分别如下：


check(): 用于判断是否获取了通知权限，返回一个布尔值或Null，true表示获取 ...`,l:"api/permission.html#使用",a:"使用"},"7.5":{t:"clipboardpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#clipboardpermission-badge-type-warning-text-beta",a:"clipboardpermission-badge-type-warning-text-beta"},"7.6":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的剪贴板权限。
`,l:"api/permission.html#介绍",a:"介绍"},"7.7":{t:"导入",p:`import { clipboardPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"7.8":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了剪贴板权限，此函数是一个异步函数，返回 ...`,l:"api/permission.html#使用",a:"使用"},"7.9":{t:"locationpermission-badge-type-warning-text-beta",p:"\r",l:"api/permission.html#locationpermission-badge-type-warning-text-beta",a:"locationpermission-badge-type-warning-text-beta"},"7.10":{t:"介绍",p:`这是一个函数集合，用于获取或判断是否获取了浏览器的地理位置权限。
`,l:"api/permission.html#介绍",a:"介绍"},"7.11":{t:"导入",p:`import { locationPermission } from 'galanga'

`,l:"api/permission.html#导入",a:"导入"},"7.12":{t:"使用",p:`此集合有两个子函数，分别如下：


[async]check(): 用于判断是否获取了地理位置权限，此函数是一个异步函数，返 ...`,l:"api/permission.html#使用",a:"使用"},"8.0":{t:"string",p:`山奈提供了一些字符串处理的函数，用于处理字符串。
`,l:"api/string.html",a:"string"},"8.1":{t:"checknull",p:"\r",l:"api/string.html#checknull",a:"checknull"},"8.2":{t:"介绍",p:`判断字符串是否为空，如果字符串为空，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"8.3":{t:"导入",p:`import { checkNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"8.4":{t:"使用",p:`::: code-group
checkNull(name)

galanga.checkNull(name)

:::
`,l:"api/string.html#使用",a:"使用"},"8.5":{t:"checknotnull",p:"\r",l:"api/string.html#checknotnull",a:"checknotnull"},"8.6":{t:"介绍",p:"判断字符串是否不为空（非空），如果字符串不为空，则返回 true，否则返回 false。此函数会反义 checkNull 函 ...",l:"api/string.html#介绍",a:"介绍"},"8.7":{t:"导入",p:`import { checkNotNull } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"8.8":{t:"使用",p:`::: code-group
checkNotNull(name)

galanga.checkNotNull(name)
 ...`,l:"api/string.html#使用",a:"使用"},"8.9":{t:"strlength",p:"\r",l:"api/string.html#strlength",a:"strlength"},"8.10":{t:"介绍",p:`获取字符串的长度，如果字符串为空，则返回 0。
`,l:"api/string.html#介绍",a:"介绍"},"8.11":{t:"导入",p:`import { strLength } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"8.12":{t:"使用",p:`::: code-group
strLength(name)

galanga.strLength(name)

:::
`,l:"api/string.html#使用",a:"使用"},"8.13":{t:"formatbytes",p:"\r",l:"api/string.html#formatbytes",a:"formatbytes"},"8.14":{t:"介绍",p:`将字节格式化为 B、KB、MB、GB、TB、PB、EB、ZB、YB。
`,l:"api/string.html#介绍",a:"介绍"},"8.15":{t:"导入",p:`import { formatBytes } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"8.16":{t:"使用",p:`输入参数：


bytes：字节数


一个json对象（可选），有以下内容：


decimals：保留的小数位数，默认为 ...`,l:"api/string.html#使用",a:"使用"},"8.17":{t:"checkpassword",p:"\r",l:"api/string.html#checkpassword",a:"checkpassword"},"8.18":{t:"介绍",p:`检查密码强度的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"8.19":{t:"导入",p:`import { checkPassword } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"8.20":{t:"使用",p:`输入参数：


password：密码


一个json对象（可选），有以下内容：


minLength：密码最小长度，默 ...`,l:"api/string.html#使用",a:"使用"},"8.21":{t:"checkemail",p:"\r",l:"api/string.html#checkemail",a:"checkemail"},"8.22":{t:"介绍",p:`检查邮箱格式的函数，如果符合要求，则返回 true，否则返回 false。
`,l:"api/string.html#介绍",a:"介绍"},"8.23":{t:"导入",p:`import { checkEmail } from 'galanga'

`,l:"api/string.html#导入",a:"导入"},"8.24":{t:"使用",p:`::: code-group
checkEmail('info@sancerain.com')

galanga.check ...`,l:"api/string.html#使用",a:"使用"},"9.0":{t:"url",p:`山奈提供了一些方便的方法来处理 URL。
`,l:"api/url.html",a:"url"},"9.1":{t:"url",p:"",l:"api/url.html#url",a:"url"},"9.2":{t:"介绍",p:`url 是一个用于处理 URL 的函数，它提供了一些方便的方法来处理 URL。
`,l:"api/url.html#介绍",a:"介绍"},"9.3":{t:"导入",p:`import { url } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"9.4":{t:"使用",p:"\r",l:"api/url.html#使用",a:"使用"},"9.5":{t:"获取url的参数",p:`获取 URL 参数的值，如果参数不存在，则返回 null。
::: code-group
url.getQuery('nam ...`,l:"api/url.html#获取url的参数",a:"获取url的参数"},"9.6":{t:"获取url的hash",p:`获取 URL 的 hash 值，如果 hash 不存在，则返回 null。
::: code-group
url.getHa ...`,l:"api/url.html#获取url的hash",a:"获取url的hash"},"9.7":{t:"获取url的路径",p:`获取 URL 的路径，如果路径不存在，则返回 null。
::: code-group
url.getPath()

gal ...`,l:"api/url.html#获取url的路径",a:"获取url的路径"},"9.8":{t:"设置url的参数",p:`设置 URL 的参数，如果参数不存在，则添加参数。操作成功返回 true，否则返回 false。
::: code-grou ...`,l:"api/url.html#设置url的参数",a:"设置url的参数"},"9.9":{t:"设置url的hash",p:`设置 URL 的 hash，如果 hash 不存在，则添加 hash。操作成功返回 true，否则返回 false。
::: ...`,l:"api/url.html#设置url的hash",a:"设置url的hash"},"9.10":{t:"设置url的路径",p:`设置 URL 的路径，如果路径不存在，则添加路径。操作成功返回 true，否则返回 false。
::: code-grou ...`,l:"api/url.html#设置url的路径",a:"设置url的路径"},"9.11":{t:"getpreurl",p:`获取上一个 URL。
`,l:"api/url.html#getpreurl",a:"getpreurl"},"9.12":{t:"导入",p:`import { getPreURL } from 'galanga'

`,l:"api/url.html#导入",a:"导入"},"9.13":{t:"使用",p:`::: code-group
getPreURL()

galanga.getPreURL()

:::
`,l:"api/url.html#使用",a:"使用"},"10.0":{t:"更新日志",p:"\r",l:"guide/changelog.html",a:"更新日志"},"10.1":{t:"_0-1-9-2023-6-3",p:`
新增getPreURL函数，用于获取上一页的URL。

`,l:"guide/changelog.html#_0-1-9-2023-6-3",a:"_0-1-9-2023-6-3"},"10.2":{t:"_0-1-8-2023-6-1",p:`
新增afterTime函数，用于获取当前时间之后的时间。
给url函数集合新增了setHash函数，用于设置URL的has ...`,l:"guide/changelog.html#_0-1-8-2023-6-1",a:"_0-1-8-2023-6-1"},"10.3":{t:"_0-1-7-2023-5-27",p:`
修复了checkDeviceType函数的bug，现在可以正常使用了。
变更了clipboard.write()函数的参数 ...`,l:"guide/changelog.html#_0-1-7-2023-5-27",a:"_0-1-7-2023-5-27"},"10.4":{t:"_0-1-6-2023-5-27",p:`
修复了checkDeviceType函数的bug，现在可以正常使用了。
新增了shakeObject函数，输入一个数组和要 ...`,l:"guide/changelog.html#_0-1-6-2023-5-27",a:"_0-1-6-2023-5-27"},"10.5":{t:"_0-1-5-2023-5-25",p:`
拓展了formatNumber函数，现在可以自定义保留小数位数了。
拓展了clipboard函数，现在可以读取和写入任意类 ...`,l:"guide/changelog.html#_0-1-5-2023-5-25",a:"_0-1-5-2023-5-25"},"10.6":{t:"_0-1-4-2023-5-18",p:`
新增clipboard函数，用于读取和设置剪贴板。

`,l:"guide/changelog.html#_0-1-4-2023-5-18",a:"_0-1-4-2023-5-18"},"10.7":{t:"_0-1-3-2023-5-16",p:`
新增formatNumber函数，用于格式化数字，保留两位小数。

`,l:"guide/changelog.html#_0-1-3-2023-5-16",a:"_0-1-3-2023-5-16"},"10.8":{t:"_0-1-2-2023-5-12",p:`
修复checkNull函数的bug，现在匹配到false的情况会返回false了。

`,l:"guide/changelog.html#_0-1-2-2023-5-12",a:"_0-1-2-2023-5-12"},"10.9":{t:"_0-1-1-2023-5-12",p:`
修复updateObjectFromImport函数的bug，现在可以正常使用了。

`,l:"guide/changelog.html#_0-1-1-2023-5-12",a:"_0-1-1-2023-5-12"},"10.10":{t:"_0-1-0-2023-5-11",p:`

项目推进至公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会在文档内标注beta，同时也感谢我的同事们生产环境出问 ...`,l:"guide/changelog.html#_0-1-0-2023-5-11",a:"_0-1-0-2023-5-11"},"10.11":{t:"_0-0-27-2023-5-9",p:`
新增了filterUniqueByProperty函数，用于根据数组中对象的某个属性去重，将length大的数组保留，le ...`,l:"guide/changelog.html#_0-0-27-2023-5-9",a:"_0-0-27-2023-5-9"},"10.12":{t:"_0-0-26-2023-5-9",p:`
新增了updateObjectFromImport函数，用于将新的object中的值动态更新到原有的object中，并不影 ...`,l:"guide/changelog.html#_0-0-26-2023-5-9",a:"_0-0-26-2023-5-9"},"10.13":{t:"_0-0-25-2023-4-22",p:`
checkNull和checkNotNull函数现在可以检查数字类型的参数是否为NaN了。

`,l:"guide/changelog.html#_0-0-25-2023-4-22",a:"_0-0-25-2023-4-22"},"10.14":{t:"_0-0-24-2023-4-18",p:`
新增了 checkNotNull 函数，用于检查字符串是否不为空，此函数会反义 checkNull 函数，方便使用。

`,l:"guide/changelog.html#_0-0-24-2023-4-18",a:"_0-0-24-2023-4-18"},"10.15":{t:"_0-0-23-2023-4-15",p:`
对函数checkDeviceType进行了优化，现在可以更好的检测设备类型

`,l:"guide/changelog.html#_0-0-23-2023-4-15",a:"_0-0-23-2023-4-15"},"10.16":{t:"_0-0-22-2023-4-7",p:`
新增了 checkDeviceType 函数，用于检查设备类型，此函数不稳定，可能会在后续版本中修改

`,l:"guide/changelog.html#_0-0-22-2023-4-7",a:"_0-0-22-2023-4-7"},"10.17":{t:"_0-0-21-2023-3-22",p:`
新增了 checkEmail 函数，用于检查邮箱格式

`,l:"guide/changelog.html#_0-0-21-2023-3-22",a:"_0-0-21-2023-3-22"},"10.18":{t:"_0-0-20-2023-3-19",p:`
新增了 checkPassword 函数，用于检查密码强度

`,l:"guide/changelog.html#_0-0-20-2023-3-19",a:"_0-0-20-2023-3-19"},"10.19":{t:"_0-0-19-2023-3-19",p:`
修复了 formatBytes 函数的两个bug

`,l:"guide/changelog.html#_0-0-19-2023-3-19",a:"_0-0-19-2023-3-19"},"10.20":{t:"_0-0-1-2023-2-1",p:`
项目发布测试版本

`,l:"guide/changelog.html#_0-0-1-2023-2-1",a:"_0-0-1-2023-2-1"},"11.0":{t:"贡献指南",p:`我们使用 yarn 作为包管理工具，请先安装 yarn
npm install yarn -g

安装依赖
yarn

一键 ...`,l:"guide/contribute.html",a:"贡献指南"},"12.0":{t:"入门",p:`::: tip
本项目进入公测阶段，欢迎大家使用并提出宝贵的意见，不稳定的API会进行特殊标注。
:::
`,l:"guide/index.html",a:"入门"},"12.1":{t:"项目简介",p:`山奈/Galanga（以下简称山奈）是川菜中常用的调味品，也可以用作腌制成为单独的菜品，而这一辅料被人们俗称为姜。
在Web ...`,l:"guide/index.html#项目简介",a:"项目简介"},"12.2":{t:"使用理由",p:"相比其他的函数库，山奈希望提供在业务中常用的一些函数，而山奈也是基于TypeScript开发的，因此在使用时，您可以获得更好 ...",l:"guide/index.html#使用理由",a:"使用理由"},"12.3":{t:"兼容性",p:`单元测试保证支持如下环境：



IE
CH
FF
SF
OP
IOS
Android
Node




6+
29+
55 ...`,l:"guide/index.html#兼容性",a:"兼容性"},"12.4":{t:"开发人员",p:"\r",l:"guide/index.html#开发人员",a:"开发人员"},"12.5":{t:"负责人",p:"&lt;VPTeamMembers size=&quot;small&quot; :members=&quot;member ...",l:"guide/index.html#负责人",a:"负责人"},"12.6":{t:"贡献者",p:`请在Github上或者Gitee上查看贡献者名单，如果您也想对山奈做出贡献，请参考贡献指南。
以下是山奈的贡献者名单头像缩略 ...`,l:"guide/index.html#贡献者",a:"贡献者"},"12.7":{t:"入群交流",p:`为了方便各位开发者的交流，我们在各大平台都开设了有关山奈的交流群，欢迎大家加入。


QQ：346363551


钉钉：山 ...`,l:"guide/index.html#入群交流",a:"入群交流"},"13.0":{t:"安装",p:"\r",l:"guide/install.html",a:"安装"},"13.1":{t:"主版本-main",p:`山奈的主版本是一个在标准W3C环境下运行的JavaScript库，您可以在任何支持JavaScript的环境中使用它。
`,l:"guide/install.html#主版本-main",a:"主版本-main"},"13.2":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add galanga

npm in ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"13.3":{t:"在html单页面下使用",p:"在HTML单页面下，您可以在官方仓库内下载山奈的打包产物，然后引入至您的HTML文件中，例如您将山奈的打包产物放在 /js/ ...",l:"guide/install.html#在html单页面下使用",a:"在html单页面下使用"},"13.4":{t:"uni-app版本-uniapp",p:`山奈的UNi-APP版本是一个在UNI-APP环境下运行的JavaScript库，您可以在UNI-APP项目中使用它。
`,l:"guide/install.html#uni-app版本-uniapp",a:"uni-app版本-uniapp"},"13.5":{t:"在npm项目下使用",p:`在NPM项目下，您可以通过以下命令安装山奈：
::: code-group
yarn add @uni-helper/gal ...`,l:"guide/install.html#在npm项目下使用",a:"在npm项目下使用"},"13.6":{t:"在-uni-modules-下使用",p:"在uni_modules下，您可以在官方仓库内下载山奈的打包产物（是 dist/index.js这个文件），然后引入至您的u ...",l:"guide/install.html#在-uni-modules-下使用",a:"在-uni-modules-下使用"},"14.0":{t:"项目计划",p:`这里列出会在未来添加的新功能，和已经完成的功能

[X] 已完成
[ ] 未完成

`,l:"guide/todo.html",a:"项目计划"},"16.0":{t:"提示",p:`这是一个基于 VitePress 的文档站点。您也可以直接在这里浏览文档源文件。
`,l:"README.html",a:"提示"}},a={previewLength:62,buttonLabel:"搜索",placeholder:"搜索此文档..."},n={INDEX_DATA:e,PREVIEW_LOOKUP:t,Options:a};export{n as default};
